{
  "about_contact": "<h2>Contact</h2><p>Internet Standards Platform<br />c/o ECP<br />Maanweg 174 (8th floor)<br />2516 AB The Hague<br />The Netherlands  </p><p>CoC number: 27169301</p><h3>Email</h3><p><a href=\"mailto:question@internet.nl\">question@internet.nl</a>  </p><p><a href=\"/static/question@internet.nl_0x45028563.asc\">PGP public key</a><br />Fingerprint: ACB7 8829 4C7E 12BA E922 8C60 D894 E15F 4502 8563<br />Expiration date: 19th of March 2025</p>",
  "base_about": "About Internet.nl",
  "base_accessibility": "Accessibility",
  "base_blogs": "Blogs",
  "base_contact": "Contact",
  "base_copyright": "Copyright",
  "base_disclosure": "Report vulnerability",
  "base_faqs": "Knowledge base",
  "base_halloffame": "Hall of Fame",
  "base_halloffame_champions": "Hall of Fame - Champions!",
  "base_halloffame_lead": "{{count}} domains with 2 x 100%<br />Latest entry: {{latest|date:'d-m-Y'}}",
  "base_halloffame_link": "To Hall of Fame - Champions!",
  "base_halloffame_mail": "Hall of Fame - Email",
  "base_halloffame_web": "Hall of Fame - Websites",
  "base_home": "Home",
  "base_info": "Internet.nl is an initiative of the Internet community and the Dutch government.",
  "base_news": "News",
  "base_newslink": "To the news overview",
  "base_privacy": "Privacy statement",
  "base_test_connection_explain": "<h2>What is tested?</h2><p>After you start the connection test, we will check if your currently used internet connection offers support for the modern Internet Standards below.</p><ul><li><a href=\"/faqs/ipv6/\">IPv6</a>: are websites with modern internet addresses reachable for you?</li><li><a href=\"/faqs/dnssec/\">DNSSEC</a>: are domain signatures validated for you?</li></ul><h2>Test report?</h2><p>After the test is finished, you are directed to a test report. The report contains an overall percentage score and results per test section and per subtest. For more information see <a href=\"/faqs/report/\">\"Explanation of test report\"</a>.</p><h2>How to improve?</h2><p>You can use this test report to improve your internet connection. Usually contacting your internet provider on this will be the best next step. In the communication with your internet provider you can use the permalink (i.e. the URL) of the test report.</p><h2>Test your connection</h2>",
  "base_test_connection_label": "Test your connection",
  "base_test_connection_text": "Modern addresses reachable? <br />Domain signatures validated?",
  "base_test_connection_title": "About the connection test",
  "base_test_explain": "About the test",
  "base_test_mail_explain": "<h2>What is tested?</h2><p>After you enter a domain name of an email service, we will test if the email service offers support for the modern Internet Standards below.</p><ul><li><a href=\"/faqs/ipv6/\">IPv6</a>: reachable via modern internet address?</li><li><a href=\"/faqs/dnssec/\">DNSSEC</a>: domain names signed?</li><li><a href=\"/faqs/mailauth/\">DMARC, DKIM and SPF</a>: authenticity marks against email phishing?</li><li><a href=\"/faqs/starttls\">STARTTLS and DANE</a>: secure mail server connection?</li><li><a href=\"/faqs/rpki/\">RPKI</a>: route authorisation?</li></ul><p>Note: some standards are even relevant if there are no mail servers configured for your domain.</p><h2>Test report?</h2><p>After the test is finished, you are directed to a test report. The report contains an overall percentage score and results per test section and per subtest. For more information see <a href=\"/faqs/report/\">\"Explanation of test report\"</a>.</p><h2>How to improve?</h2><p>You can use this test report to improve your mail service. Usually contacting your mail hoster on this will be the best next step. In the communication with your mail hoster you can use the permalink (i.e. the URL) of the test report.</p><h2>Widget</h2><p>You can integrate the email test into your own website using our <a href=\"/widget-mail/\">widget code</a>.</p><h2>Test your email</h2>",
  "base_test_mail_input": "Your email address:",
  "base_test_mail_label": "Test your email",
  "base_test_mail_text": "Modern address? Anti-phishing? Secure transport? Route authorisation?",
  "base_test_mail_title": "About the email test",
  "base_test_prechecks_invalid_domain": "<strong>The given domain is invalid!</strong><br />Explanation: An A and/or AAAA record is necessary for the website test, and a SOA record for the email test.",
  "base_test_start": "Start test",
  "base_test_website_explain": "<h2>What is tested?</h2><p>After you enter a domain name of a website, we will test if the website offers support for the modern Internet Standards below.</p><ul><li><a href=\"/faqs/ipv6/\">IPv6</a>: reachable via modern address?</li><li><a href=\"/faqs/dnssec/\">DNSSEC</a>: domain name signed?</li><li><a href=\"/faqs/https/\">HTTPS</a>: secure connection?</li><li><a href=\"/faqs/appsecpriv/\">Security options</a>: security options set?</li><li><a href=\"/faqs/rpki/\">RPKI</a>: route authorisation?</li></ul><h2>Test report?</h2><p>After the test is finished, you are directed to a test report. The report contains an overall percentage score and results per test section and per subtest. For more information see <a href=\"/faqs/report/\">\"Explanation of test report\"</a>.</p><h2>How to improve?</h2><p>You can use this test report to improve your website. Usually contacting your web hoster on this will be the best next step. In the communication with your web hoster you can use the permalink (i.e. the URL) of the test report.</p><h2>Widget</h2><p>You can integrate the website test into your own website using our <a href=\"/widget-site/\">widget code</a>.</p><h2>Test your website</h2>",
  "base_test_website_input": "Your website domain name:",
  "base_test_website_label": "Test your website",
  "base_test_website_text": "Modern address? Signed domain? Secure connection? Route authorisation?",
  "base_test_website_title": "About the website test",
  "base_widget_mail": "Email test widget",
  "base_widget_site": "Website test widget",
  "connection_pagetitle": "Connection test",
  "connection_title": "Connection test",
  "detail_conn_dnssec_validation_exp": "We check if the resolvers that you use validate the DNSSEC signatures of our domain name. Resolvers are usually provided by your internet provider. Alternatively you can configure resolvers from another DNS provider. You can even use your own locally installed resolver. Although validation is done in the resolver, the communication from the resolver back to your device (referred to as 'last mile') could still be tampered with by an attacker. Thus the most secure way is to validate close to the end user device (e.g. by using a locally installed resolver), or make sure that the channel between your resolver and your end user device is secured/trusted.",
  "detail_conn_dnssec_validation_label": "DNSSEC validation",
  "detail_conn_dnssec_validation_tech_table": "DNS provider",
  "detail_conn_dnssec_validation_tech_table_dns_provider": "DNS provider",
  "detail_conn_dnssec_validation_verdict_bad": "You are <em>not</em> protected by DNSSEC signature validation.",
  "detail_conn_dnssec_validation_verdict_good": "You are protected by DNSSEC signature validation.",
  "detail_conn_ipv6_connection_exp": "We check if your device through its current internet connection is able to connect <em>directly</em> (i.e. without DNS translation) with our web server using our corresponding IPv6 address.</p><p>Some browser add-ons and routers offer functionality for domain filtering in order to enhance privacy or restrict internet use. To prevent circumvention this kind of functionality often blocks connecting to IP addresses directly, making your internet connection fail for this subtest.",
  "detail_conn_ipv6_connection_label": "IPv6 connectivity (direct)",
  "detail_conn_ipv6_connection_tech_table": "Anonymized IPv6 address|Reverse name|Internet provider",
  "detail_conn_ipv6_connection_tech_table_anonymized_ipv6_address": "Anonymized IPv6 address",
  "detail_conn_ipv6_connection_tech_table_reverse_name": "Reverse name",
  "detail_conn_ipv6_connection_tech_table_internet_provider": "Internet provider",
  "detail_conn_ipv6_connection_verdict_bad": "You are <em>not</em> able to reach computers directly on their IPv6 address.",
  "detail_conn_ipv6_connection_verdict_good": "You are able to reach computers directly on their IPv6 address.",
  "detail_conn_ipv6_dns_conn_exp": "We check if your device through its current internet connection is able to connect to our web server via IPv6. For this test we provide a domain name and we expect your resolver to resolve the domain name to the appropriate IPv6 address.",
  "detail_conn_ipv6_dns_conn_label": "IPv6 connectivity (via DNS)",
  "detail_conn_ipv6_dns_conn_verdict_bad": "You are <em>not</em> able to reach computers via DNS on their IPv6 address.",
  "detail_conn_ipv6_dns_conn_verdict_good": "You are able to reach computers via DNS on their IPv6 address.",
  "detail_conn_ipv6_ipv4_conn_exp": "We check if your device through its current internet connection is able to connect to our web server via IPv4. For this test we provide a domain name and we expect your resolver to resolve the domain name to the appropriate IPv4 address.</p><p><em>Requirement level: Optional</em>",
  "detail_conn_ipv6_ipv4_conn_label": "IPv4 connection (via DNS)",
  "detail_conn_ipv6_ipv4_conn_tech_table": "Anonymized IPv4 address|Reverse name|Internet provider",
  "detail_conn_ipv6_ipv4_conn_tech_table_anonymized_ipv4_address": "Anonymized IPv4 address",
  "detail_conn_ipv6_ipv4_conn_tech_table_reverse_name": "Reverse name",
  "detail_conn_ipv6_ipv4_conn_tech_table_internet_provider": "Internet provider",
  "detail_conn_ipv6_ipv4_conn_verdict_bad": "You are <em>not</em> able to reach computers via DNS on their IPv4 address.",
  "detail_conn_ipv6_ipv4_conn_verdict_good": "You are able to reach computers via DNS on their IPv4 address.",
  "detail_conn_ipv6_privacy_exp": "We check if your device uses IPv6 Privacy Extensions for SLAAC (or another IPv6 configuration process than SLAAC) in order to prevent leakage of its potentially privacy sensitive MAC address to computers it connects with over IPV6.",
  "detail_conn_ipv6_privacy_label": "Privacy Extensions for IPv6",
  "detail_conn_ipv6_privacy_verdict_bad": "You are using SLAAC <em>without</em> 'IPv6 Privacy Extensions'.",
  "detail_conn_ipv6_privacy_verdict_good": "You have enabled 'IPv6 Privacy Extensions' (or you are not using SLAAC).",
  "detail_conn_ipv6_resolver_conn_exp": "We check if at least one of the DNS resolvers that you are using is able to reach our authoritative name servers over IPv6. Usually your internet provider provides the DNS resolver(s).",
  "detail_conn_ipv6_resolver_conn_label": "IPv6 connectivity of DNS resolver",
  "detail_conn_ipv6_resolver_conn_verdict_bad": "Your DNS resolver is <em>not</em> able to reach name servers over IPv6.",
  "detail_conn_ipv6_resolver_conn_verdict_good": "Your DNS resolver is able to reach name servers over IPv6.",
  "detail_mail_auth_dkim_exp": "<p>We check if your domain supports DKIM records. A receiving mail server canuse the public key in your DKIM record to validate the signature in an email with a user from your domain as sender and determine its authenticity.</p><ul><li>Currently we are not able to query and evaluate the public key in your DKIM record,because we would need the DKIM selector (that should be in the mails you send) to do so.</li><li>To pass  this test we expect your name server to answer <code>NOERROR</code> to our query for<code>_domainkey.example.nl</code>. When <code>_domainkey.example.nl</code> is an 'empty non-terminal' some name servers that are not conformant with the standard<a href=\"https://www.rfc-editor.org/rfc/rfc2308\">RFC 2308</a> incorrectly answer <code>NXDOMAIN</code> instead of <code>NOERROR</code>. This makes itimpossible for us to detect support for DKIM records.</li><li>For this test we assume 'strict alignment' which is conformant with DMARC. The given domain is considered to be the sender domain in the mail body domain (<code>From:</code>) and this must be identical to the DKIM domain (<code>d=</code>) and the SPF domain (envelope sender, i.e. return-path that shows up in <code>MAIL FROM</code>).</li></ul><p>Additional notes: </p><ul><li>Some mail systems modify email in transit, potentially invalidating a DKIM signature. In many cases these modifications are harmless. Examples are whitespace replacement and header field line rewrapping. If you are a DKIM signing sender then you can choose whether or not to tolerate these types of changes, both for the header and the body of emails. The <code>simple</code> setting tolerates almost no modifications, and <code>relaxed</code> tolerates common modifications. If no setting is specified it defaults to <code>simple</code> for both header and body. In particular, header modifications are a common cause of a DKIM signature unintentionally becoming invalid, thus hindering deliverability. Using <code>relaxed</code> for the header while keeping <code>simple</code> for the body (<code>c=relaxed/simple</code>), can mitigate these kind of issues.</li><li>For a \"good practice on domains without mail\" see the <a href=\"#control-panel-9\">explanation of the \"DMARC policy\" subtest</a>.</li></ul>",
  "detail_mail_auth_dkim_label": "DKIM existence",
  "detail_mail_auth_dkim_verdict_bad": "Your domain does <em>not</em> support DKIM records.",
  "detail_mail_auth_dkim_verdict_good": "Your domain supports DKIM records.",
  "detail_mail_auth_dkim_verdict_no_email": "Your domain does <em>not</em> support DKIM records. However because your DMARC and SPF records hint that no mail is sent from your domain, DKIM is not necessary and this subtest is skipped.",
  "detail_mail_auth_dmarc_exp": "We check if DMARC is available for your domain. A receiving mail server mayuse your DMARC policy to evaluate how to handle a mail with your domain assender that could not be authenticated with both DKIM and SPF, and it mayuse your mail address from the DMARC record to provide feedback reports onthe authentication to you. Having more than one DMARC record in the same domainis not valid and will lead to a test failure.Note: DMARC requires the SPFdomain (envelope sender, i.e. return-path that shows up in <code>MAIL FROM</code>) andthe DKIM domain (<code>d=</code>) to align with the mail body domain (<code>From:</code>).",
  "detail_mail_auth_dmarc_label": "DMARC existence",
  "detail_mail_auth_dmarc_tech_table": "DMARC record|Found on",
  "detail_mail_auth_dmarc_tech_table_dmarc_record": "DMARC record",
  "detail_mail_auth_dmarc_tech_table_found_on": "Found on",
  "detail_mail_auth_dmarc_verdict_bad": "Your domain does <em>not</em> have a DMARC record.",
  "detail_mail_auth_dmarc_verdict_good": "Your domain has a DMARC record.",
  "detail_mail_auth_dmarc_policy_exp": "<p>We check if the syntax of your DMARC record is correct and if it contains a sufficiently strict policy (<code>p=quarantine</code> or <code>p=reject</code>) in order to prevent abuse of your domain by phishers and spammers. Even without a strict policy, DMARC can be useful to get more insight in legitimate and illegitimate outbound mail flows through DMARC reports. However to be effective against abuse of your domain, a liberal policy (<code>p=none</code>) is insufficient.</p><p>We also check whether the mail addresses under <code>rua=</code> and <code>ruf=</code> are valid. In case they contain an external mail address we check whether the external domain is authorised to receive DMARC reports. Make sure that the DMARC authorisation record on the external domain contains at least <code>\"v=DMARC1;\"</code>.</p><p>The test permits the use of the experimental <code>np</code> tag (<a href=\"https://www.rfc-editor.org/rfc/rfc9091\">RFC 9091</a>).</p><p><em>Good practice for domains without mail</em>:</p><ul><li>Non-sending: Use the most strict DMARC policy (<code>p=reject</code>) and SPF policy (<code>-all</code>) for your domain that you do not use for sending mail in order to prevent abuse ('spoofing'). Note that DKIM is not necessary in this case.</li><li>Non-receiving: For more information on \"Null MX\" and \"No MX\" see the <a href=\"#control-panel-13\">explanation of the \"STARTTLS available\" subtest</a>. </li></ul><p>Below you will find two basic example DNS configurations for domain names that are not used to send and receive mail. </p><p><em>A. Single domain without A or AAAA record</em></p><pre><code>example.nl. TXT \"v=spf1 -all\"*.example.nl. TXT \"v=spf1 -all\"_dmarc.example.nl. TXT \"v=DMARC1; p=reject;\"</code></pre><p>&nbsp;</p><p><em>B. Single no-mail domain with A or AAAA record</em></p><pre><code>example.nl. AAAA 2a00:d78:0:712:94:198:159:35example.nl. A 94.198.159.35example.nl. MX 0 .example.nl. TXT \"v=spf1 -all\"*.example.nl. TXT \"v=spf1 -all\"www.example.nl. CNAME example.nl_dmarc.example.nl. TXT \"v=DMARC1; p=reject;\"</code></pre>",
  "detail_mail_auth_dmarc_policy_label": "DMARC policy",
  "detail_mail_auth_dmarc_policy_verdict_bad": "Your DMARC policy is <em>not</em> syntactically correct.",
  "detail_mail_auth_dmarc_policy_verdict_external": "The domain of the external mail address following <code>rua=</code> and/or <code>ruf=</code> has <em>no</em> (valid) authorisation record for receiving DMARC reports for the tested domain. ",
  "detail_mail_auth_dmarc_policy_verdict_good": "Your DMARC policy is sufficiently strict.",
  "detail_mail_auth_dmarc_policy_verdict_policy": "Your DMARC policy is <em>not</em> sufficiently strict.",
  "detail_mail_auth_spf_exp": "We check if your domain has an SPF record. A receiving mail server can use the IP addresses in your SPF record to authenticate the sending mail server of a received email with your domain as sender. The accompanying policy can be used to take appropriate action if authentication fails. Having more than one SPF record in the same domain is not valid and will lead to a test failure.</p><p>For a \"good practice on domains without mail\" see the <a href=\"#control-panel-9\">explanation of the \"DMARC policy\" subtest</a>.",
  "detail_mail_auth_spf_label": "SPF existence",
  "detail_mail_auth_spf_tech_table": "SPF record",
  "detail_mail_auth_spf_tech_table_spf_record": "SPF record",
  "detail_mail_auth_spf_verdict_bad": "Your domain does <em>not</em> have a valid SPF record.",
  "detail_mail_auth_spf_verdict_good": "Your domain has an SPF record.",
  "detail_mail_auth_spf_policy_exp": "We check if the syntax of your SPF record is correct and if it contains a sufficiently strict policy i.e. <code>~all</code> (softfail) or <code>-all</code> (fail) in order to prevent abuse by phishers and spammers. To be effective against abuse of your domain, a liberal policy i.e. <code>+all</code> (pass) or <code>?all</code> (neutral) is insufficient. If <code>all</code> is missing and a <code>redirect</code> modifier is not present in your SPF record, the default is <code>?all</code>. </p><p>We also follow <code>include</code> and <code>redirect</code> for valid SPF records. In addition, we check that your SPF record does not exceed the allowed number of 10 DNS lookups making it ineffective. Each of the following SPF terms counts as a DNS lookup: <code>redirect</code>, <code>include</code>, <code>a</code>, <code>mx</code>, <code>ptr</code> and <code>exist</code>. While the SPF terms <code>all</code>, <code>ip4</code>, <code>ip6</code> and <code>exp</code> do not count as DNS lookups.</p><p>Note that if the <code>include</code> or <code>redirect</code> domain consists of macros, we will not follow them as we do not have the necessary information from an actual mail or mail server connection to expand those macros. This means that we do not evaluate the outcome of macros. Moreover, we do not count DNS lookups caused by macros to determine whether the allowed number of DNS lookups has been exceeded.</p><p>For sending domains, using <code>~all</code> (softfail) instead of <code>-all</code> (fail) is usually preferred. This is because when SPF authentication fails with an SPF fail, a receiving mail server may already block the connection without evaluating the DKIM signature and DMARC policy. This can lead to falsely blocked mails (e.g. when mails are automatically forwarded by the receiving mail server to another receiving mail server). Note that a triggered SPF softfail still ensures that a strict DMARC policy protects your domain if DKIM authentication also fails.</p><p>For no-mail domains see the good practice on <a href=\"#control-panel-9\">explanation of the \"DMARC policy\" subtest</a>.",
  "detail_mail_auth_spf_policy_label": "SPF policy",
  "detail_mail_auth_spf_policy_tech_table": "Domain|SPF record",
  "detail_mail_auth_spf_policy_tech_table_domain": "Domain",
  "detail_mail_auth_spf_policy_tech_table_spf_record": "SPF record",
  "detail_mail_auth_spf_policy_verdict_all": "Your SPF policy is <em>not</em> sufficiently strict.",
  "detail_mail_auth_spf_policy_verdict_bad": "Your SPF policy is <em>not</em> syntactically correct.",
  "detail_mail_auth_spf_policy_verdict_good": "Your SPF policy is sufficiently strict.",
  "detail_mail_auth_spf_policy_verdict_include": "Your SPF policy is <em>not</em> sufficiently strict. The 'include' mechanism in your SPF record points to an insufficiently strict SPF policy or a non-existing SPF record.",
  "detail_mail_auth_spf_policy_verdict_max_lookups": "Your SPF policy is <em>not</em> effective as it requires more than the allowed 10 DNS lookups. Each of the following SPF terms counts as a DNS lookup: <code>redirect</code>, <code>include</code>, <code>a</code>, <code>mx</code>, <code>ptr</code> and <code>exist</code>. The SPF terms <code>all</code>, <code>ip4</code>, <code>ip6</code> and <code>exp</code> do not count as DNS lookups.",
  "detail_mail_auth_spf_policy_verdict_redirect": "Your SPF policy is <em>not</em> sufficiently strict. The 'redirect' modifier in your SPF record points to an insufficiently strict SPF policy or a non-existing SPF record.",
  "detail_mail_dnssec_exists_exp": "We check if your domain, more specifically its SOA record, is DNSSEC signed. With a DNSSEC signature senders who validate domain signatures can verify the authenticity of the DNS reply that contains your mail server domains (MX). This prevents an attacker from manipulating the DNS answer in order to redirect mails sent to you to the attacker's mail server domain.</p><p>If a domain redirects to another domain via <code>CNAME</code>, then we also check if the CNAME domain is signed (which is conformant with the DNSSEC standard). If the CNAME domain is not signed, the result of this subtest will be negative.</p><p>Note: the validity of the signature is not part of this subtest, but part of the next subtest.",
  "detail_mail_dnssec_exists_label": "DNSSEC existence",
  "detail_mail_dnssec_exists_tech_table": "Email address domain|Registrar",
  "detail_mail_dnssec_exists_tech_table_email_address_domain": "Email address domain",
  "detail_mail_dnssec_exists_tech_table_registrar": "Registrar",
  "detail_mail_dnssec_exists_verdict_bad": "Your email address domain is insecure, because it is <em>not</em> DNSSEC signed.",
  "detail_mail_dnssec_exists_verdict_good": "Your email address domain is DNSSEC signed.",
  "detail_mail_dnssec_exists_verdict_resolver_error": "Unfortunately an error occurred in Internet.nl's resolver. Please <a href=\"/about/\">contact</a> us.",
  "detail_mail_dnssec_exists_verdict_servfail": "The name servers of your email address domain are <em>broken</em>. They returned an error (<code>SERVFAIL</code>) to our queries for a DNSSEC signature. Please contact  your name server operator (often your hosting provider and/or registrar) to fix this soon.",
  "detail_mail_dnssec_mx_exists_exp": "We check if the domains of your mail servers (MX), more specifically their SOA records, are DNSSEC signed. With a DNSSEC signature senders who validate domain signatures can verify the authenticity of the DNS reply containing the IP addresses and DANE records of your mail server(s). This prevents an attacker from manipulating the DNS answer in order to redirect mails sent to you to an IP address controlled by the attacker or to eavesdrop on the secured mail server connection.</p><p>If a domain redirects to another domain via <code>CNAME</code>, then we also check if the CNAME domain is signed (which is conformant with the DNSSEC standard). If the CNAME domain is not signed, the result of this subtest will be negative.</p><p>Note that the email test does not fall back to A/AAAA records for mail servers in case of absence of an MX record.</p><p>The validity of the signature is not part of this subtest, but part of the next subtest.",
  "detail_mail_dnssec_mx_exists_label": "DNSSEC existence",
  "detail_mail_dnssec_mx_exists_tech_table": "Domain of mail server (MX)|DNSSEC existent",
  "detail_mail_dnssec_mx_exists_tech_table_domain_of_mail_server_mx": "Domain of mail server (MX)",
  "detail_mail_dnssec_mx_exists_tech_table_dnssec_existent": "DNSSEC existent",
  "detail_mail_dnssec_mx_exists_verdict_bad": "At least one of your mail server domains is insecure, because it is <em>not</em> DNSSEC signed.",
  "detail_mail_dnssec_mx_exists_verdict_good": "All your mail server domains are DNSSEC signed.",
  "detail_mail_dnssec_mx_exists_verdict_invalid_null_mx": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, either your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary. Or on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting.",
  "detail_mail_dnssec_mx_exists_verdict_no_mailservers": "The SPF record on your domain indicates that your domain may be used for sending mail. However, your domain does not have a receiving mail server (MX), which could hinder deliverability of your sent mails because not having an MX may be seen by receivers as an indicator for spam. Therefore if you really want to send mail from this domain, configure an MX. However, if you do not want to send mail from this domain, configure an SPF record with the <code>-all</code> term only and besides a \"Null MX\" record if your domain has A/AAAA records. Because of your configuration, the subtests in the STARTTLS and DANE category and the mail server specific subtests in the IPv6 and DNSSEC categories are not applicable.",
  "detail_mail_dnssec_mx_exists_verdict_no_null_mx": "No receiving mail servers (MX) are set on your domain that has A/AAAA records. We recommend you to explicitly indicate that your domain does not accept email by configuring a \"Null MX\" record. Do not use a \"Null MX\" record and set an MX if you do want to send email from this domain name, as receiving servers may reject email that has an invalid return address.",
  "detail_mail_dnssec_mx_exists_verdict_null_mx": "Your domain name that has A/AAAA records clearly indicates with a \"Null MX\" record that it does not accept e-mail. This is fine if you do not want to receive email. Do not use a \"Null MX\" record and set an MX if you do want to send email from this domain name, as receiving servers may reject email that has an invalid return address.",
  "detail_mail_dnssec_mx_exists_verdict_null_mx_with_other_mx": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting.",
  "detail_mail_dnssec_mx_exists_verdict_null_mx_without_a_aaaa": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary.",
  "detail_mail_dnssec_mx_exists_verdict_resolver_error": "Unfortunately an error occurred in Internet.nl's resolver. Please <a href=\"/about/\">contact</a> us.",
  "detail_mail_dnssec_mx_exists_verdict_servfail": "The name servers of at least one of your mail server domains are <em>broken</em>. They returned an error (<code>SERVFAIL</code>) to our queries for a DNSSEC signature. Please contact your name server operator (often your mail provider) to fix this soon.",
  "detail_mail_dnssec_mx_valid_exp": "We check if the domains of your receiving mail servers (MX), more specifically their SOA records, are signed with a valid signature making them 'secure'.</p><p>If a domain name redirects to another signed domain name via <code>CNAME</code>, then we also check if the signature of the CNAME domain name is valid (which is conformant with the DNSSEC standard). If the signature of the CNAME domain name is not valid, the result of this subtest will be negative.</p><p>Note that we only test the name server that responds first. If name servers of a domain name have inconsistent configurations, this can lead to varying test results. In that case, for example, the result for this subtest may be 'secure' one time and 'bogus' the next.",
  "detail_mail_dnssec_mx_valid_label": "DNSSEC validity",
  "detail_mail_dnssec_mx_valid_tech_table": "Domain of mail server (MX)|Status",
  "detail_mail_dnssec_mx_valid_tech_table_domain_of_mail_server_mx": "Domain of mail server (MX)",
  "detail_mail_dnssec_mx_valid_tech_table_status": "Status",
  "detail_mail_dnssec_mx_valid_verdict_bad": "At least one of your signed mail server domains is 'bogus', because its DNSSEC signature is not valid. Either someone manipulated the responses from its name servers, or your mail server domain has serious DNSSEC configuration errors. The latter makes your receiving mail server unreachable for any sending mail server that validates DNSSEC signatures. You should contact the name server operator (often your mail provider) as soon as possible.",
  "detail_mail_dnssec_mx_valid_verdict_good": "All your signed mail server domains are secure, because their DNSSEC signatures are valid.",
  "detail_mail_dnssec_mx_valid_verdict_unsupported_ds_algo": "At least one of your mail server domains is signed with an algorithm that our validating resolver currently does not support. Therefore we are not able to check the validity of its DNSSEC signature.",
  "detail_mail_dnssec_valid_exp": "We check if your domain, more specifically its SOA record, is signed with a valid signature making it 'secure'.</p><p>If a domain name redirects to another signed domain name via <code>CNAME</code>, then we also check if the signature of the CNAME domain name is valid (which is conformant with the DNSSEC standard). If the signature of the CNAME domain name is not valid, the result of this subtest will be negative.</p><p>Note that we only test the name server that responds first. If name servers of a domain name have inconsistent configurations, this can lead to varying test results. In that case, for example, the result for this subtest may be 'secure' one time and 'bogus' the next.",
  "detail_mail_dnssec_valid_label": "DNSSEC validity",
  "detail_mail_dnssec_valid_tech_table": "Email address domain|Status",
  "detail_mail_dnssec_valid_tech_table_email_address_domain": "Email address domain",
  "detail_mail_dnssec_valid_tech_table_status": "Status",
  "detail_mail_dnssec_valid_verdict_bad": "Your email address domain is 'bogus', because the DNSSEC signature is <em>not</em> valid. Either someone manipulated the response from your name server, or your domain has a <em>serious DNSSEC configuration error</em>. The latter makes your domain unreachable for any user who validates DNSSEC signatures. You should contact your name server operator (often your registrar or hosting provider) as soon as possible.",
  "detail_mail_dnssec_valid_verdict_good": "Your email address domain is secure, because its DNSSEC signature is valid.",
  "detail_mail_dnssec_valid_verdict_unsupported_ds_algo": "Your email address domain is signed with an algorithm that our validating resolver currently does not support. Therefore we are not able to check the validity of its DNSSEC signature.",
  "detail_mail_ipv6_mx_aaaa_exp": "We check if there is at least one AAAA record with IPv6 address for every receiving mail server (MX). In case no mail server is defined, we give a notification and we execute other subtests of the mail test that are still relevant.</p><p>'IPv4-mapped IPv6 addresses' (<a href=\"https://www.rfc-editor.org/rfc/rfc4291\">RFC 4291</a>, beginning with ::ffff:) will fail in this subtest, as they do not provide IPv6 connectivity.</p><p>Note that the email test does not fall back to A/AAAA records for mail servers in case of absence of an MX record.",
  "detail_mail_ipv6_mx_aaaa_label": "IPv6 addresses for mail server(s)",
  "detail_mail_ipv6_mx_aaaa_tech_table": "Mail server (MX)|IPv6 address|IPv4 address",
  "detail_mail_ipv6_mx_aaaa_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_ipv6_mx_aaaa_tech_table_ipv6_address": "IPv6 address",
  "detail_mail_ipv6_mx_aaaa_tech_table_ipv4_address": "IPv4 address",
  "detail_mail_ipv6_mx_aaaa_verdict_bad": "At least one receiving mail server on your domain does <em>not</em> have an IPv6 address.",
  "detail_mail_ipv6_mx_aaaa_verdict_good": "All receiving mail servers on your domain have an IPv6 address.",
  "detail_mail_ipv6_mx_aaaa_verdict_invalid_null_mx": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, either your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary. Or on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting.",
  "detail_mail_ipv6_mx_aaaa_verdict_no_null_mx": "No receiving mail servers (MX) are set on your domain that has A/AAAA records and has an SPF record with only the term -all. We recommend you to set a \"Null MX\" record to explicitly indicate that your domain does not accept email. Because of your configuration, the subtests in the STARTTLS and DANE category and the mail server specific subtests in the IPv6 and DNSSEC categories are not applicable.",
  "detail_mail_ipv6_mx_aaaa_verdict_null_mx": "Your domain name that has A/AAAA records clearly indicates with a \"Null MX\" record that it does not accept e-mail. This is fine if you do not want to receive email. Do not use a \"Null MX\" record and set an MX if you do want to send email from this domain name, as receiving servers may reject email that has an invalid return address.",
  "detail_mail_ipv6_mx_aaaa_verdict_null_mx_with_other_mx": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting.",
  "detail_mail_ipv6_mx_aaaa_verdict_null_mx_without_a_aaaa": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary.",
  "detail_mail_ipv6_mx_aaaa_verdict_other": "The SPF record on your domain indicates that your domain may be used for sending mail. However, your domain does not have a receiving mail server (MX), which could hinder deliverability of your sent mails because not having an MX may be seen by receivers as an indicator for spam. Therefore if you really want to send mail from this domain, configure an MX. However, if you do not want to send mail from this domain, configure an SPF record with the <code>-all</code> term only and besides a \"Null MX\" record if your domain has A/AAAA records. Because of your configuration, the subtests in the STARTTLS and DANE category and the mail server specific subtests in the IPv6 and DNSSEC categories are not applicable.",
  "detail_mail_ipv6_mx_reach_exp": "We check if we can connect to your mail servers (MX) over IPv6 on port 25. We test all IPv6 addresses that we receive from the name servers of your mail server domain(s). A partial score will be given if not all IPv6 addresses are reachable. If an IPv6 address is (syntactically) invalid, we consider it unreachable.",
  "detail_mail_ipv6_mx_reach_label": "IPv6 reachability of mail server(s)",
  "detail_mail_ipv6_mx_reach_tech_table": "Mail server (MX)|Unreachable IPv6 address",
  "detail_mail_ipv6_mx_reach_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_ipv6_mx_reach_tech_table_unreachable_ipv6_address": "Unreachable IPv6 address",
  "detail_mail_ipv6_mx_reach_verdict_bad": "At least one of your receiving mail servers with an IPv6 address is <em>not</em> reachable over IPv6.",
  "detail_mail_ipv6_mx_reach_verdict_good": "All your receiving mail servers with an IPv6 address are reachable over IPv6.",
  "detail_mail_rpki_exists_exp": "We check if an RPKI Route Origin Authorization (ROA) has been published for all IP addresses of your mail server(s) (MX).</p><p>Your hoster (or its network provider) announces through the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. Other network providers use these route announcements to determine via which route to send traffic for your server's IP addresses.</p><p>However, a route announcement can be faked. In fact, another network provider may be able to connect the IP address block of your IP address to its network and thus potentially receive Internet traffic that is actually intended for your network provider. The cause may be accidental or malicious. In either case, this can result in your server becoming unreachable or in Internet traffic to your server being intercepted.</p><p>Resource Public Key Infrastructure (RPKI) significantly improves protection against this. With RPKI, the rightful holder of a block of IP addresses can publish a digitally signed statement with route authorization (Route Origin Authorisation; ROA for short). Another network provider that wants to send Internet traffic to a particular IP address, can use the corresponding statement to filter out <code>Invalid</code> routes. In this way, the network provider prevents Internet traffic from its network from being sent to unauthorized provider networks.",
  "detail_mail_rpki_exists_label": "Route Origin Authorisation existence",
  "detail_mail_rpki_exists_tech_table": "Mail server|IP address|RPKI Route Origin Authorization",
  "detail_mail_rpki_exists_tech_table_mail_server": "Mail server",
  "detail_mail_rpki_exists_tech_table_ip_address": "IP address",
  "detail_mail_rpki_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_mail_rpki_exists_verdict_bad": "For at least one of the IP addresses of your receiving mail server(s) <em>no</em> RPKI Route Origin Authorisation (ROA) is published.",
  "detail_mail_rpki_exists_verdict_good": "For all IP addresses of your receiving mail server(s) an RPKI Route Origin Authorisation (ROA) is published.",
  "detail_mail_rpki_exists_verdict_no_addresses": "Your domain does <em>not</em> contain any receiving mail servers. Therefore, this subtest could not be performed.",
  "detail_mail_rpki_mx_ns_exists_exp": "We check if an RPKI Route Origin Authorization (ROA) has been published for all IP addresses of the name servers of your mail server(s) (MX).</p><p>Your hoster (or its network provider) announces through the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. Other network providers use these route announcements to determine via which route to send traffic for your server's IP addresses.</p><p>However, a route announcement can be faked. In fact, another network provider may be able to connect the IP address block of your IP address to its network and thus potentially receive Internet traffic that is actually intended for your network provider. The cause may be accidental or malicious. In either case, this can result in your server becoming unreachable or in Internet traffic to your server being intercepted.</p><p>Resource Public Key Infrastructure (RPKI) significantly improves protection against this. With RPKI, the rightful holder of a block of IP addresses can publish a digitally signed statement with route authorization (Route Origin Authorisation; ROA for short). Another network provider that wants to send Internet traffic to a particular IP address, can use the corresponding statement to filter out <code>Invalid</code> routes. In this way, the network provider prevents Internet traffic from its network from being sent to unauthorized provider networks.",
  "detail_mail_rpki_mx_ns_exists_label": "Route Origin Authorisation existence",
  "detail_mail_rpki_mx_ns_exists_tech_table": "Name server of MX|IP address|RPKI Route Origin Authorization",
  "detail_mail_rpki_mx_ns_exists_tech_table_name_server_of_mx": "Name server of MX",
  "detail_mail_rpki_mx_ns_exists_tech_table_ip_address": "IP address",
  "detail_mail_rpki_mx_ns_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_mail_rpki_mx_ns_exists_verdict_bad": "For at least one of the IP addresses of the name servers of your mail server(s) <em>no</em> RPKI Route Origin Authorisation (ROA) is published.",
  "detail_mail_rpki_mx_ns_exists_verdict_good": "For all IP addresses of the name servers of your mail server(s) an RPKI Route Origin Authorisation (ROA) is published.",
  "detail_mail_rpki_mx_ns_exists_verdict_no_addresses": "Your domain does <em>not</em> contain any mail servers. Therefore, this subtest could not be performed.",
  "detail_mail_rpki_mx_ns_valid_exp": "We check if the validation status for all IP addresses of the name servers of your mail servers (MX) is <code>Valid</code>. If there are multiple overlapping route announcements for the IP address, we test that they are all <code>Valid</code>.</p><p>Your hoster (or its network provider) announces via the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. It does this by associating (parts of) its IP address blocks (Route Prefix) with the unique number of its provider network (Route Origin ASN), and then distributing this routing information. Other network providers use these route announcements to determine via which route to send traffic for the IP addresses.</p><p>Additionally, for each route announcement, your hoster (or its network provider) should publish a digitally signed statement with route authorisation (Route Origin Authorisation; abbreviated: ROA) statement using Resource Public Key Infrastructure (RPKI). </p><p>Another network provider that is asked to send Internet traffic to your server's IP address can cryptographically verify the associated statement. The verified content (Validated ROA Payload; abbreviated: VRP) includes which provider networks (VRP ASN) are authorised to receive Internet traffic for each recorded IP address block (VRP Prefix). </p><p>The network provider can then use this content to filter BGP routes. For example, he can reject any <code>Invalid</code> routes, to prevent Internet traffic from its network is  sent to unauthorised provider networks.</p><p>Checking route announcements against route authorisations (RPKI Origin Validation; abbreviated: ROV) has the following three possible outcomes.</p><p>1․ <code>Valid</code>: The route announcement of the considered IP address is matched by at least one published route authorisation. A route authorisation is also matched for more specific route announcements (i.e., for a part of the IP address block contained in the route authorisation), unless they are more specific than the limit specified in the route authorisation (via the <code>maxLength</code> attribute). </p><p>2․ <code>Invalid</code>: The route announcement of the considered IP address is covered by a route authorisation, but it does <em>not</em> match. There are two possible causes:</p><ul><li>the IP address block (Route Prefix) is announced from a provider network (Route Origin ASN) that is <em>not</em> authorised in the route authorisation (result in the table below: \"invalid (as)\");</li><li>the IP address block (Route Prefix) that is announced is <em>smaller than is allowed</em> in the route authorisation, i.e. exceeding <code>maxLength</code> value (result in table below: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: No statement with route-authorisation has been found that covers the route announcement of the considered IP address. This makes the routing of Internet traffic to your server less secure. Please contact your hoster about this. He can ask his network provider that owns your server's IP addresses to publish route authorisations.</p><p><strong>What to do if the test result shows the status Invalid?</strong></p><p>The status <code>Invalid</code> indicates an unintentional or malicious route configuration error, that can be caused by your hoster or its network provider (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your hoster as soon as possible. In the case of an internal error, your hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error. ",
  "detail_mail_rpki_mx_ns_valid_label": "Route announcement validity",
  "detail_mail_rpki_mx_ns_valid_tech_table": "Name server of MX|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation state",
  "detail_mail_rpki_mx_ns_valid_tech_table_name_server_of_mx": "Name server of MX",
  "detail_mail_rpki_mx_ns_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_mail_rpki_mx_ns_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_mail_rpki_mx_ns_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation state",
  "detail_mail_rpki_mx_ns_valid_verdict_bad": "At least one IP address of the name servers of your receiving mail servers has a <code>NotFound</code> validation state. There is <em>no</em> RPKI Route Origin Authorization (ROA) published for the route announcement of each of the affected IP addresses.",
  "detail_mail_rpki_mx_ns_valid_verdict_good": "All IP addresses of the name servers of your receiving mail servers have a <code>Valid</code> validation state. The route announcement of these IP addresses is matched by the published RPKI Route Origin Authorisation (ROA).",
  "detail_mail_rpki_mx_ns_valid_verdict_invalid": "At least one IP address of the name servers of your receiving mail servers has an <code>Invalid</code> validation state. The route announcement of the affected IP addresses is <em>not</em> matched by the published RPKI Route Origin Authorisation (ROA). This indicates an unintentional or malicious route configuration error, that can be caused by your mail hoster (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your mail hoster as soon as possible. In the case of an internal error, your mail hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error.",
  "detail_mail_rpki_mx_ns_valid_verdict_not_routed": "This subtest did <em>not</em> run, because <em>no</em> route announcement was available for any of the IP addresses.",
  "detail_mail_rpki_valid_exp": "We check if the validation status for all IP addresses of your mail servers (MX) is <code>Valid</code>. If there are multiple overlapping route announcements for the IP address, we test that they are all <code>Valid</code>.</p><p>Your hoster (or its network provider) announces via the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. It does this by associating (parts of) its IP address blocks (Route Prefix) with the unique number of its provider network (Route Origin ASN), and then distributing this routing information. Other network providers use these route announcements to determine via which route to send traffic for the IP addresses.</p><p>Additionally, for each route announcement, your hoster (or its network provider) should publish a digitally signed statement with route authorisation (Route Origin Authorisation; abbreviated: ROA) statement using Resource Public Key Infrastructure (RPKI). </p><p>Another network provider that is asked to send Internet traffic to your server's IP address can cryptographically verify the associated statement. The verified content (Validated ROA Payload; abbreviated: VRP) includes which provider networks (VRP ASN) are authorised to receive Internet traffic for each recorded IP address block (VRP Prefix). </p><p>The network provider can then use this content to filter BGP routes. For example, he can reject any <code>Invalid</code> routes, to prevent Internet traffic from its network is  sent to unauthorised provider networks.</p><p>Checking route announcements against route authorisations (RPKI Origin Validation; abbreviated: ROV) has the following three possible outcomes.</p><p>1․ <code>Valid</code>: The route announcement of the considered IP address is matched by at least one published route authorisation. A route authorisation is also matched for more specific route announcements (i.e., for a part of the IP address block contained in the route authorisation), unless they are more specific than the limit specified in the route authorisation (via the <code>maxLength</code> attribute). </p><p>2․ <code>Invalid</code>: The route announcement of the considered IP address is covered by a route authorisation, but it does <em>not</em> match. There are two possible causes:</p><ul><li>the IP address block (Route Prefix) is announced from a provider network (Route Origin ASN) that is <em>not</em> authorised in the route authorisation (result in the table below: \"invalid (as)\");</li><li>the IP address block (Route Prefix) that is announced is <em>smaller than is allowed</em> in the route authorisation, i.e. exceeding <code>maxLength</code> value (result in table below: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: No statement with route-authorisation has been found that covers the route announcement of the considered IP address. This makes the routing of Internet traffic to your server less secure. Please contact your hoster about this. He can ask his network provider that owns your server's IP addresses to publish route authorisations.</p><p><strong>What to do if the test result shows the status Invalid?</strong></p><p>The status <code>Invalid</code> indicates an unintentional or malicious route configuration error, that can be caused by your hoster or its network provider (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your hoster as soon as possible. In the case of an internal error, your hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error.",
  "detail_mail_rpki_valid_label": "Route announcement validity",
  "detail_mail_rpki_valid_tech_table": "Mail server|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation state",
  "detail_mail_rpki_valid_tech_table_mail_server": "Mail server",
  "detail_mail_rpki_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_mail_rpki_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_mail_rpki_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation state",
  "detail_mail_rpki_valid_verdict_bad": "At least one IP address of your receiving mail servers has a <code>NotFound</code> validation state. There is <em>no</em> RPKI Route Origin Authorization (ROA) published for the route announcement of each of the affected IP addresses.",
  "detail_mail_rpki_valid_verdict_good": "All IP addresses of your receiving mail servers have a <code>Valid</code> validation state. The route announcement of these IP addresses is matched by the published RPKI Route Origin Authorisation (ROA).",
  "detail_mail_rpki_valid_verdict_invalid": "At least one IP address of your receiving mail servers has an <code>Invalid</code> validation state. The route announcement of the affected IP addresses is <em>not</em> matched by the published RPKI Route Origin Authorisation (ROA). This indicates an unintentional or malicious route configuration error, that can be caused by your mail hoster (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your mail hoster as soon as possible. In the case of an internal error, your mail hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error.",
  "detail_mail_rpki_valid_verdict_not_routed": "This subtest did <em>not</em> run, because <em>no</em> route announcement was available for any of the IP addresses.",
  "detail_mail_tls_cert_hostmatch_exp": "We check if the domain name of each of your receiving mail servers (MX) matches the domain name on the presented certificates. </p><p>Sending mail servers usually ignore the domain in the certificate. Without DNSSEC the lookup of the mail server domain is vulnerable to manipulation. Thus matching the domain on the certificate against the mail server domain does not add any authenticity value. Quite a few receiving mail servers are therefore using self-signed certificates, often issued by an internal (private) certificate authority. </p><p>For authenticity a mail server should use DNSSEC and DANE. A certificate with a domain that matches the domain of the mail server is only required when DANE 'trust anchor assertion' (DANE-TA, 2) is used.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B3-1 (in English).</p><p><em>Requirement level: Optional / Required (only when DANE-TA is used)</em>",
  "detail_mail_tls_cert_hostmatch_label": "Domain name on certificate",
  "detail_mail_tls_cert_hostmatch_tech_table": "Mail server (MX)|Unmatched domains on certificate",
  "detail_mail_tls_cert_hostmatch_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_cert_hostmatch_tech_table_unmatched_domains_on_certificate": "Unmatched domains on certificate",
  "detail_mail_tls_cert_hostmatch_verdict_bad": "The domain name of at least one of your mail servers does <em>not</em> match the domain name on the mail server certificate.",
  "detail_mail_tls_cert_hostmatch_verdict_good": "The domain names of all your mail servers match the domain names on your mail server certificates.",
  "detail_mail_tls_cert_pubkey_exp": "<p>We check if the (ECDSA or RSA) digital signature of each of your mail server certificates uses secure parameters. </p><p>The verification of certificates makes use of digital signatures. To guarantee the authenticity of a connection, a trustworthy algorithm for certificate verification must be used. The algorithm that is used to sign a certificate is selected by its supplier.The certificate specifies the algorithm for digital signatures that is used by its owner during the key exchange. It is possible to configure multiple certificates to support more than one algorithm.</p><p>The security of ECDSA digital signatures depends on the chosen curve. The security of RSA for encryption and digital signatures is tied to the key length of the public key. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B5-1 and table 9 for ECDSA, and guideline B3-3 and table 8 for RSA (in English).</p><hr /><p><strong>Elliptic curves for ECDSA</strong></p><ul><li>Good: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, and <code>x25519</code></li><li>Phase out: <code>secp224r1</code></li><li>Insufficient: Other curves</li></ul><p><strong>Length of RSA-keys</strong></p><ul><li>Good: At least 3072 bit</li><li>Sufficient: 2048 – 3071 bit</li><li>Insufficient: Less than 2048 bit</li></ul>",
  "detail_mail_tls_cert_pubkey_label": "Public key of certificate",
  "detail_mail_tls_cert_pubkey_tech_table": "Mail server (MX)|Affected signature parameters|Status",
  "detail_mail_tls_cert_pubkey_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_cert_pubkey_tech_table_affected_signature_parameters": "Affected signature parameters",
  "detail_mail_tls_cert_pubkey_tech_table_status": "Status",
  "detail_mail_tls_cert_pubkey_verdict_bad": "The digital signature of at least one of your mail server certificates uses <em>insufficiently</em> secure parameters.",
  "detail_mail_tls_cert_pubkey_verdict_good": "The digital signatures of all your mail server certificates use secure parameters.",
  "detail_mail_tls_cert_pubkey_verdict_phase_out": "The digital signature of at least one of your mail server certificates uses parameters that have a <em>phase out</em> status, because they are known to be fragile and are at risk of of becoming <em>insufficiently</em> secure.",
  "detail_mail_tls_cert_signature_exp": "<p>We check if the signed fingerprint of each of your mail server certificates was created with a secure hashing algorithm. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B3-2 and table 3 (in English).</p><hr /><p><strong>Hash functions for certificate verification</strong></p><ul><li>Good: SHA-512, SHA-384, SHA-256</li><li>Insufficient: SHA-1, MD5</li></ul>",
  "detail_mail_tls_cert_signature_label": "Signature of certificate",
  "detail_mail_tls_cert_signature_tech_table": "Mail server (MX)|Affected hash algorithm|Status",
  "detail_mail_tls_cert_signature_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_cert_signature_tech_table_affected_hash_algorithm": "Affected hash algorithm",
  "detail_mail_tls_cert_signature_tech_table_status": "Status",
  "detail_mail_tls_cert_signature_verdict_bad": "At least one of your mail server certificates is signed using a hash algorithm that is <em>insufficiently</em> secure.",
  "detail_mail_tls_cert_signature_verdict_good": "All your mail server certificates are signed using a secure hash algorithm.",
  "detail_mail_tls_cert_trust_exp": "We check if we are able to build a valid chain of trust for your mail server certificates. </p><p>For a valid chain of trust, your certificate must be published by a <a href=\"https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/\">publicly trusted certificate authority</a>, and your receiving mail server must present all necessary intermediate certificates. </p><p>Sending mail servers usually ignore whether a mail server certificate is issued by a publicly trusted certificate authority. Without DNSSEC the lookup of the mail server domain is vulnerable to manipulation. Thus a certificate issued by a publicly trusted certificate authority cannot add any authenticity value. Quite a few receiving mail servers are therefore using self-signed certificates, often issued by an internal (private) certificate authority. For authenticity a mail server should use DNSSEC and DANE.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B3-4 (in English).</p><p><em>Requirement level: Optional</em>",
  "detail_mail_tls_cert_trust_label": "Trust chain of certificate",
  "detail_mail_tls_cert_trust_tech_table": "Mail server (MX)|Untrusted certificate chain",
  "detail_mail_tls_cert_trust_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_cert_trust_tech_table_untrusted_certificate_chain": "Untrusted certificate chain",
  "detail_mail_tls_cert_trust_verdict_bad": "The trust chain of at least one of your mail server certificates is <em>not</em> complete and/or <em>not</em> signed by a trusted root certificate authority.",
  "detail_mail_tls_cert_trust_verdict_good": "The trust chain of all your mail server certificates is complete and signed by a trusted root certificate authority.",
  "detail_mail_tls_cipher_order_exp": "We check if your receiving mail servers (MX) enforce their own cipher preference ('I'), and offer ciphers in accordance with the prescribed ordering ('II'). </p><p>When your mail servers support 'Good' ciphers only, this test is not applicable as the ordering has no significant security advantage. </p><p>I. <em>Server enforced cipher preference</em>: The receiving mail servers enforce their own cipher preference while negotiating with sending mail servers, and do not accept any preference of the the sending mail servers;</p><p>II. <em>Prescribed ordering</em>: Ciphers are offered by the receiving mail servers in accordance with the prescribed order where 'Good' is preferred over 'Sufficient' over 'Phase out' ciphers.</p><p>In the above table with technical details <strong>only the first found out of prescribed order algorithm selections</strong> are listed.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B2-5.",
  "detail_mail_tls_cipher_order_label": "Cipher order",
  "detail_mail_tls_cipher_order_tech_table": "Mail server (MX)|First found affected cipher pair|Violated rule # ('II-B')",
  "detail_mail_tls_cipher_order_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_cipher_order_tech_table_first_found_affected_cipher_pair": "First found affected cipher pair",
  "detail_mail_tls_cipher_order_tech_table_violated_rule_ii_b": "Violated rule # ('II-B')",
  "detail_mail_tls_cipher_order_verdict_bad": "At least one of your mail servers does <em>not</em> enforce its own cipher preference ('I').",
  "detail_mail_tls_cipher_order_verdict_good": "All your mail servers enforce their own cipher preference ('I'), and offer ciphers in accordance with the prescribed ordering ('II').",
  "detail_mail_tls_cipher_order_verdict_na": "This subtest is not applicable as your mail server supports 'Good' ciphers only.",
  "detail_mail_tls_cipher_order_verdict_seclevel_bad": "At least one of your mail servers does <em>not</em> prefer 'Good' over 'Sufficient' over 'Phase out' ciphers ('II').",
  "detail_mail_tls_cipher_order_verdict_warning": "OUTDATED TEXT; VERDICT NOT USED</p><p>At least one of your mail servers does <em>not</em> offer ciphers in accordance with the prescribed ordering within a particular security level ('II-B').",
  "detail_mail_tls_ciphers_exp": "<p>We check if your receiving mail servers (MX) only support secure, i.e. 'Good' and/or 'Sufficient', ciphers (also known as algorithm selections).</p><p>To prevent us from running into rate limits of receiving mail servers, the test result only contains the <strong>first found affected algorithm selections</strong>.</p><p>An algorithm selection consists of ciphers for four cryptographic functions: 1) key exchange, 2) certificate verification, 3) bulk encryption, and 4) hashing. A web server may support more than one algorithm selection.</p><ul><li>Since TLS 1.3, the term 'cipher suite' only comprises ciphers used for bulk encryption and hashing. When using TLS 1.3 the ciphers for key exchange and certificate verification are negotiable and not part of the naming of the cipher suite. Because this makes the term 'cipher suite' ambiguous, NCSC-NL uses the term 'algorithm selection' to comprise all four cipher functions.</li><li>NCSC-NL uses the <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4\">IANA naming convention</a> for algorithm selections. Internet.nl uses the <a href=\"https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES\">OpenSSL naming convention</a>. Since TLS 1.3 OpenSSL follows the IANA naming convention. A translation between both can be found in the OpenSSL documentation.</li><li>Note that ciphers using PSK or SRP for key exchange (which are not sufficiently secure) are not detected in this test due to a limitation related to our testing method. </li></ul><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B2-1 to B2-4 and table 2, 4, 6 and 7 (in English).</p><hr /><p>Below you find 'Good', 'Sufficient' and 'Phase out' algorithm selections in the by NCSC-NL prescribed order, based on appendix C of the 'IT Security Guidelines for Transport Layer Security (TLS)'. Behind every algorithm selection is the minimum TLS version (e.g. [1.2]) that supports this algorithm selection and that is at least 'Phase out'.</p><p>Good:</p><ul><li><code>ECDHE-ECDSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li></ul><p>Sufficient:</p><ul><li><code>ECDHE-ECDSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-ECDSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-ECDSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-ECDSA-AES128-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-RSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-RSA-AES128-SHA</code> [1.0]</li><li><code>DHE-RSA-AES256-GCM-SHA384</code> [1.2]</li><li><code>DHE-RSA-CHACHA20-POLY1305</code> [1.2]</li><li><code>DHE-RSA-AES128-GCM-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA</code> [1.0]</li><li><code>DHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES128-SHA</code> [1.0]</li></ul><p>Phase out:</p><ul><li><code>ECDHE-ECDSA-DES-CBC3-SHA</code> [1.0]</li><li><code>ECDHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>DHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>AES256-GCM-SHA384</code> [1.2]</li><li><code>AES128-GCM-SHA256</code> [1.2]</li><li><code>AES256-SHA256</code> [1.2]</li><li><code>AES256-SHA</code>  [1.0]</li><li><code>AES128-SHA256</code> [1.2]</li><li><code>AES128-SHA</code> [1.0]</li><li><code>DES-CBC3-SHA</code> [1.0]</li></ul>",
  "detail_mail_tls_ciphers_label": "Ciphers (Algorithm selections)",
  "detail_mail_tls_ciphers_tech_table": "Mail server (MX)|First found affected cipher|Status",
  "detail_mail_tls_ciphers_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_ciphers_tech_table_first_found_affected_cipher": "First found affected cipher",
  "detail_mail_tls_ciphers_tech_table_status": "Status",
  "detail_mail_tls_ciphers_verdict_bad": "At least one of your mail servers supports one or more <em>insufficiently</em> secure ciphers.",
  "detail_mail_tls_ciphers_verdict_good": "All your mail servers support secure ciphers only.",
  "detail_mail_tls_ciphers_verdict_phase_out": "At least one of your mail servers supports one or more ciphers that have a <em>phase out</em> status, because they are known to be fragile and are at risk of becoming <em>insufficiently</em> secure.",
  "detail_mail_tls_compression_exp": "<p>We check if your receiving mail servers (MX) support TLS compression. </p><p>The use of compression can give an attacker information about the secret parts of encrypted communication. An attacker that can determine or control parts of the data sent can reconstruct the original data by performing a large number of requests. TLS compression is used so rarely that disabling it is generally not a problem. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B7-1 and table 11 (in English).</p><hr /><p><strong>Compression option</strong></p><ul><li>Good: No compression</li><li>Sufficient: Application-level compression</li><li>Insufficient: TLS compression</li></ul>",
  "detail_mail_tls_compression_label": "TLS compression",
  "detail_mail_tls_compression_tech_table": "Mail server (MX)|TLS compression",
  "detail_mail_tls_compression_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_compression_tech_table_tls_compression": "TLS compression",
  "detail_mail_tls_compression_verdict_bad": "At least on of your mail servers supports TLS compression, which is <em>not</em> secure.",
  "detail_mail_tls_compression_verdict_good": "All your mail servers do not support TLS compression.",
  "detail_mail_tls_dane_exists_exp": "We check if the name servers of each of your receiving mail servers (MX) provide a TLSA record for DANE. </p><p>As DNSSEC is preconditional for DANE, this test will fail in case DNSSEC is missing on the mail server domain(s). </p><p>Note that the test ignores TLSA records of the types PKIX-TA(0) or PKIX-EE(1) as these should not be used for receiving mail servers.</p><p>Furthermore the test will lead to a fail if there is no DNSSEC proof of 'Denial of Existence' for TLSA records. If a signed TLSA record exists but at the same time there is an insecure <code>NXDOMAIN</code> for the same domain (due to faulty signer software), the test will also show a fail. The latter two failure scenario's could lead to non-delivery of emails addressed to you by DANE validating mail senders.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, Appendix A, under 'Certificate pinning and DANE' (in English).",
  "detail_mail_tls_dane_exists_label": "DANE existence",
  "detail_mail_tls_dane_exists_tech_table": "Mail server (MX)|DANE TLSA record existent",
  "detail_mail_tls_dane_exists_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_dane_exists_tech_table_dane_tlsa_record_existent": "DANE TLSA record existent",
  "detail_mail_tls_dane_exists_verdict_bad": "At least one of your mail server domains does <em>not</em> provide a TLSA record for DANE.",
  "detail_mail_tls_dane_exists_verdict_bogus": "At least one of your mail server domains does <em>not</em> provide DNSSEC proof that DANE TLSA records do not exist. This could lead to non-deliverability of mail sent to you by DANE validating mail senders. You should ask your name server operator to fix this issue.",
  "detail_mail_tls_dane_exists_verdict_good": "All your mail server domains provide a TLSA record for DANE.",
  "detail_mail_tls_dane_rollover_exp": "We check if there is an active scheme with at least two DANE TLSA records to reliably handle certificate rollovers on your receiving mail servers (MX).</p><p>Such a scheme will be proven useful when there is a need to update your mail server certificate(s). It can prevent that DANE becomes invalid during the transition period which could endanger mail deliverability at your domain. A rollover scheme could but does not need to be 'active' all the time.</p><p>We recommend you to apply one of the following two schemes with double DANE TLSA records:</p><ol><li>Current + Next (\"3 1 1\" + \"3 1 1\"): Publish two \"DANE-EE(3) SPKI(1) SHA2-256(1)\" records, one for the current and one for the next TLS certificate of your mail server. </li><li>Current + Issuer CA (\"3 1 1\" + \"2 1 1\"): Publish a \"DANE-EE(3) SPKI(1) SHA2-256(1)\" record for the current TLS certificate of your mail server, and also a \"DANE-TA(2) SPKI(1) SHA2-256(1)\" record for the current root or intermediate certificate of the (not necessarily public) certificate authority. </li></ol><p>The test also accepts other combinations of DANE TLSA records i.e. \"3 x x\"  + \"3 x x\" or \"3 x x\" + \"2 x x\". However other types than the above will generally be more error prone and less interoperable. </p><p>Note that if a mail server simultaneously offers two certificates (one based on RSA and one based on ECDSA), a separate DANE TLSA rollover scheme is recommended for each certificate. The subtest does not check for this scenario. If only one DANE TLSA record is configured for each certificate, this subtest gives a false-positive result.</p><p><em>Requirement level: Optional</em>",
  "detail_mail_tls_dane_rollover_label": "DANE rollover scheme",
  "detail_mail_tls_dane_rollover_tech_table": "Mail server (MX)|DANE rollover scheme",
  "detail_mail_tls_dane_rollover_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_dane_rollover_tech_table_dane_rollover_scheme": "DANE rollover scheme",
  "detail_mail_tls_dane_rollover_verdict_bad": "At least one of your mail server domains does <em>not</em> have an active DANE scheme for a reliable rollover of certificate keys.",
  "detail_mail_tls_dane_rollover_verdict_good": "All your mail server domains have an active DANE scheme for a reliable rollover of certificate keys.",
  "detail_mail_tls_dane_valid_exp": "We check if the DANE fingerprints presented by your mail server domains are valid for your mail server certificates. </p><p>DANE allows you to publish information about your mail server certificates in a special DNS record, called TLSA record. Sending mail servers can check the authenticity of your certificates not only through the certificate authority but also through the TLSA records. A sending mail server can also use the TLSA record as a signal to only connect via STARTTLS (and not unencrypted). When the DANE fingerprint of a receiving mail server is checked by the sending mail server, an active attacker who is able to manipulate the mail traffic cannot strip STARTTLS encryption. ",
  "detail_mail_tls_dane_valid_label": "DANE validity",
  "detail_mail_tls_dane_valid_tech_table": "Mail server (MX)|DANE TLSA record valid",
  "detail_mail_tls_dane_valid_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_dane_valid_tech_table_dane_tlsa_record_valid": "DANE TLSA record valid",
  "detail_mail_tls_dane_valid_verdict_bad": "At least one of your mail servers does <em>not</em> have any valid DANE fingerprints. Either someone manipulated the response of your mail server, or your mail server has a serious DANE configuration error. The latter makes your domain unreachable for any sending mail server that checks DANE fingerprints. You should contact your mail provider as soon as possible.",
  "detail_mail_tls_dane_valid_verdict_good": "Each of your mail servers has at least one valid DANE fingerprint. This allows sending mail servers that support DANE verification to set up an authenticated encrypted transport connection with your receiving mail servers.",
  "detail_mail_tls_fs_params_exp": "We check if the public parameters used in Diffie-Hellman key exchange by your receiving mail servers (MX) are secure.</p><p><strong>ECDHE</strong>: The security of elliptic curve Diffie-Hellman (ECDHE) ephemeral key exchange depends on the used elliptic curve. We check if the bit-length of the used elliptic curves is a least 224 bits. Currently we are not able to check the elliptic curve name.</p><p><strong>DHE</strong>: The security of Diffie-Hellman Ephemeral (DHE) key exchange depends on the lengths of the public and secret keys used within the chosen finite field group. We test if your DHE public key material uses one of the predefined finite field groups that are specified in <a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>. Self-generated groups are 'Insufficient'.</p><p>The larger key sizes required for the use of DHE come with a performance penalty. Carefully evaluate and use ECDHE instead of DHE if you can.</p><p><strong>RSA as an alternative</strong>: Besides ECDHE and DHE, RSA can be used for key exchange. However, it is at risk of becoming insufficiently secure (current status 'phase out'). The RSA public parameters are tested in the subtest 'Public key of certificate'. Note that RSA is considered as 'good' for certificate verification.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B5-1 and table 9 for ECDHE, and guideline B6-1 and table 10 for DHE (in English).</p><hr /><p><strong>Elliptic curve for ECDHE</strong></p><ul><li>Good: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, and <code>x25519</code></li><li>Phase out: <code>secp224r1</code></li><li>Insufficient: Other curves</li></ul><p><strong>Finite field group for DHE</strong></p><ul><li><p>Sufficient:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/main/ffdhe4096.pem\">ffdhe4096</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3</code></li><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/main/ffdhe3072.pem\">ffdhe3072</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab</code>  </li><li>Note that we also test for ffdhe8192 and ffdhe6144. However their limited gain in security rarely outweighs the loss in performance.</li></ul></li><li><p>Phase out:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/main/ffdhe2048.pem\">ffdhe2048</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b</code></li></ul></li><li><p>Insufficient: Other groups</p></li></ul><hr /><p>Note: the above names are based on the <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml\">IANA naming conventions</a>. Sometimes alternative names are used to refer to the same curves, like <code>prime256v1</code> (ANSI) and <code>NIST P-256</code> for <code>secp256r1</code>.",
  "detail_mail_tls_fs_params_label": "Key exchange parameters",
  "detail_mail_tls_fs_params_tech_table": "Mail server (MX)|Affected parameters|Security level",
  "detail_mail_tls_fs_params_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_fs_params_tech_table_affected_parameters": "Affected parameters",
  "detail_mail_tls_fs_params_tech_table_security_level": "Security level",
  "detail_mail_tls_fs_params_verdict_bad": "At least one of your mail servers supports <em>insufficiently</em> secure parameters for Diffie-Hellman key exchange.",
  "detail_mail_tls_fs_params_verdict_good": "All your mail servers support secure parameters for Diffie-Hellman key exchange.",
  "detail_mail_tls_fs_params_verdict_na": "This subtest is not applicable as your mail servers do not support Diffie-Hellman key exchange. Note that RSA is an alternative for key exchange, but has the <em>phase out</em> status.",
  "detail_mail_tls_fs_params_verdict_phase_out": "At least one of your mail servers supports parameters for Diffie-Hellman key exchange that have a <em>phase out</em> status, because they are known to be fragile and are at risk of of becoming <em>insufficiently</em> secure.",
  "detail_mail_tls_kex_hash_func_exp": "<p>We check if your receiving mail servers (MX) support secure hash functions to create the digital signature during key exchange.</p><p>A receiving mail server uses a digital signature during the key exchange to prove ownership of the secret key corresponding to the certificate. The mail server creates this digital signature by signing the output of a hash function. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, table 5.</p><p><em>Requirement level: Recommended</em></p><hr /><p><strong>SHA2 support for signatures</strong></p><ul><li>Good: Yes (SHA-256, SHA-384 or SHA-512 supported)</li><li>Phase out: No (SHA-256, SHA-384 of SHA-512 <em>not</em> supported)</li></ul>",
  "detail_mail_tls_kex_hash_func_label": "Hash function for key exchange",
  "detail_mail_tls_kex_hash_func_tech_table": "Mail server (MX)|SHA2 support for signatures",
  "detail_mail_tls_kex_hash_func_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_kex_hash_func_tech_table_sha2_support_for_signatures": "SHA2 support for signatures",
  "detail_mail_tls_kex_hash_func_verdict_good": "All your mail servers support secure hash functions for key exchange.",
  "detail_mail_tls_kex_hash_func_verdict_other": "We were unable to determine the hash function used by at least one of your mail servers. This could be because the cipher combination used has no signature for certificate verification (e.g. it uses RSA key exchange or is anonymous i.e. <code>anon</code>).",
  "detail_mail_tls_kex_hash_func_verdict_phase_out": "At least one of your mail servers does <em>not</em> support a secure hash function for key exchange. You should <em>phase out</em> this setting deliberately, because it is at risk of becoming <em>insufficiently</em> secure in the future.",
  "detail_mail_tls_ocsp_stapling_exp": "OUTDATED TEXT; TEST NOT USED <br />We check if your receiving mail server supports the <a href=\"https://www.rfc-editor.org/rfc/rfc6961\">TLS Certificate Status extension</a> aka OCSP stapling. With OCSP stapling your mail server can provide OCSP responses itself which removes the need for the TLS client to verify the validity of the mail server certificate directly with the certificate supplier, and thus avoids exposing potentially privacy sensitive data about the client to the certificate supplier. It also does not require connectivity between client and certificate supplier and is faster. See <a href=\"https://www.ncsc.nl/english/current-topics/factsheets/it-security-guidelines-for-transport-layer-security-tls.html\">'IT Security Guidelines for Transport Layer Security (TLS)'</a>, guideline B9-1 (in English).</p><p>When connecting to your mail server we use the TLS Certificate Status extension to request OCSP data be included in the server response. If your mail server includes OCSP data in the response we then verify that the OCSP data is signed by a known certificate authority.",
  "detail_mail_tls_ocsp_stapling_label": "OUTDATED TEXT; TEST NOT USED <br />OCSP stapling",
  "detail_mail_tls_ocsp_stapling_tech_table": "OUTDATED TEXT; TEST NOT USED<br />Mail server (MX)|OCSP stapling",
  "detail_mail_tls_ocsp_stapling_tech_table_outdated_text_test_not_used_mail_server_mx": "OUTDATED TEXT; TEST NOT USED<br />Mail server (MX)",
  "detail_mail_tls_ocsp_stapling_tech_table_ocsp_stapling": "OCSP stapling",
  "detail_mail_tls_ocsp_stapling_verdict_bad": "OUTDATED TEXT; TEST NOT USED<br />At least one of your mail servers supports OCSP stapling but responds with invalid data",
  "detail_mail_tls_ocsp_stapling_verdict_good": "OUTDATED TEXT; TEST NOT USED<br />Your mail servers support OCSP stapling.",
  "detail_mail_tls_ocsp_stapling_verdict_ok": "OUTDATED TEXT; TEST NOT USED<br />At least one of your mail servers does not support OCSP stapling.",
  "detail_mail_tls_renegotiation_client_exp": "<p>We check if a sending mail server can initiate a renegotiation with your receiving mail servers (MX). </p><p>Allowing sending mail servers to initiate renegotiation is generally not necessary and opens a receiving mail server to DoS attacks inside a TLS connection. An attacker can perform similar DoS-attacks without client-initiated renegotiation by opening many parallel TLS connections, but these are easier to detect and defend against using standard mitigations. Note that client-initiated renegotiation impacts availability and not confidentiality. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B8-1 and table 13 (in English).</p><p><em>Requirement level: Optional</em></p><hr /><p><strong>Client-initiated renegotiation</strong></p><ul><li>Good: Off (or N/A for TLS 1.3)</li><li>Sufficient: On</li></ul>",
  "detail_mail_tls_renegotiation_client_label": "Client-initiated renegotiation",
  "detail_mail_tls_renegotiation_client_tech_table": "Mail server (MX)|Client-initiated renegotiation",
  "detail_mail_tls_renegotiation_client_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_renegotiation_client_tech_table_client_initiated_renegotiation": "Client-initiated renegotiation",
  "detail_mail_tls_renegotiation_client_verdict_bad": "At least one of your mail servers allows for client-initiated renegotiation, which could have negative impact on the availability of your mail server.",
  "detail_mail_tls_renegotiation_client_verdict_good": "All your mail servers do not allow for client-initiated renegotiation.",
  "detail_mail_tls_renegotiation_secure_exp": "<p>We check if your mail servers (MX) support secure renegotiation. </p><p>Older versions of TLS (prior to TLS 1.3) allow forcing a new handshake. This so-called renegotiation was insecure in its original design. The standard was repaired and a safer renegotiation mechanism was added. The old version is since called insecure renegotiation and should be disabled.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B8-1 and table 12 (in English).</p><hr /><p><strong>Insecure renegotiation</strong></p><ul><li>Good: Off (or N/A for TLS 1.3)</li><li>Insufficient: On</li></ul>",
  "detail_mail_tls_renegotiation_secure_label": "Secure renegotiation",
  "detail_mail_tls_renegotiation_secure_tech_table": "Mail server (MX)|Secure renegotiation",
  "detail_mail_tls_renegotiation_secure_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_renegotiation_secure_tech_table_secure_renegotiation": "Secure renegotiation",
  "detail_mail_tls_renegotiation_secure_verdict_bad": "At least one of your mail servers supports insecure renegotiation, which is obviously <em>not</em> secure.",
  "detail_mail_tls_renegotiation_secure_verdict_good": "All your mail servers support secure renegotiation.",
  "detail_mail_tls_starttls_exists_exp": "We check if your receiving mail servers (MX) support STARTTLS. If so, we also check in the subtests of this test category whether STARTTLS is configured sufficiently secure. </p><p>Because of performance reasons at most ten mail servers over either IPv6 or IPv4 are tested for STARTTLS and DANE.</p><p>Note that the email test does not fall back to A/AAAA records for mail servers in case of absence of an MX record.</p><p><em>Non-receiving domain</em>:</p><ol><li>Null MX: In case you do not want to receive mail on your domain that has A/AAAA records, we advise you to use \"Null MX\" (<a href=\"https://www.rfc-editor.org/rfc/rfc7505\">RFC 7505</a>). Note that a \"Null MX record\" should not be combined with a normal MX record that is pointing to a mail host.</li><li><p>No MX: In case your domain does not have A/AAAA records and you do not want to receive mail on it, we advise you to configure no MX record at all (i.e. even <em>not</em> an \"Null MX\" record).</p></li><li><p>If we detect any of the above two cases, the subtests in the STARTTLS and DANE category are not applicable. This also goes for the mail server specific subtests in the categories for IPv6 and DNSSEC. Other subtests of the email test (e.g. for DMARC) are still applicable. </p></li><li>Note that having a \"Null MX\" record or no MX record could also impact sending mail, because receiving servers may reject email that has an invalid return address.</li></ol><p>For a \"good practice on domains without mail\" see the <a href=\"#control-panel-9\">explanation of the \"DMARC policy\" subtest</a>.",
  "detail_mail_tls_starttls_exists_label": "STARTTLS available",
  "detail_mail_tls_starttls_exists_tech_table": "Mail server (MX)|STARTTLS",
  "detail_mail_tls_starttls_exists_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_starttls_exists_tech_table_starttls": "STARTTLS",
  "detail_mail_tls_starttls_exists_verdict_bad": "At least one of your mail servers does <em>not</em> offer STARTTLS.",
  "detail_mail_tls_starttls_exists_verdict_good": "All your mail servers offer STARTTLS.",
  "detail_mail_tls_starttls_exists_verdict_invalid_null_mx": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, either your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary. Or on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting.",
  "detail_mail_tls_starttls_exists_verdict_no_null_mx": "No receiving mail servers (MX) are set on your domain that has A/AAAA records and has an SPF record with only the term -all. We recommend you to set a \"Null MX\" record to explicitly indicate that your domain does not accept email. Because of your configuration, the subtests in the STARTTLS and DANE category and the mail server specific subtests in the IPv6 and DNSSEC categories are not applicable.",
  "detail_mail_tls_starttls_exists_verdict_null_mx": "Your domain name that has A/AAAA records clearly indicates with a \"Null MX\" record that it does not accept e-mail. This is fine if you do not want to receive email. Do not use a \"Null MX\" record and set an MX if you do want to send email from this domain name, as receiving servers may reject email that has an invalid return address.",
  "detail_mail_tls_starttls_exists_verdict_null_mx_with_other_mx": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting.",
  "detail_mail_tls_starttls_exists_verdict_null_mx_without_a_aaaa": "Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary.",
  "detail_mail_tls_starttls_exists_verdict_other": "At least one of your mail servers is unreachable.",
  "detail_mail_tls_starttls_exists_verdict_other_2": "The SPF record on your domain indicates that your domain may be used for sending mail. However, your domain does not have a receiving mail server (MX), which could hinder deliverability of your sent mails because not having an MX may be seen by receivers as an indicator for spam. Therefore if you really want to send mail from this domain, configure an MX. However, if you do not want to send mail from this domain, configure an SPF record with the <code>-all</code> term only and besides a \"Null MX\" record if your domain has A/AAAA records. Because of your configuration, the subtests in the STARTTLS and DANE category and the mail server specific subtests in the IPv6 and DNSSEC categories are not applicable.",
  "detail_mail_tls_version_exp": "<p>We check if your mail servers (MX) support secure TLS versions only. </p><p>A mail server may support more than one TLS version. </p><p>Note that quite some mail servers only support older TLS versions. If the sending and receiving mail server both do not support the same TLS version, they will usually fall back to unencrypted mail transport. Because of that it could be advisable to keep supporting TLS versions with a 'phase out' status for a while. Make an informed decision based on log data on when to disable these 'phase out' TLS versions.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B1-1 and table 1 (in English).</p><hr /><p><strong>Version</strong></p><ul><li>Good: TLS 1.3 </li><li>Sufficient: TLS 1.2</li><li>Phase out: TLS 1.1 and 1.0</li><li>Insufficient: SSL 3.0, 2.0 and 1.0</li></ul>",
  "detail_mail_tls_version_label": "TLS version",
  "detail_mail_tls_version_tech_table": "Mail server (MX)|TLS versions|Status",
  "detail_mail_tls_version_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_version_tech_table_tls_versions": "TLS versions",
  "detail_mail_tls_version_tech_table_status": "Status",
  "detail_mail_tls_version_verdict_bad": "At least one of your mail servers supports one or more <em>insufficiently</em> secure TLS versions.",
  "detail_mail_tls_version_verdict_good": "All your mail servers support secure TLS versions only.",
  "detail_mail_tls_version_verdict_phase_out": "At least one of your mail servers supports one or more TLS versions that should be <em>phased out</em> deliberately, because they are known to be fragile and at risk of becoming <em>insufficiently</em> secure.",
  "detail_mail_tls_zero_rtt_exp": "<p>We check if your mail servers (MX) support Zero Round Trip Time Resumption (0-RTT).</p><p>0-RTT is an option in TLS 1.3 that transports application data during the first handshake message. 0-RTT does not provide protection against replay attacks at the TLS layer and therefore should be disabled. Although the risk can be mitigated by not allowing 0-RTT fornon-idempotent requests, such a configuration is often not trivial, reliant on application logic and thus error prone.</p><p>If your mail servers do not support TLS 1.3, the test is not applicable.For mail servers that support TLS 1.3, the STARTTLS command is issued and a TLSsession is initiated. The amount of<a href=\"https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html\">early data</a>support <a href=\"https://www.rfc-editor.org/rfc/rfc8446#section-4.2.10\">indicated</a> by themail server is checked. When more than zero, a second connection is made re-usingthe TLS session details of the first connection but sending theEHLO command  <em>before</em> the TLS handshake but <em>after</em> the STARTTLS command(i.e. no round trips (0-RTT) needed before application data to the server).If the TLS handshake is completed and the mail server responds,then the mail server is considered to support 0-RTT.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B9-1 and table 14 (in English).</p><hr /><p><strong>0-RTT</strong></p><ul><li>Good: Off (or N/A prior to TLS 1.3)</li><li>Insufficient: On</li></ul>",
  "detail_mail_tls_zero_rtt_label": "0-RTT",
  "detail_mail_tls_zero_rtt_tech_table": "Mail server (MX)|0-RTT",
  "detail_mail_tls_zero_rtt_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_zero_rtt_tech_table_0_rtt": "0-RTT",
  "detail_mail_tls_zero_rtt_verdict_bad": "At least one of your mail servers supports 0-RTT, which is <em>not</em> secure.",
  "detail_mail_tls_zero_rtt_verdict_good": "None of your mail servers support 0-RTT.",
  "detail_mail_tls_zero_rtt_verdict_na": "This subtest is not applicable as your mail servers do not support TLS 1.3.",
  "detail_tech_data_bogus": "bogus",
  "detail_tech_data_good": "good",
  "detail_tech_data_http_csp_has_bare_https": "Recommendation: 'https:' scheme without a specific main domain should not be used (#9).",
  "detail_tech_data_http_csp_has_data": "Recommendation: 'data:' scheme should not be used where that is not permitted (#7).",
  "detail_tech_data_http_csp_has_host_without_scheme": "Recommendation: A domain without a scheme should not be used (#8).",
  "detail_tech_data_http_csp_has_http": "Recommendation: 'http:' scheme should not be used (#8).",
  "detail_tech_data_http_csp_has_invalid_host": "Recommendation: A wildcard (i.e. '*') or '127.0.0.1' should not be used (#9 and #10).",
  "detail_tech_data_http_csp_has_unsafe_eval": "Recommendation: 'unsafe-eval' should not be used (#6).",
  "detail_tech_data_http_csp_has_unsafe_hashes": "Recommendation: 'unsafe-hashes' should not be used (#6).",
  "detail_tech_data_http_csp_has_unsafe_inline": "Recommendation: 'unsafe-inline' should not be used (#6).",
  "detail_tech_data_http_csp_missing_invalid_base_uri": "Recommendation: 'base-uri' with sufficiently secure value should be defined (#2).",
  "detail_tech_data_http_csp_missing_invalid_default_src": "Recommendation: 'default-src' with sufficiently secure value should be defined (#1).",
  "detail_tech_data_http_csp_missing_invalid_form_action": "Recommendation: 'form-action' with sufficiently secure value should be defined (#5).",
  "detail_tech_data_http_csp_missing_invalid_frame_ancestors": "Recommendation: 'frame-ancestors' with sufficiently secure value should be defined (#4).",
  "detail_tech_data_http_csp_missing_invalid_frame_src": "Recommendation: 'frame-src' (or child-src' or 'default-src' as fallback) with sufficiently secure value should be defined (#3).",
  "detail_tech_data_http_csp_no_policy_found": "No CSP found.",
  "detail_tech_data_http_csp_policy_found": "Retrieved CSP value: {policy}",
  "detail_tech_data_http_referrer_policy_bad_invalid": "Bad: policy value is not valid.",
  "detail_tech_data_http_referrer_policy_bad_no_referrer_when_downgrade": "Bad: 'no-referrer-when-downgrade' must not be used.",
  "detail_tech_data_http_referrer_policy_bad_origin": "Bad: 'origin' must not be used.",
  "detail_tech_data_http_referrer_policy_bad_origin_when_cross_origin": "Bad: 'origin-when-cross-origin' must not be used.",
  "detail_tech_data_http_referrer_policy_bad_unsafe_url": "Bad: 'unsafe-url' must not be used.",
  "detail_tech_data_http_referrer_policy_no_policy": "No Referrer-Policy found.",
  "detail_tech_data_http_referrer_policy_recommendation_strict_origin": "Recommendation: 'strict-origin' should not be used.",
  "detail_tech_data_http_referrer_policy_recommendation_strict_origin_when_cross_origin": "Recommendation: 'strict-origin-when-cross-origin' should not be used.",
  "detail_tech_data_http_referrer_policy_values": "Found policy: {values}",
  "detail_tech_data_http_securitytxt_bom_in_file": "Error: The Byte Order Mark (\"BOM\") signature must not appear at the beginning of the content that must be encoded using UTF-8 in Net-Unicode form.",
  "detail_tech_data_http_securitytxt_data_after_sig": "Error: Signed security.txt must not contain data after the signature (line {line_no}).",
  "detail_tech_data_http_securitytxt_empty_key": "Error: Field name must not be empty (line {line_no}).",
  "detail_tech_data_http_securitytxt_empty_value": "Error: Field value must not be empty (line {line_no}).",
  "detail_tech_data_http_securitytxt_expired": "Error: Date and time in 'Expires' field must not be in the past (line {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_cert": "Error: security.txt must be served with a valid TLS certificate.</p><p>[Note: this content label is currently not used. See #1046.]",
  "detail_tech_data_http_securitytxt_invalid_charset": "Error: Charset parameter in Content-Type header must be 'utf-8' if present.",
  "detail_tech_data_http_securitytxt_invalid_expiry": "Error: Date and time in 'Expires' field must be formatted according to ISO 8601 (line {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_lang": "Error: Value in 'Preferred-Languages' field must match one or more language tags as defined in <a href=\"https://www.rfc-editor.org/rfc/rfc5646\">RFC 5646</a>, separated by commas (line {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_line": "Error: Line must contain a field name and value, unless the line is blank or contains a comment (line {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_media": "Error: Media type in Content-Type header must be 'text/plain'.",
  "detail_tech_data_http_securitytxt_invalid_uri_scheme": "Error: The security.txt file access must use the HTTPS scheme.</p><p>[Note: this content label is currently not used. See #1046.]",
  "detail_tech_data_http_securitytxt_location": "Error: security.txt was located on the top-level path (legacy place), but must be placed under the '/.well-known/' path.",
  "detail_tech_data_http_securitytxt_long_expiry": "Recommendation: Date and time in 'Expires' field should be less than a year into the future (line {line_no}).",
  "detail_tech_data_http_securitytxt_multi_expire": "Error: 'Expires' field must not appear more than once.",
  "detail_tech_data_http_securitytxt_multi_lang": "Error: 'Preferred-Languages' field must not appear more than once.",
  "detail_tech_data_http_securitytxt_multiple_csaf_fields": "Recommendation: Multiple 'CSAF' fields should be brought back to one 'CSAF' field.",
  "detail_tech_data_http_securitytxt_no_canonical": "Recommendation: 'Canonical' field should be present in a signed file.",
  "detail_tech_data_http_securitytxt_no_canonical_match": "Error: The web URI of security.txt (i.e. when redirecting at least the last URI of the redirect chain) must be listed in a 'Canonical' field if present.",
  "detail_tech_data_http_securitytxt_no_contact": "Error: 'Contact' field must appear at least once.",
  "detail_tech_data_http_securitytxt_no_content_type": "Error: HTTP Content-Type header must be sent.",
  "detail_tech_data_http_securitytxt_no_csaf_file": "Error: Every optional 'CSAF' field must point to a file named 'provider-metadata.json'.",
  "detail_tech_data_http_securitytxt_no_encryption": "Recommendation: 'Encryption' field should be present when 'Contact' field contains an email address.",
  "detail_tech_data_http_securitytxt_no_expire": "Error: 'Expires' field must be present.",
  "detail_tech_data_http_securitytxt_no_https": "Error: Web URI must begin with 'https://' (line {line_no}).",
  "detail_tech_data_http_securitytxt_no_line_separators": "Error: Every line must end with either a carriage return and line feed characters or just a line feed character.",
  "detail_tech_data_http_securitytxt_no_security_txt_404": "Error: security.txt could not be located.",
  "detail_tech_data_http_securitytxt_no_security_txt_other": "Error: security.txt could not be located (unexpected HTTP response code {status_code}).",
  "detail_tech_data_http_securitytxt_no_space": "Error: Field separator (colon) must be followed by a space (line {line_no}).",
  "detail_tech_data_http_securitytxt_no_uri": "Error: Field value must be a URI (e.g. beginning with 'mailto:') (line {line_no}).",
  "detail_tech_data_http_securitytxt_not_signed": "Recommendation: security.txt should be digitally signed.",
  "detail_tech_data_http_securitytxt_pgp_data_error": "Error: Signed security.txt must contain a correct ASCII-armored PGP block.",
  "detail_tech_data_http_securitytxt_pgp_error": "Error: Decoding or parsing of the signed security.txt must succeed.",
  "detail_tech_data_http_securitytxt_prec_ws": "Error: There must be no whitespace before the field separator (colon) (line {line_no}).",
  "detail_tech_data_http_securitytxt_requested_from": "security.txt requested from {hostname}.",
  "detail_tech_data_http_securitytxt_retrieved_from": "security.txt retrieved from {hostname}.",
  "detail_tech_data_http_securitytxt_signed_format_issue": "Error: Signed security.txt must start with the header '-----BEGIN PGP SIGNED MESSAGE-----'.",
  "detail_tech_data_http_securitytxt_unknown_field": "Notification: security.txt contains an unknown field. Either this is a custom field which may not be widely supported, or there is a typo in a standardised field name (line {line_no}).",
  "detail_tech_data_http_securitytxt_utf8": "Error: Content must encoded using UTF-8 in Net-Unicode form.",
  "detail_tech_data_insecure": "insecure",
  "detail_tech_data_insufficient": "insufficient",
  "detail_tech_data_no": "no",
  "detail_tech_data_not_applicable": "not applicable",
  "detail_tech_data_not_reachable": "not reachable",
  "detail_tech_data_not_testable": "not testable",
  "detail_tech_data_not_tested": "not tested",
  "detail_tech_data_phase_out": "phase out",
  "detail_tech_data_secure": "secure",
  "detail_tech_data_sufficient": "sufficient",
  "detail_tech_data_yes": "yes",
  "detail_verdict_could_not_test": "Test error. Please try again later.",
  "detail_verdict_not_tested": "This subtest did not run, because either a parent test that this subtest depends on gave a negative result, or not enough information was available to run this subtest.",
  "detail_web_appsecpriv_http_csp_exp": "We check if your web server provides an HTTP header for <code>Content-Security-Policy</code> (CSP). Furthermore we check for several secure CSP settings, although we do <em>not</em> exhaustively test the effectiveness of your CSP configuration. </p><p>CSP guards a website against content injection attacks including cross-site scripting (XSS). By using CSP to configure an 'allowlist' with <em>sources of approved content</em>, you prevent browsers from loading malicious content of attackers.</p><p>We test for the rules below that are based on good practices for a secure CSP configuration.</p><ol><li>The <code>default-src</code> directive should be defined and its value should be be either <code>'none'</code>,  or <code>'self'</code> and/or one or more URLs of the domain itself (including its subdomain or superdomain). This is to have a restrictive default fallback policy for source types that are used in your website for which no specific policy is defined. Next to the mentioned values <code>'report-sample'</code> could be there in case you want code samples to be sent together with the 'violation reports'.</li><li>The <code>base-uri</code> directive should be defined and its value should be either <code>'none'</code>,  or <code>'self'</code> and/or one or more URLs of the domain itself (including its subdomain or superdomain). This restricts the <code>baseURI</code> in order to block the injection of a manipulated <code>&lt;base&gt;</code> element. This limits the ability of attackers to manipulate the locations of sources (e.g. scripts) that are loaded from relative URLs.</li><li>The <code>frame-src</code> directive should be used (either by definition or by relying on the fallback to sequentially <code>child-src</code> and <code>default-src</code>) and its value should be either <code>'none'</code>, or <code>'self'</code>and/or one or more specific URLs. This prevents content from unauthorized locations to be framed or embedded in your website (with HTML elements such as <code>&lt;frame&gt;</code> and <code>&lt;iframe&gt;</code>).</li><li>The <code>frame-ancestors</code> directive should be defined and its value should be either <code>'none'</code>, or <code>'self'</code> and/or one or more specific URLs. This prevents  unauthorized websites from framing or embedding your website (with HTML elements <code>&lt;frame&gt;</code>, <code>&lt;iframe&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;embed&gt;</code>, or <code>&lt;applet&gt;</code>).</li><li>The <code>form-action</code> directive should be defined and its value should be either <code>'none'</code>, or <code>'self'</code> and/or one or more specific URLs. This restricts the URLs which can be used as the target of form submissions.</li><li>The source values <code>unsafe-eval</code>, <code>unsafe-inline</code> and <code>unsafe-hashes</code> should <em>not</em> be used, because these enable XSS attacks. </li><li>The <code>data:</code> scheme should <em>not</em> be used in the <code>default-src</code>, <code>script-src</code> and <code>object-src</code> directives, because this enables XSS attacks.</li><li>A domain with the <code>http://</code> scheme or a domain without a scheme should <em>not</em> be used, because this enables sources to be downloaded over an insecure connection. Use the <code>https://</code> scheme instead.</li><li>A wildcard (i.e. <code>*</code>) for the full host part of a URL should <em>not</em> be used in any directive, because this allows for any external source. Furthermore do <em>not</em> use just <code>https:</code> as this is equivalent to <code>https://*</code>. Always specify the main domain as well (e.g. <code>https://scripts.example.nl</code> or <code>https://*.example.nl</code>). </li><li><code>127.0.0.1</code> should <em>not</em> be used in any directive, because it enables content injection attacks in a compromised system.</li></ol><p>Additional recommendations:</p><ol><li><p>Only use domains in CSP directives as specific as possible, which is tested automatically to some extent in this subtest for CSP.</p><ul><li>Do <em>not</em> allow all domains under a TLD (<code>*.nl</code>) or SLD (<code>*.gov.uk</code>), although we currently do <em>not</em> test for this. </li><li>Do <em>not</em> allow a different main domain under a SLD in <code>default-src</code> (for example <code>example2.gov.nl</code> for <code>example1.gov.nl</code>), although we currently do <em>not</em> test for this either.</li></ul></li><li><p>Ideally do <em>not</em> use inline scripts or styles. For cases where you cannot avoid using inline scripts or styles, do <em>not</em> use <code>unsafe-inline</code> (as mentioned above) but preferably use CSP hashes or otherwise CSP nonces.</p></li><li>Use the HTTP header as a mechanism for serving your CSP policy. Do <em>not</em> use the HTML <code>&lt;meta&gt;</code> element to serve your CSP policy. The latter is less secure and does not support all CSP directives (e.g. the required <code>frame-ancestors</code>). Therefore we do <em>not</em> check for CSP that is offered via the HTML <code>&lt;meta&gt;</code> element.</li><li>Use the HTTP header for <code>Content-Security-Policy-Report-Only</code> to experiment with your CSP configuration by monitoring its effect without enforcing it.</li><li>Note that an empty source list (i.e. a CSP directive without a value) is equivalent to a source list containing <code>none</code>. Besides, note that if other sources are listed in a source list next to <code>none</code>, then the attribute <code>none</code> is ignored.</li></ol><p>Note on IPv6/IPv4: for performance reasons all tests in the category 'Security options' only run for the first available IPv6 and IPv4 address.</p><p>Also see <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Web application guidelines from NCSC-NL'</a>, guideline U/PW.03 (in Dutch).</p><p><em>Requirement level: Recommended</em>",
  "detail_web_appsecpriv_http_csp_label": "Content-Security-Policy",
  "detail_web_appsecpriv_http_csp_tech_table": "Web server IP address|Findings",
  "detail_web_appsecpriv_http_csp_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_appsecpriv_http_csp_tech_table_findings": "Findings",
  "detail_web_appsecpriv_http_csp_verdict_bad": "Your web server does <em>not</em> offer Content-Security-Policy (CSP), or does offer CSP with certain <em>insecure</em> settings. ",
  "detail_web_appsecpriv_http_csp_verdict_good": "Your web server offers Content-Security-Policy (CSP) and does not use certain insecure CSP settings.",
  "detail_web_appsecpriv_http_referrer_policy_exp": "We check if your web server provides an HTTP header for <code>Referrer-Policy</code> with a sufficiently secure and privacy-protecting policy value. With this policy your web server instructs browsers if, what and when referrer data should be sent to the website the user is navigating to from your website. This referrer data is sent in the <code>Referer</code> header by the browser to the website the user is navigating to. This navigation does not necessarily have to be cross-domain.</p><p>The data in the <code>Referer</code> header is usually used for analytics and logging. However there can be privacy and security risks. The data could be used e.g. for user tracking and the data could leak to third parties who eavesdrop the connection. The HTTP header for <code>Referrer-Policy</code> allows you to mitigate these risks by controlling and even minimizing the sending of referrer data.</p><p>We suggest to make an informed decision, with privacy and security risks in mind, on using one of the policy values from the first two categories below.</p><p><strong>1. Good</strong> </p><ul><li><code>no-referrer</code></li><li><code>same-origin</code></li></ul><p>With these policy values no sensitive referrer data is sent to third parties.</p><p><strong>2. Warning</strong> </p><ul><li><code>strict-origin</code></li><li><code>strict-origin-when-cross-origin</code> (browser's default value; see also under additional note 2)</li></ul><p>With these policy values basic referrer data, which may be sensitive, is sent to third parties only via secure connections (HTTPS). Therefore these values should only to be used where necessary and permitted by law.</p><p><strong>3. Bad</strong></p><ul><li><code>no-referrer-when-downgrade</code></li><li><code>origin-when-cross-origin</code></li><li><code>origin</code></li><li><code>unsafe-url</code></li></ul><p>With these policy values any or basic referrer data, which may be sensitive, is sent to third parties possibly via insecure connections (HTTP). Therefore these values must not be used.</p><p><strong>Additional notes:</strong></p><ol><li>To prevent leaking of sensitive data through URLs, please make sure URLs of your website do not contain personal or otherwise sensitive data (like personal names or passwords).</li><li><code>strict-origin-when-cross-origin</code> is the default policy value when no <code>Referrer-Policy</code> is published as prescribed in the current \"Editor's Draft\" of the <code>Referrer-Policy</code> standard and this default is used by all latest major browsers. Note that some users may still have a different default value configured in their browser.</li><li>Use the HTTP <code>Referrer-Policy</code> header as a mechanism for serving your referrer policy. We do <em>not</em> recommend to use the HTML <code>&lt;meta&gt;</code> element or the HTML <code>referrerpolicy</code> content attribute to publish your referrer policy, especially because the sections that describe these methods in the standard are marked as \"not normative\". Therefore we do not check for a referrer policy that is offered via the latter two methods.</li><li>Note that a web server may send multiple <code>Referrer-Policy</code> headers, and a <code>Referrer-Policy</code> header may contain multiple values. Unknown values will be ignored by the browser and only the last known value will be used. This makes it possible to use future standardised policy values that are not supported by all browsers yet. However, currently all latest major browsers support the above mentioned policy values under \"Good\" and \"Warning\".</li></ol><p>Note on IPv6/IPv4: for performance reasons all tests in the category 'Security options' only run for the first available IPv6 and IPv4 address.</p><p><em>Requirement level: Recommended</em>",
  "detail_web_appsecpriv_http_referrer_policy_label": "Referrer-Policy",
  "detail_web_appsecpriv_http_referrer_policy_tech_table": "Web server IP address|Findings",
  "detail_web_appsecpriv_http_referrer_policy_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_appsecpriv_http_referrer_policy_tech_table_findings": "Findings",
  "detail_web_appsecpriv_http_referrer_policy_verdict_bad": "Your web server offers a Referrer-Policy with a policy value that is <em>not</em> sufficiently secure and privacy-protecting.",
  "detail_web_appsecpriv_http_referrer_policy_verdict_good": "Your web server offers a Referrer-Policy with a policy value that is sufficiently secure and privacy-protecting.",
  "detail_web_appsecpriv_http_referrer_policy_verdict_recommendations": "Your web server either does <em>not</em> offer a Referrer-Policy and thus relies on the default browser policy, or your web server offers a Referrer-Policy with a policy value that should be used with caution because of its potential impact on security and privacy.",
  "detail_web_appsecpriv_http_securitytxt_exp": "We check if your web server provides a <code>security.txt</code> file in the right location, whether it could be retrieved, and whether its content is syntactically valid. </p><p><code>security.txt</code> is a text file with contact information that you place on your web server. Security researchers can use this information to directly contact the right department or person within your organization about vulnerabilities that they found in your website or IT systems. This can speed up the fixing of found vulnerabilities, reducing the opportunity for malicious parties to exploit. </p><p>The syntax of the file is intended to be machine- and human-readable. The contact information can be an email address, a phone number, and/or a web page (e.g. a web form). Note that published contact information is public and can also be abused, for example, to send spam to a published e-mail address.</p><p>Besides contact information, the <code>security.txt</code> file must also contain an expiry date. To avoid staleness it is recommended that the date be less than a year into the future. It is optional to also include other relevant information for security researchers, like a link to your policy on dealing with security vulnerabilities reports (usually called a Coordinated Vulnerability Disclosure policy).</p><p>It is recommended to PGP sign the <code>security.txt</code> file while including the web URI on which the file is located in a <code>Canonical</code> field. We check if the <code>security.txt</code> file is signed. However, we do <em>not</em> validate the signature because, unfortunately, there is no standardised place to retrieve a public PGP key (which is required for signature validation).</p><p>If one or more <code>Canonical</code> fields are present, the web URI of the <code>security.txt</code> file must be listed in a <code>Canonical</code> field. When redirecting to a <code>security.txt</code> file at least the last URI of the redirect chain must be listed.</p><p>The file must be published under the <code>/.well-known/</code> path. Note that placing it under the top-level path has been deprecated. Every web (sub) domain should have its own <code>security.txt</code> file. An example file can be found on <a href=\"https://example.nl/.well-known/security.txt\"><code>https://example.nl/.well-known/security.txt</code></a>.</p><p>Redirecting to a <code>security.txt</code> on another domain name is allowed. Especially in the case of a large domain name portfolio, it is advisable from a maintenance perspective to redirect the domain names to a central <code>security.txt</code>.</p><p>Note that <code>security.txt</code> files are normally just a few kilobytes in size. We therefore read and evaluate at maximum the first 100 kB of a found <code>security.txt</code> file. </p><p>Note on IPv6/IPv4: for performance reasons all tests in the category 'Security options' only run for the first available IPv6 and IPv4 address.</p><p><em>Requirement level: Recommended</em>",
  "detail_web_appsecpriv_http_securitytxt_label": "security.txt",
  "detail_web_appsecpriv_http_securitytxt_tech_table": "Web server IP address|Findings",
  "detail_web_appsecpriv_http_securitytxt_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_appsecpriv_http_securitytxt_tech_table_findings": "Findings",
  "detail_web_appsecpriv_http_securitytxt_verdict_bad": "Your web server does <em>not</em> offer a security.txt file in the right location, it could <em>not</em> be retrieved, or its content is <em>not</em> syntactically valid.",
  "detail_web_appsecpriv_http_securitytxt_verdict_good": "Your web server offers a security.txt file in the right location and its content is syntactically valid.",
  "detail_web_appsecpriv_http_securitytxt_verdict_recommendations": "Your web server offers a security.txt file in the right location and its content is syntactically valid. However, there are one or more recommendations for improvement.",
  "detail_web_appsecpriv_http_x_content_type_exp": "We check if your web server provides an HTTP header for <code>X-Content-Type-Options</code>. With this HTTP header you let web browsers know that they must not do 'MIME type sniffing' and always follow the <code>Content-Type</code> as declared by your web server. The only valid value for this HTTP header is <code>nosniff</code>. When enabled, a browser will block requests for <code>style</code> and <code>script</code> when they do not have a corresponding <code>Content-Type</code> (i.e. <code>text/css</code> or a 'JavaScript MIME type' like <code>application/javascript</code>).</p><p>'MIME type sniffing' is a technique where the browser scans the content of a file to detect the format of a file regardless of the declared <code>Content-Type</code> by the web server. This technique is vulnerable to the so-called 'MIME confusion attack' in which the attacker manipulates the content of a file in a way that it is treated by the browser as a different <code>Content-Type</code>, like an executable.</p><p>Note on IPv6/IPv4: for performance reasons all tests in the category 'Security options' only run for the first available IPv6 and IPv4 address.</p><p><em>Requirement level: Recommended</em> ",
  "detail_web_appsecpriv_http_x_content_type_label": "X-Content-Type-Options",
  "detail_web_appsecpriv_http_x_content_type_tech_table": "Web server IP address|X-Content-Type-Options value",
  "detail_web_appsecpriv_http_x_content_type_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_appsecpriv_http_x_content_type_tech_table_x_content_type_options_value": "X-Content-Type-Options value",
  "detail_web_appsecpriv_http_x_content_type_verdict_bad": "Your web server does <em>not</em> offer X-Content-Type-Options.",
  "detail_web_appsecpriv_http_x_content_type_verdict_good": "Your web server offers X-Content-Type-Options.",
  "detail_web_appsecpriv_http_x_frame_exp": "We check if your web server provides an HTTP header for <code>X-Frame-Options</code> that has a sufficiently secure policy. With this HTTP header you let web browsers know whether you want to allow your website to be framed or not. Prevention of framing defends visitors against attacks like clickjacking. We consider the following values to be sufficiently secure: </p><ul><li><code>DENY</code> (framing not allowed); or</li><li><code>SAMEORIGIN</code> (only framing by your own website allowed).</li></ul><p>Although the value <code>ALLOW-FROM</code> (only allow specific websites to frame your website) is part of the <code>X-Frame-Options</code> specification (<a href=\"https://www.rfc-editor.org/rfc/rfc7034\">RFC 7034</a>), it is <em>not</em> supported by most modern web browsers. Therefore we do <em>not</em> consider this value as sufficiently secure.</p><p>Note that <code>Content-Security-Policy</code> (<a href=\"#control-panel-29\">CSP</a>) offers similar protection through <code>frame-ancestors</code> and besides much more for visitors with modern web browsers. However <code>X-Frame-Options</code> could still protect visitors of older web browsers that do not support CSP. Furthermore <code>X-Frame-Options</code> could offer valuable protection for all visitors when CSP is not (properly) configured for the website concerned.</p><p>Also see <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Web application guidelines from NCSC-NL'</a>, guideline U/PW.03 (in Dutch).</p><p>Note on IPv6/IPv4: for performance reasons all tests in the category 'Security options' only run for the first available IPv6 and IPv4 address.</p><p><em>Requirement level: Optional</em> ",
  "detail_web_appsecpriv_http_x_frame_label": "X-Frame-Options",
  "detail_web_appsecpriv_http_x_frame_tech_table": "Web server IP address|X-Frame-Options value",
  "detail_web_appsecpriv_http_x_frame_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_appsecpriv_http_x_frame_tech_table_x_frame_options_value": "X-Frame-Options value",
  "detail_web_appsecpriv_http_x_frame_verdict_bad": "Your web server does <em>not</em> offer securely configured X-Frame-Options.",
  "detail_web_appsecpriv_http_x_frame_verdict_good": "Your web server offers securely configured X-Frame-Options.",
  "detail_web_appsecpriv_http_x_xss_exp": "OUTDATED TEXT; TEST NOT USED</p><p>We check if your web server provides an HTTP header for <code>X-XSS-Protection</code> that has a sufficiently secure value (i.e. <code>1</code> or <code>1; mode=block</code>). This HTTP header can be used to activate the protection filter of browsers against reflective cross-site scripting (XSS) attacks. Valid values for the <code>X-XSS-Protection</code> header are:</p><ul><li><code>0</code> disables the XSS filter. This value should NOT be used.</li><li><code>1</code> enables the XSS filter. If a cross-site scripting attack is detected, the browser will sanitize the script and remove the unsafe parts. This value is usually the default in browsers when a website does not offer an <code>X-XSS-Protection</code> header.</li><li><code>1; mode=block</code> enables the XSS filter. If a cross-site scripting attack is detected, the browser will block the response and prevent rendering the page. This is the recommended value.</li></ul><p><code>Content-Security-Policy</code> (CSP) offers similar protection and much more for visitors with modern web browsers. However <code>X-XSS-Protection</code> could still protect visitors of older web browsers that do not support CSP. Furthermore <code>X-XSS-Protection</code> could offer valuable protection for all visitors, when CSP is not (properly) configured for the website concerned.</p><p><em>Requirement level: Recommended</em>",
  "detail_web_appsecpriv_http_x_xss_label": "OUTDATED TEXT; TEST NOT USED</p><p>X-XSS-Protection",
  "detail_web_appsecpriv_http_x_xss_tech_table": "OUTDATED TEXT; TEST NOT USED</p><p>Web server IP address|X-XSS-Protection value",
  "detail_web_appsecpriv_http_x_xss_tech_table_outdated_text_test_not_used_web_server_ip_address": "OUTDATED TEXT; TEST NOT USED</p><p>Web server IP address",
  "detail_web_appsecpriv_http_x_xss_tech_table_x_xss_protection_value": "X-XSS-Protection value",
  "detail_web_appsecpriv_http_x_xss_verdict_bad": "OUTDATED TEXT; TEST NOT USED</p><p>Your web server does <em>not</em> offer securely configured X-XSS-Protection.",
  "detail_web_appsecpriv_http_x_xss_verdict_good": "OUTDATED TEXT; TEST NOT USED</p><p>Your web server offers securely configured X-XSS-Protection.",
  "detail_web_dnssec_exists_exp": "We check if your domain, more specifically its SOA record, is DNSSEC signed.</p><p>If a domain redirects to another domain via <code>CNAME</code>, then we also check if the CNAME domain is signed (which is conformant with the DNSSEC standard). If the CNAME domain is not signed, the result of this subtest will be negative.</p><p>Note: the validity of the signature is not part of this subtest, but part of the next subtest.",
  "detail_web_dnssec_exists_label": "DNSSEC existence",
  "detail_web_dnssec_exists_tech_table": "Domain|Registrar",
  "detail_web_dnssec_exists_tech_table_domain": "Domain",
  "detail_web_dnssec_exists_tech_table_registrar": "Registrar",
  "detail_web_dnssec_exists_verdict_bad": "Your domain is insecure, because it is <em>not</em> DNSSEC signed.",
  "detail_web_dnssec_exists_verdict_good": "Your domain is DNSSEC signed.",
  "detail_web_dnssec_exists_verdict_resolver_error": "Unfortunately an error occurred in Internet.nl's resolver. Please <a href=\"/about/\">contact</a> us.",
  "detail_web_dnssec_exists_verdict_servfail": "The name servers of your domain are <em>broken</em>. They returned an error (<code>SERVFAIL</code>) to our queries for a DNSSEC signature. Please contact  your name server operator (often your hosting provider and/or registrar) to fix this soon.",
  "detail_web_dnssec_valid_exp": "We check if your domain, more specifically its SOA record, is signed with a valid signature making it 'secure'.</p><p>If a domain name redirects to another signed domain name via <code>CNAME</code>, then we also check if the signature of the CNAME domain name is valid (which is conformant with the DNSSEC standard). If the signature of the CNAME domain name is not valid, the result of this subtest will be negative.</p><p>Note that we only test the name server that responds first. If name servers of a domain name have inconsistent configurations, this can lead to varying test results. In that case, for example, the result for this subtest may be 'secure' one time and 'bogus' the next.",
  "detail_web_dnssec_valid_label": "DNSSEC validity",
  "detail_web_dnssec_valid_tech_table": "Domain|Status",
  "detail_web_dnssec_valid_tech_table_domain": "Domain",
  "detail_web_dnssec_valid_tech_table_status": "Status",
  "detail_web_dnssec_valid_verdict_bad": "Your domain is 'bogus', because the DNSSEC signature is <em>not</em> valid. Either someone manipulated the response from your name server, or your domain has a <em>serious DNSSEC configuration error</em>. The latter makes your domain unreachable for any user who validates DNSSEC signatures. You should contact your name server operator (often your registrar or hosting provider) as soon as possible.",
  "detail_web_dnssec_valid_verdict_good": "Your domain is secure, because its DNSSEC signature is valid.",
  "detail_web_dnssec_valid_verdict_unsupported_ds_algo": "Your domain is signed with an algorithm that our validating resolver currently does not support. Therefore we are not able to check the validity of its DNSSEC signature.",
  "detail_web_ipv6_web_aaaa_exp": "We check if there is at least one AAAA record with IPv6 address for your web server.</p><p>'IPv4-mapped IPv6 addresses' (<a href=\"https://www.rfc-editor.org/rfc/rfc4291\">RFC 4291</a>, beginning with ::ffff:) will fail in this subtest, as they do <em>not</em> provide IPv6 connectivity.",
  "detail_web_ipv6_web_aaaa_label": "IPv6 addresses for web server",
  "detail_web_ipv6_web_aaaa_tech_table": "Web server|IPv6 address|IPv4 address",
  "detail_web_ipv6_web_aaaa_tech_table_web_server": "Web server",
  "detail_web_ipv6_web_aaaa_tech_table_ipv6_address": "IPv6 address",
  "detail_web_ipv6_web_aaaa_tech_table_ipv4_address": "IPv4 address",
  "detail_web_ipv6_web_aaaa_verdict_bad": "<em>None</em> of your web servers has an IPv6 address.",
  "detail_web_ipv6_web_aaaa_verdict_good": "At least one of your web servers has an IPv6 address.",
  "detail_web_ipv6_web_ipv46_exp": "<p>We compare the available ports and offered headers and content of your web server via IPv6 with those via IPv4. </p><p>We check if:</p><ol><li>the same ports, i.e. HTTP (port 80) and/or HTTPS (port 443), are available via both IPv6 and IPv4; </li><li>the same HTTP headers are offered via both IPv6 and IPv4. This includes HTTP response codes, like successful responses (200 – 299) and redirection messages (300 – 399). In cases of a client error response (400 - 499) or a server error response (500 - 599) a warning without score impact is given, because such a HTTP response code may indicate a configuration issue;</li><li>the same HTML content is offered via both IPv6 and IPv4. We do this by comparing the content received after stripping any nonces. The content difference must not be higher than 10% to pass this subtest. This threshold ensures that small non-problematic differences (for example due to changing advertisements) do not immediately result in a failing result for this subtest. An observed difference may still be intended or due to measurement error. Therefore, in case of failure, this part of the subtest results only in a warning with no score impact.</li></ol><p>Additional notes:</p><ul><li>In case there are multiple IPv6 and IPv4 addresses, we pick one IPv6 address and one IPv4 address to perform the subtest. </li><li>If only an IPv6 address and no IPv4 address (or vice versa) is available, the subtest is not applicable because no comparison can be made.</li><li>This subtest follows redirects and also checks all underlying URLs.</li></ul>",
  "detail_web_ipv6_web_ipv46_label": "Same website on IPv6 and IPv4",
  "detail_web_ipv6_web_ipv46_verdict_bad": "Available ports or offered headers of your website via IPv4 are <em>not</em> the same via IPv6.",
  "detail_web_ipv6_web_ipv46_verdict_good": "Your website via IPv6 looks identical via IPv4.",
  "detail_web_ipv6_web_ipv46_verdict_notice": "The HTML content of your website via IPv4 is <em>not</em> the same via IPv6. ",
  "detail_web_ipv6_web_ipv46_verdict_notice_status_code": "Your website via IPv6 looks identical via IPv4, but the HTTP response code is in the 4xx or 5xx range. This may indicate a configuration issue.",
  "detail_web_ipv6_web_reach_exp": "We check if we can connect to your web server(s) over IPv6 on any available ports (80 and/or 443). We test all IPv6 addresses that we receive from your name servers. A partial score will be given if not all IPv6 addresses are reachable. If an IPv6 address is (syntactically) invalid, we consider it unreachable.",
  "detail_web_ipv6_web_reach_label": "IPv6 reachability of web server",
  "detail_web_ipv6_web_reach_tech_table": "Web server|Unreachable IPv6 address",
  "detail_web_ipv6_web_reach_tech_table_web_server": "Web server",
  "detail_web_ipv6_web_reach_tech_table_unreachable_ipv6_address": "Unreachable IPv6 address",
  "detail_web_ipv6_web_reach_verdict_bad": "At least one of your web servers with an IPv6 address is <em>not</em> reachable over IPv6.",
  "detail_web_ipv6_web_reach_verdict_good": "All your web servers with an IPv6 address are reachable over IPv6.",
  "detail_web_rpki_exists_exp": "We check if an RPKI Route Origin Authorization (ROA) has been published for all IP addresses of your web server.</p><p>Your hoster (or its network provider) announces through the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. Other network providers use these route announcements to determine via which route to send traffic for your server's IP addresses.</p><p>However, a route announcement can be faked. In fact, another network provider may be able to connect the IP address block of your IP address to its network and thus potentially receive Internet traffic that is actually intended for your network provider. The cause may be accidental or malicious. In either case, this can result in your server becoming unreachable or in Internet traffic to your server being intercepted.</p><p>Resource Public Key Infrastructure (RPKI) significantly improves protection against this. With RPKI, the rightful holder of a block of IP addresses can publish a digitally signed statement with route authorization (Route Origin Authorisation; ROA for short). Another network provider that wants to send Internet traffic to a particular IP address, can use the corresponding statement to filter out <code>Invalid</code> routes. In this way, the network provider prevents Internet traffic from its network from being sent to unauthorized provider networks.",
  "detail_web_rpki_exists_label": "Route Origin Authorisation existence",
  "detail_web_rpki_exists_tech_table": "Web server|IP address|RPKI Route Origin Authorization",
  "detail_web_rpki_exists_tech_table_web_server": "Web server",
  "detail_web_rpki_exists_tech_table_ip_address": "IP address",
  "detail_web_rpki_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_web_rpki_exists_verdict_bad": "For at least one of the IP addresses of your web server <em>no</em> RPKI Route Origin Authorisation (ROA) is published.",
  "detail_web_rpki_exists_verdict_good": "For all IP addresses of your web server an RPKI Route Origin Authorisation (ROA) is published.",
  "detail_web_rpki_exists_verdict_no_addresses": "Your domain does <em>not</em> contain any web server IP addresses. Therefore, this subtest could not be performed.",
  "detail_web_rpki_valid_exp": "We check if the validation status for all IP addresses of your web server is <code>Valid</code>. If there are multiple overlapping route announcements for the IP address, we test that they are all <code>Valid</code>.</p><p>Your hoster (or its network provider) announces via the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. It does this by associating (parts of) its IP address blocks (Route Prefix) with the unique number of its provider network (Route Origin ASN), and then distributing this routing information. Other network providers use these route announcements to determine via which route to send traffic for the IP addresses.</p><p>Additionally, for each route announcement, your hoster (or its network provider) should publish a digitally signed statement with route authorisation (Route Origin Authorisation; abbreviated: ROA) statement using Resource Public Key Infrastructure (RPKI). </p><p>Another network provider that is asked to send Internet traffic to your server's IP address can cryptographically verify the associated statement. The verified content (Validated ROA Payload; abbreviated: VRP) includes which provider networks (VRP ASN) are authorised to receive Internet traffic for each recorded IP address block (VRP Prefix). </p><p>The network provider can then use this content to filter BGP routes. For example, he can reject any <code>Invalid</code> routes, to prevent Internet traffic from its network is  sent to unauthorised provider networks.</p><p>Checking route announcements against route authorisations (RPKI Origin Validation; abbreviated: ROV) has the following three possible outcomes.</p><p>1․ <code>Valid</code>: The route announcement of the considered IP address is matched by at least one published route authorisation. A route authorisation is also matched for more specific route announcements (i.e., for a part of the IP address block contained in the route authorisation), unless they are more specific than the limit specified in the route authorisation (via the <code>maxLength</code> attribute). </p><p>2․ <code>Invalid</code>: The route announcement of the considered IP address is covered by a route authorisation, but it does <em>not</em> match. There are two possible causes:</p><ul><li>the IP address block (Route Prefix) is announced from a provider network (Route Origin ASN) that is <em>not</em> authorised in the route authorisation (result in the table below: \"invalid (as)\");</li><li>the IP address block (Route Prefix) that is announced is <em>smaller than is allowed</em> in the route authorisation, i.e. exceeding <code>maxLength</code> value (result in table below: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: No statement with route-authorisation has been found that covers the route announcement of the considered IP address. This makes the routing of Internet traffic to your server less secure. Please contact your hoster about this. He can ask his network provider that owns your server's IP addresses to publish route authorisations.</p><p><strong>What to do if the test result shows the status Invalid?</strong></p><p>The status <code>Invalid</code> indicates an unintentional or malicious route configuration error, that can be caused by your hoster or its network provider (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your hoster as soon as possible. In the case of an internal error, your hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error. ",
  "detail_web_rpki_valid_label": "Route announcement validity",
  "detail_web_rpki_valid_tech_table": "Web server|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation state",
  "detail_web_rpki_valid_tech_table_web_server": "Web server",
  "detail_web_rpki_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_web_rpki_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_web_rpki_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation state",
  "detail_web_rpki_valid_verdict_bad": "At least one IP address of your web server has a <code>NotFound</code> validation state. There is <em>no</em> RPKI Route Origin Authorization (ROA) published for the route announcement of each of the affected IP addresses.",
  "detail_web_rpki_valid_verdict_good": "All IP addresses of your web server have a <code>Valid</code> validation state. The route announcement of these IP addresses is matched by the published RPKI Route Origin Authorisation (ROA).",
  "detail_web_rpki_valid_verdict_invalid": "At least one IP address of your web server has an <code>Invalid</code> validation state. The route announcement of the affected IP addresses is <em>not</em> matched by the published RPKI Route Origin Authorisation (ROA). This indicates an unintentional or malicious route configuration error, that can be caused by your web hoster (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your web hoster as soon as possible. In the case of an internal error, your web hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error.",
  "detail_web_rpki_valid_verdict_not_routed": "This subtest did <em>not</em> run, because <em>no</em> route announcement was available for any of the IP addresses.",
  "detail_web_tls_cert_hostmatch_exp": "We check if the domain name of your website matches the domain name on the certificate. </p><p>It could be useful to include more than one domain (e.g. the domain with and without www) as Subject Alternative Name on the certificate.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B3-1 (in English).",
  "detail_web_tls_cert_hostmatch_label": "Domain name on certificate",
  "detail_web_tls_cert_hostmatch_tech_table": "Web server IP address|Unmatched domains on certificate",
  "detail_web_tls_cert_hostmatch_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_cert_hostmatch_tech_table_unmatched_domains_on_certificate": "Unmatched domains on certificate",
  "detail_web_tls_cert_hostmatch_verdict_bad": "The domain name of your website does <em>not</em> match the domain name on your website certificate.",
  "detail_web_tls_cert_hostmatch_verdict_good": "The domain name of your website matches the domain name on your website certificate.",
  "detail_web_tls_cert_pubkey_exp": "<p>We check if the (ECDSA or RSA) digital signature of your website certificate uses secure parameters. </p><p>The verification of certificates makes use of digital signatures. To guarantee the authenticity of a connection, a trustworthy algorithm for certificate verification must be used. The algorithm that is used to sign a certificate is selected by its supplier.The certificate specifies the algorithm for digital signatures that is used by its owner during the key exchange. It is possible to configure multiple certificates to support more than one algorithm.</p><p>The security of ECDSA digital signatures depends on the chosen curve. The security of RSA for encryption and digital signatures is tied to the key length of the public key. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B5-1 and table 9 for ECDSA, and guideline B3-3 and table 8 for RSA (in English).</p><hr /><p><strong>Elliptic curves for ECDSA</strong></p><ul><li>Good: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, and <code>x25519</code></li><li>Phase out: <code>secp224r1</code></li><li>Insufficient: Other curves</li></ul><p><strong>Length of RSA-keys</strong></p><ul><li>Good: At least 3072 bit</li><li>Sufficient: 2048 – 3071 bit</li><li>Insufficient: Less than 2048 bit</li></ul>",
  "detail_web_tls_cert_pubkey_label": "Public key of certificate",
  "detail_web_tls_cert_pubkey_tech_table": "Web server IP address|Affected signature parameters|Status",
  "detail_web_tls_cert_pubkey_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_cert_pubkey_tech_table_affected_signature_parameters": "Affected signature parameters",
  "detail_web_tls_cert_pubkey_tech_table_status": "Status",
  "detail_web_tls_cert_pubkey_verdict_bad": "The digital signature of your website certificate uses <em>insufficiently</em> secure parameters.",
  "detail_web_tls_cert_pubkey_verdict_good": "The digital signature of your website certificate uses secure parameters.",
  "detail_web_tls_cert_pubkey_verdict_phase_out": "The digital signature of your website certificate uses parameters that have a <em>phase out</em> status, because they are known to be fragile and are at risk of of becoming <em>insufficiently</em> secure.",
  "detail_web_tls_cert_signature_exp": "<p>We check if the signed fingerprint of the website certificate was created with a secure hashing algorithm. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B3-2 and table 3 (in English).</p><hr /><p><strong>Hash functions for certificate verification</strong></p><ul><li>Good: SHA-512, SHA-384, SHA-256</li><li>Insufficient: SHA-1, MD5</li></ul>",
  "detail_web_tls_cert_signature_label": "Signature of certificate",
  "detail_web_tls_cert_signature_tech_table": "Web server IP address|Affected hash algorithm|Status",
  "detail_web_tls_cert_signature_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_cert_signature_tech_table_affected_hash_algorithm": "Affected hash algorithm",
  "detail_web_tls_cert_signature_tech_table_status": "Status",
  "detail_web_tls_cert_signature_verdict_bad": "Your website certificate is signed using a hash algorithm that is <em>insufficiently</em> secure.",
  "detail_web_tls_cert_signature_verdict_good": "Your website certificate is signed using a secure hash algorithm.",
  "detail_web_tls_cert_trust_exp": "We check if we are able to build a valid chain of trust for your website certificate. </p><p>For a valid chain of trust, your certificate must be published by a <a href=\"https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/\">publicly trusted certificate authority</a>, and your web server must present all necessary intermediate certificates. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B3-4 (in English).",
  "detail_web_tls_cert_trust_label": "Trust chain of certificate",
  "detail_web_tls_cert_trust_tech_table": "Web server IP address|Untrusted certificate chain",
  "detail_web_tls_cert_trust_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_cert_trust_tech_table_untrusted_certificate_chain": "Untrusted certificate chain",
  "detail_web_tls_cert_trust_verdict_bad": "The trust chain of your website certificate is <em>not</em> complete and/or <em>not</em> signed by a trusted root certificate authority.",
  "detail_web_tls_cert_trust_verdict_good": "The trust chain of your website certificate is complete and signed by a trusted root certificate authority.",
  "detail_web_tls_cipher_order_exp": "We check if your web server enforces its own cipher preference ('I'), and offers ciphers in accordance with the prescribed ordering ('II'). </p><p>When your web server supports 'Good' ciphers only, this subtest is not applicable as the ordering has no significant security advantage. </p><p>I. <em>Server enforced cipher preference</em>: The web server enforces its own cipher preference while negotiating with a web browser, and does not accept any preference of the web browser;</p><p>II. <em>Prescribed ordering</em>: Ciphers are offered by the web server in accordance with the prescribed order where 'Good' is preferred over 'Sufficient' over 'Phase out' ciphers.</p><p>In the above table with technical details <strong>only the first found out of prescribed order algorithm selections</strong> are listed.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B2-5.",
  "detail_web_tls_cipher_order_label": "Cipher order",
  "detail_web_tls_cipher_order_tech_table": "Web server IP address|First found affected cipher pair|Violated rule # ('II-B')",
  "detail_web_tls_cipher_order_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_cipher_order_tech_table_first_found_affected_cipher_pair": "First found affected cipher pair",
  "detail_web_tls_cipher_order_tech_table_violated_rule_ii_b": "Violated rule # ('II-B')",
  "detail_web_tls_cipher_order_verdict_bad": "Your web server does <em>not</em> enforce its own cipher preference ('I').",
  "detail_web_tls_cipher_order_verdict_good": "Your web server enforces its own cipher preference ('I'), and offers ciphers in accordance with the prescribed ordering ('II').",
  "detail_web_tls_cipher_order_verdict_na": "This subtest is not applicable as your web server supports 'Good' ciphers only.",
  "detail_web_tls_cipher_order_verdict_seclevel_bad": "Your web server does <em>not</em> prefer 'Good' over 'Sufficient' over 'Phase out' ciphers ('II').",
  "detail_web_tls_cipher_order_verdict_warning": "OUTDATED TEXT; VERDICT NOT USED</p><p>Your web server does <em>not</em> offer ciphers in accordance with the prescribed ordering within a particular security level ('II-B').",
  "detail_web_tls_ciphers_exp": "<p>We check if your web server only supports secure, i.e. 'Good' and/or 'Sufficient', ciphers (also known as algorithm selections).</p><p>An algorithm selection consists of ciphers for four cryptographic functions: 1) key exchange, 2) certificate verification, 3) bulk encryption, and 4) hashing. A web server may support more than one algorithm selection. </p><ul><li>Since TLS 1.3, the term 'cipher suite' only comprises ciphers used for bulk encryption and hashing. When using TLS 1.3 the ciphers for key exchange and certificate verification are negotiable and not part of the naming of the cipher suite. Because this makes the term 'cipher suite' ambiguous, NCSC-NL uses the term 'algorithm selection' to comprise all four cipher functions. </li><li>NCSC-NL uses the <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4\">IANA naming convention</a> for algorithm selections. Internet.nl uses the <a href=\"https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES\">OpenSSL naming convention</a>. Since TLS 1.3 OpenSSL follows the IANA naming convention. A translation between both can be found in the OpenSSL documentation. </li><li>Note that ciphers using PSK or SRP for key exchange (which are not sufficiently secure) are not detected in this test due to a limitation related to our testing method. </li></ul><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B2-1 to B2-4 and table 2, 4, 6 and 7 (in English).</p><hr /><p>Below you find 'Good', 'Sufficient' and 'Phase out' algorithm selections in the by NCSC-NL prescribed order, based on appendix C of the 'IT Security Guidelines for Transport Layer Security (TLS)'. Behind every algorithm selection is the minimum TLS version (e.g. [1.2]) that supports this algorithm selection and that is at least 'Phase out'.</p><p>Good:</p><ul><li><code>ECDHE-ECDSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li></ul><p>Sufficient:</p><ul><li><code>ECDHE-ECDSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-ECDSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-ECDSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-ECDSA-AES128-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-RSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-RSA-AES128-SHA</code> [1.0]</li><li><code>DHE-RSA-AES256-GCM-SHA384</code> [1.2]</li><li><code>DHE-RSA-CHACHA20-POLY1305</code> [1.2]</li><li><code>DHE-RSA-AES128-GCM-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA</code> [1.0]</li><li><code>DHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES128-SHA</code> [1.0]</li></ul><p>Phase out:</p><ul><li><code>ECDHE-ECDSA-DES-CBC3-SHA</code> [1.0]</li><li><code>ECDHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>DHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>AES256-GCM-SHA384</code> [1.2]</li><li><code>AES128-GCM-SHA256</code> [1.2]</li><li><code>AES256-SHA256</code> [1.2]</li><li><code>AES256-SHA</code>  [1.0]</li><li><code>AES128-SHA256</code> [1.2]</li><li><code>AES128-SHA</code> [1.0]</li><li><code>DES-CBC3-SHA</code> [1.0]</li></ul>",
  "detail_web_tls_ciphers_label": "Ciphers (Algorithm selections)",
  "detail_web_tls_ciphers_tech_table": "Web server IP address|Affected ciphers|Status",
  "detail_web_tls_ciphers_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_ciphers_tech_table_affected_ciphers": "Affected ciphers",
  "detail_web_tls_ciphers_tech_table_status": "Status",
  "detail_web_tls_ciphers_verdict_bad": "Your web server supports one or more <em>insufficiently</em> secure ciphers.",
  "detail_web_tls_ciphers_verdict_good": "Your web server supports secure ciphers only.",
  "detail_web_tls_ciphers_verdict_phase_out": "Your web server supports one or more ciphers that have a <em>phase out</em> status, because they are known to be fragile and are at risk of becoming <em>insufficiently</em> secure.",
  "detail_web_tls_compression_exp": "<p>We check if your web server supports TLS compression. </p><p>The use of compression can give an attacker information about the secret parts of encrypted communication. An attacker that can determine or control parts of the data sent can reconstruct the original data by performing a large number of requests. TLS compression is used so rarely that disabling it is generally not a problem. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B7-1 and table 11 (in English).</p><hr /><p><strong>Compression option</strong></p><ul><li>Good: No compression</li><li>Sufficient: Application-level compression (in this case HTTP compression)</li><li>Insufficient: TLS compression</li></ul>",
  "detail_web_tls_compression_label": "TLS compression",
  "detail_web_tls_compression_tech_table": "Web server IP address|TLS compression",
  "detail_web_tls_compression_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_compression_tech_table_tls_compression": "TLS compression",
  "detail_web_tls_compression_verdict_bad": "Your web server supports TLS compression, which is <em>not</em> secure.",
  "detail_web_tls_compression_verdict_good": "Your web server does not support TLS compression.",
  "detail_web_tls_dane_exists_exp": "We check if the name servers of your website domain contain a correctly signed TLSA record for DANE. </p><p>As DNSSEC is preconditional for DANE, this test will fail in case DNSSEC is missing on the website domain, or if there are DANE related DNSSEC issues (e.g. no proof of 'Denial of Existence').</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, Appendix A, under 'Certificate pinning and DANE' (in English).</p><p><em>Requirement level: Optional</em>",
  "detail_web_tls_dane_exists_label": "DANE existence",
  "detail_web_tls_dane_exists_tech_table": "Web server IP address|DANE TLSA record existent",
  "detail_web_tls_dane_exists_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_dane_exists_tech_table_dane_tlsa_record_existent": "DANE TLSA record existent",
  "detail_web_tls_dane_exists_verdict_bad": "Your website domain does <em>not</em> contain a TLSA record for DANE.",
  "detail_web_tls_dane_exists_verdict_bogus": "Your website domain does <em>not</em> provide DNSSEC proof that DANE TLSA records do not exist. You should ask your name server operator to fix this issue.",
  "detail_web_tls_dane_exists_verdict_good": "Your website domain contains a TLSA record for DANE.",
  "detail_web_tls_dane_rollover_exp": "<p>OUTDATED TEXT; TEST NOT USED</p><p>We check if your website domain has a proper DANE rolloverscheme to handle DANE certificate rollovers. Having a DANE rollover schemein place is not required. It will be proven useful when there is a need toupdate your DANE certificate and you want to ensure that DANE validationwill continue to work during the transition period. The way to achievethis is by publishing two different TLSA records. The configurations ofthe TLSA record types are the following:</p><ul><li>record type 3 1 1 (current key) + record type 3 1 1 (future key), or</li><li>record type 3 1 1 (current key) + record type 2 1 1 (trusted CA).</li></ul>",
  "detail_web_tls_dane_rollover_label": "OUTDATED TEXT; TEST NOT USED</p><p>DANE rollover scheme",
  "detail_web_tls_dane_rollover_tech_table": "OUTDATED TEXT; TEST NOT USED</p><p>Web server IP address|DANE rollover scheme",
  "detail_web_tls_dane_rollover_tech_table_outdated_text_test_not_used_web_server_ip_address": "OUTDATED TEXT; TEST NOT USED</p><p>Web server IP address",
  "detail_web_tls_dane_rollover_tech_table_dane_rollover_scheme": "DANE rollover scheme",
  "detail_web_tls_dane_rollover_verdict_bad": "OUTDATED TEXT; TEST NOT USED</p><p>Your website domain does <em>not</em> have a proper scheme forrolling DANE certificates.",
  "detail_web_tls_dane_rollover_verdict_good": "OUTDATED TEXT; TEST NOT USED</p><p>Your website domain has a proper scheme for rolling DANEcertificates.",
  "detail_web_tls_dane_valid_exp": "We check if the DANE fingerprint presented by your domain is valid for your web certificate. </p><p>DANE allows you to publish information about your website certificate in a special DNS record, called TLSA record. Clients, like web browsers, can check the authenticity of your certificate not only through the certificate authority but also through the TLSA record. A client can also use the TLSA record as a signal to only use HTTPS (and not HTTP). DNSSEC is preconditional for DANE. Unfortunately not much web browsers are supporting DANE validation yet.</p><p><em>Requirement level: Recommended (only if subtest for 'DANE existence' is passed)</em>",
  "detail_web_tls_dane_valid_label": "DANE validity",
  "detail_web_tls_dane_valid_tech_table": "Web server IP address|DANE TLSA record valid",
  "detail_web_tls_dane_valid_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_dane_valid_tech_table_dane_tlsa_record_valid": "DANE TLSA record valid",
  "detail_web_tls_dane_valid_verdict_bad": "The DANE fingerprint on your domain is <em>not</em> valid for your web certificate. Either someone manipulated the response from your name server, or your domain has a serious DANE configuration error. The latter makes your website unreachable for any user who check DANE fingerprints. You should contact your name server operator and/or your hosting provider as soon as possible.",
  "detail_web_tls_dane_valid_verdict_good": "The DANE fingerprint on your domain is valid for your web certificate.",
  "detail_web_tls_fs_params_exp": "We check if the public parameters used in Diffie-Hellman key exchange by your web server are secure.</p><p><strong>ECDHE</strong>: The security of elliptic curve Diffie-Hellman (ECDHE) ephemeral key exchange depends on the used elliptic curve. We check if the bit-length of the used elliptic curves is a least 224 bits. Currently we are not able to check the elliptic curve name.</p><p><strong>DHE</strong>: The security of Diffie-Hellman Ephemeral (DHE) key exchange depends on the lengths of the public and secret keys used within the chosen finite field group. We test if your DHE public key material uses one of the predefined finite field groups that are specified in <a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>. Self-generated groups are 'Insufficient'. </p><p>The larger key sizes required for the use of DHE come with a performance penalty. Carefully evaluate and use ECDHE instead of DHE if you can.</p><p><strong>RSA as an alternative</strong>: Besides ECDHE and DHE, RSA can be used for key exchange. However, it is at risk of becoming insufficiently secure (current status 'phase out'). The RSA public parameters are tested in the subtest 'Public key of certificate'. Note that RSA is considered as 'good' for certificate verification.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B5-1 and table 9 for ECDHE, and guideline B6-1 and table 10 for DHE (in English).</p><hr /><p><strong>Elliptic curve for ECDHE</strong></p><ul><li>Good: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, and <code>x25519</code></li><li>Phase out: <code>secp224r1</code></li><li>Insufficient: Other curves</li></ul><p><strong>Finite field group for DHE</strong></p><ul><li><p>Sufficient:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem\">ffdhe4096</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3</code></li><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem\">ffdhe3072</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab</code>  </li><li>Note that we also test for ffdhe8192 and ffdhe6144. However their limited gain in security rarely outweighs the loss in performance.</li></ul></li><li><p>Phase out:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem\">ffdhe2048</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b</code></li></ul></li><li><p>Insufficient: Other groups</p></li></ul><hr /><p>Note: the above names are based on the <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml\">IANA naming conventions</a>. Sometimes alternative names are used to refer to the same curves, like <code>prime256v1</code> (ANSI) and <code>NIST P-256</code> for <code>secp256r1</code>.",
  "detail_web_tls_fs_params_label": "Key exchange parameters",
  "detail_web_tls_fs_params_tech_table": "Web server IP address|Affected parameters|Status",
  "detail_web_tls_fs_params_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_fs_params_tech_table_affected_parameters": "Affected parameters",
  "detail_web_tls_fs_params_tech_table_status": "Status",
  "detail_web_tls_fs_params_verdict_bad": "Your web server supports <em>insufficiently</em> secure parameters for Diffie-Hellman key exchange.",
  "detail_web_tls_fs_params_verdict_good": "Your web server supports secure parameters for Diffie-Hellman key exchange.",
  "detail_web_tls_fs_params_verdict_na": "This subtest is not applicable as your web server does <em>not</em> support Diffie-Hellman key exchange. Note that RSA is an alternative for key exchange, but has the <em>phase out</em> status.",
  "detail_web_tls_fs_params_verdict_phase_out": "Your web server supports parameters for Diffie-Hellman key exchange that have a <em>phase out</em> status, because they are known to be fragile and are at risk of of becoming <em>insufficiently</em> secure.",
  "detail_web_tls_http_compression_exp": "<p>We test if your web server supports HTTP compression. </p><p>HTTP compression makes the secure connection with your web server vulnerable for the BREACH attack. However HTTP compression is commonly used to make more efficient use of available bandwidth. Consider the trade-offs involved with HTTP compression. If you choose to use HTTP compression, verify if it is possible to mitigate related attacks at the application level. An example of such a measure is limiting the extent to which an attacker can influence the response of a server. </p><p>This subtest checks if the web server on root directory level supports HTTP compression. However it does not check additional website sources like images and scripts. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B7-1 and table 11.</p><p><em>Requirement level: Optional</em></p><hr /><p><strong>Compression option</strong></p><ul><li>Good: No compression</li><li>Sufficient: Application-level compression (in this case HTTP compression)</li><li>Insufficient: TLS compression</li></ul>",
  "detail_web_tls_http_compression_label": "HTTP compression",
  "detail_web_tls_http_compression_tech_table": "Web server IP address|HTTP compression",
  "detail_web_tls_http_compression_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_http_compression_tech_table_http_compression": "HTTP compression",
  "detail_web_tls_http_compression_verdict_bad": "Your web server supports HTTP compression, which could be a security risk.",
  "detail_web_tls_http_compression_verdict_good": "Your web server does not support HTTP compression.",
  "detail_web_tls_https_exists_exp": "We check if your website is reachable on HTTPS. </p><p>If so, we also check in the below subtests whether HTTPS is configured sufficiently secure in conformance with the <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL.</p><p>HTTPS guarantees the confidentiality and integrity of the exchanged information. Because it is situation depended how (privacy) sensitive and valuable information is, a secure HTTPS configuration is important for every website. Even trivial, public information could be extremely sensitive and valuable for a user. </p><p>Note on IPv6/IPv4: for performance reasons all tests in the category 'Secure connection (HTTPS)' only run for the first available IPv6 and IPv4 address.",
  "detail_web_tls_https_exists_label": "HTTPS available",
  "detail_web_tls_https_exists_tech_table": "Web server IP address|HTTPS existent",
  "detail_web_tls_https_exists_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_https_exists_tech_table_https_existent": "HTTPS existent",
  "detail_web_tls_https_exists_verdict_bad": "Your website does <em>not</em> offer HTTPS.",
  "detail_web_tls_https_exists_verdict_good": "Your website offers HTTPS.",
  "detail_web_tls_https_exists_verdict_other": "Your web server is unreachable.",
  "detail_web_tls_https_forced_exp": "We check if your web server automatically redirects visitors from HTTP to HTTPS on the same domain (through a 3xx redirect status code like 301 and 302), or if it offers support for only HTTPS and not for HTTP. </p><p>In case of redirecting, a domain should firstly upgrade itself by redirecting to its HTTPS version before it may redirect to another domain. This also ensures that the HSTS policy will be accepted by the web browser. Examples of correct redirect order:</p><ul><li><code>http://example.nl</code> ⇒ <code>https://example.nl</code> ⇒ <code>https://www.example.nl</code></li><li><code>http://www.example.nl</code> ⇒ <code>https://www.example.nl</code></li></ul><p>Note that this subtest only tests if the given domain correctly redirects from HTTP to HTTPS. An eventual further redirect to a different domain (including a subdomain of the tested domain) is not tested. You could start a separate test to test such a domain that is being redirected to.</p><p>See <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Web application guidelines, detailed version'</a> from NCSC-NL, guideline U/WA.05 (in Dutch).",
  "detail_web_tls_https_forced_label": "HTTPS redirect",
  "detail_web_tls_https_forced_tech_table": "Web server IP address|HTTPS redirect",
  "detail_web_tls_https_forced_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_https_forced_tech_table_https_redirect": "HTTPS redirect",
  "detail_web_tls_https_forced_verdict_bad": "Your web server does offer support for both HTTP and HTTPS, but does <em>not</em> automatically redirect visitors from HTTP to HTTPS on the same domain.",
  "detail_web_tls_https_forced_verdict_good": "Your web server automatically redirects visitors from HTTP to HTTPS on the same domain.",
  "detail_web_tls_https_forced_verdict_no_https": "This test could not be performed, because your web server offers either no HTTPS or HTTPS with a very outdated, insecure TLS configuration.",
  "detail_web_tls_https_forced_verdict_other": "Your web server only offers support for HTTPS and not for HTTP.",
  "detail_web_tls_https_hsts_exp": "We check if your web server supports HSTS. </p><p>Browsers remember HSTS per (sub) domain. Not adding a HSTS header to every (sub) domain (in a redirect chain) might leave users vulnerable to MITM attacks. Therefore we check for HSTS on the first contact i.e. before any redirect.</p><p>HSTS forces a web browser to connect directly via HTTPS when revisiting your website. This helps preventing man-in-the-middle attacks. We consider a HSTS cache validity period of <em>at least</em> 1 year (<code>max-age=31536000</code>) to be sufficiently secure. A long period is beneficial because it also protects infrequent visitors. However if you want to stop supporting HTTPS (which is generally a poor idea), you will have to wait longer until the validity of the HSTS policy in all browsers that visited your website, has expired. </p><p>The test does <strong>not</strong> check whether <code>preload</code> is used and whether the domain is included in the <a href=\"https://hstspreload.org/\">HSTS Preload List</a>.</p><hr /><p><strong>Deployment recommendation</strong></p><p>HSTS requires your website to fully work over HTTPS. This also includes having a valid certificate from a publicly trusted certificate authority. So when your website does not properly support HTTPS, note that it will <em>not be reachable</em> by browsers that have contacted your website before. A HSTS policy change to revert effects will not have immediate effect for these browsers since they have cached your previous HSTS policy. </p><p>Therefore we advise you to follow the implementation steps below:</p><ol><li>Make sure that the website on your domain fully works over HTTPS now and in the future (e.g. by having a solid certificate rollover procedure);</li><li><p>Increase the HSTS cache validity period in the stages below. During each stage, carefully check for reachability issues and broken pages. Fix any issues that come up and then wait the full max-age of the stage before moving to the next stage. </p></li><li><p>Start with 5 minutes (<code>max-age=300</code>);</p></li><li>Increase it to 1 week (<code>max-age=604800</code>);</li><li>Increase it to 1 month (<code>max-age=2592000</code>);</li><li><p>Increase it to 1 year (<code>max-age=31536000</code>) or more.</p></li><li><p>Repeat step 1 and 2 for every single subdomain that you want to secure with HSTS. Only use <code>includeSubDomains</code> if you are fully sure that <strong>all</strong> the (nested) subdomains of your domain properly support HTTPS now and in the future.</p></li><li>Use <code>preload</code> <strong>only</strong> if you are very sure that you want your domain to be included in the <a href=\"https://hstspreload.org/\">HSTS Preload List</a>. HSTS preloading is mostly interesting for highly sensitive websites. Administrators who want to enable HSTS preloading for a particular domain should do so with extreme caution. It can affect the reachability of the domain and of any subdomains, and is not easily reversed.</li></ol><hr /><p>See <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Web application guidelines, detailed version'</a> from NCSC-NL, guideline U/WA.05 (in Dutch).",
  "detail_web_tls_https_hsts_label": "HSTS",
  "detail_web_tls_https_hsts_tech_table": "Web server IP address|HSTS policy",
  "detail_web_tls_https_hsts_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_https_hsts_tech_table_hsts_policy": "HSTS policy",
  "detail_web_tls_https_hsts_verdict_bad": "Your web server does <em>not</em> offer an HSTS policy.",
  "detail_web_tls_https_hsts_verdict_good": "Your web server offers an HSTS policy.",
  "detail_web_tls_https_hsts_verdict_other": "Your web server offers an HSTS policy with a cache validity period (<code>max-age</code>) that is <em>not</em> sufficiently long (i.e. less than 1 year).",
  "detail_web_tls_kex_hash_func_exp": "<p>We check if your web server supports secure hash functions to create the digital signature during key exchange.</p><p>The web server uses a digital signature during the key exchange to prove ownership of the secret key corresponding to the certificate. The web server creates this digital signature by signing the output of a hash function. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, table 5.</p><p><em>Requirement level: Recommended</em></p><hr /><p><strong>SHA2 support for signatures</strong></p><ul><li>Good: Yes (SHA-256, SHA-384 or SHA-512 supported)</li><li>Phase out: No (SHA-256, SHA-384 of SHA-512 <em>not</em> supported)</li></ul>",
  "detail_web_tls_kex_hash_func_label": "Hash function for key exchange",
  "detail_web_tls_kex_hash_func_tech_table": "Web server IP address|SHA2 support for signatures",
  "detail_web_tls_kex_hash_func_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_kex_hash_func_tech_table_sha2_support_for_signatures": "SHA2 support for signatures",
  "detail_web_tls_kex_hash_func_verdict_good": "Your web server supports a secure hash function for key exchange.",
  "detail_web_tls_kex_hash_func_verdict_other": "We were unable to determine the hash function used by your web server. This could be because the cipher combination used has no signature for certificate verification (e.g. it uses RSA key exchange or is anonymous i.e. <code>anon</code>).",
  "detail_web_tls_kex_hash_func_verdict_phase_out": "Your web server does <em>not</em> support a secure hash function for key exchange. You should <em>phase out</em> this setting deliberately, because it is at risk of becoming <em>insufficiently</em> secure in the future.",
  "detail_web_tls_ocsp_stapling_exp": "<p>We check if your web server supports the <a href=\"https://www.rfc-editor.org/rfc/rfc6961\">TLS Certificate Status extension</a> also known as OCSP stapling. </p><p>The web browser can verify the validity of the certificate presented by the web server by contacting the certificate authority using the OCSP protocol. OCSP provides a certificate authority with information on browsers communicating to the web server: this may be a privacy risk. A web server can also provide OCSP responses to web browsers itself through OCSP stapling. This solves this privacy risk, does not require connectivity between web browser and certificate authority, and is faster. </p><p>When connecting to your web server we use the TLS Certificate Status extension to request OCSP data be included in the server response. If your web server includes OCSP data in the response we then verify that the OCSP data is valid i.e. correctly signed by a known certificate authority. Note: we do not use the OCSP data to evaluate the validity of the certificate.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, table 15 (in English).</p><p><em>Requirement level: Optional</em></p><hr /><p><strong>OCSP stapling</strong></p><ul><li>Good: On</li><li>Sufficient: Off</li></ul>",
  "detail_web_tls_ocsp_stapling_label": "OCSP stapling",
  "detail_web_tls_ocsp_stapling_tech_table": "Web server IP address|OCSP stapling",
  "detail_web_tls_ocsp_stapling_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_ocsp_stapling_tech_table_ocsp_stapling": "OCSP stapling",
  "detail_web_tls_ocsp_stapling_verdict_bad": "Your web server supports OCSP stapling but the data in the response is <em>not</em> valid.",
  "detail_web_tls_ocsp_stapling_verdict_good": "Your web server supports OCSP stapling and the data in the response is valid.",
  "detail_web_tls_ocsp_stapling_verdict_ok": "Your web server does <em>not</em> support OCSP stapling.",
  "detail_web_tls_renegotiation_client_exp": "<p>We check if a client (usually a web browser) can initiate a renegotiation with your web server. </p><p>Allowing clients to initiate renegotiation is generally not necessary and opens a web server to DoS attacks inside a TLS connection. An attacker can perform similar DoS attacks without client-initiated renegotiation by opening many parallel TLS connections, but these are easier to detect and defend against using standard mitigations. Note that client-initiated renegotiation impacts availability and not confidentiality. </p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B8-1 and table 13 (in English).</p><p><em>Requirement level: Optional</em></p><hr /><p><strong>Client-initiated renegotiation</strong></p><ul><li>Good: Off (or N/A for TLS 1.3)</li><li>Sufficient: On</li></ul>",
  "detail_web_tls_renegotiation_client_label": "Client-initiated renegotiation",
  "detail_web_tls_renegotiation_client_tech_table": "Web server IP address|Client-initiated renegotiation",
  "detail_web_tls_renegotiation_client_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_renegotiation_client_tech_table_client_initiated_renegotiation": "Client-initiated renegotiation",
  "detail_web_tls_renegotiation_client_verdict_bad": "Your web server allows for client-initiated renegotiation, which could have negative impact on the availability of your website.",
  "detail_web_tls_renegotiation_client_verdict_good": "Your web server does not allow for client-initiated renegotiation.",
  "detail_web_tls_renegotiation_secure_exp": "<p>We check if your web server supports secure renegotiation. </p><p>Older versions of TLS (prior to TLS 1.3) allow forcing a new handshake. This so-called renegotiation was insecure in its original design. The standard was repaired and a safer renegotiation mechanism was added. The old version is since called insecure renegotiation and should be disabled.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B8-1 and table 12 (in English).</p><hr /><p><strong>Insecure renegotiation</strong></p><ul><li>Good: Off (or N/A for TLS 1.3)</li><li>Insufficient: On</li></ul>",
  "detail_web_tls_renegotiation_secure_label": "Secure renegotiation",
  "detail_web_tls_renegotiation_secure_tech_table": "Web server IP address|Secure renegotiation",
  "detail_web_tls_renegotiation_secure_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_renegotiation_secure_tech_table_secure_renegotiation": "Secure renegotiation",
  "detail_web_tls_renegotiation_secure_verdict_bad": "Your web server supports insecure renegotiation, which is obviously <em>not</em> secure.",
  "detail_web_tls_renegotiation_secure_verdict_good": "Your web server supports secure renegotiation.",
  "detail_web_tls_version_exp": "<p>We check if your web server supports secure TLS versions only. </p><p>A web server may support more than one TLS version. </p><p>Note that browser makers have announced that they will stop supporting TLS 1.1 and 1.0. This will cause websites that do not support TLS 1.2 and/or 1.3 to be unreachable.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B1-1 and table 1 (in English).</p><hr /><p><strong>Version</strong></p><ul><li>Good: TLS 1.3</li><li>Sufficient: TLS 1.2</li><li>Phase out: TLS 1.1 and 1.0</li><li>Insufficient: SSL 3.0, 2.0 and 1.0</li></ul>",
  "detail_web_tls_version_label": "TLS version",
  "detail_web_tls_version_tech_table": "Web server IP address|TLS version|Status",
  "detail_web_tls_version_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_version_tech_table_tls_version": "TLS version",
  "detail_web_tls_version_tech_table_status": "Status",
  "detail_web_tls_version_verdict_bad": "Your web server supports <em>insufficiently</em> secure TLS versions.",
  "detail_web_tls_version_verdict_good": "Your web server supports secure TLS versions only.",
  "detail_web_tls_version_verdict_phase_out": "Your web server supports TLS versions that should be <em>phased out</em> deliberately, because they are known to be fragile and at risk of becoming <em>insufficiently</em> secure.",
  "detail_web_tls_zero_rtt_exp": "<p>We check if your web server supports Zero Round Trip Time Resumption (0-RTT).</p><p>0-RTT is an option in TLS 1.3 that transports application data during the firsthandshake message. 0-RTT does not provide protection against replay attacks atthe TLS layer and therefore should be disabled. Although the risk can be mitigated by not allowing 0-RTT fornon-idempotent requests, such a configuration is often not trivial, reliant on application logic and thus error prone.</p><p>If your web server does not support TLS 1.3, the test is not applicable.For web servers that support TLS 1.3, the index <code>/</code> page of the website isfetched using TLS 1.3 and the amount of<a href=\"https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html\">early data</a>support <a href=\"https://www.rfc-editor.org/rfc/rfc8446#section-4.2.10\">indicated</a> by theserver is checked. When more than zero, a second connection is made re-usingthe TLS session details of the first connection but sending theHTTP request <em>before</em> the TLS handshake (i.e. no round trips (0-RTT) neededbefore application data to the server). If the TLS handshake is completed andthe web server responds with anynon-<a href=\"https://www.rfc-editor.org/rfc/rfc8470#section-5.2\">HTTP 425 Too Early</a>response, then the web server is considered to support 0-RTT.</p><p>See <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'IT Security Guidelines for Transport Layer Security (TLS) v2.1'</a> from NCSC-NL, guideline B9-1 and table 14 (in English).</p><hr /><p><strong>0-RTT</strong></p><ul><li>Good: Off (or N/A prior to TLS 1.3)</li><li>Insufficient: On</li></ul>",
  "detail_web_tls_zero_rtt_label": "0-RTT",
  "detail_web_tls_zero_rtt_tech_table": "Web server IP address|0-RTT",
  "detail_web_tls_zero_rtt_tech_table_web_server_ip_address": "Web server IP address",
  "detail_web_tls_zero_rtt_tech_table_0_rtt": "0-RTT",
  "detail_web_tls_zero_rtt_verdict_bad": "Your web server supports 0-RTT, which is <em>not</em> secure.",
  "detail_web_tls_zero_rtt_verdict_good": "Your web server does not support 0-RTT.",
  "detail_web_tls_zero_rtt_verdict_na": "This subtest is not applicable as your web server does not support TLS 1.3.",
  "detail_web_mail_ipv6_ns_aaaa_exp": "We check if your domain name has at least two name servers with an IPv6 address. </p><p>This is consistent with the <a href=\"https://www.sidn.nl/downloads/KwpW_ORWRWetYuoBp5GeYA/7e91faddb53ad85b8c6a2fce15d764cb/Technical_requirements_for_the_registration_and_use_of_nl_domain_names.pdf\">\"Technical requirements for the registration and use of .nl domain names\"</a> d.d. 13 November 2017 by SIDN (.nl TLD registry) that require each .nl domain to have at least two name servers.</p><p>'IPv4-mapped IPv6 addresses' (<a href=\"https://www.rfc-editor.org/rfc/rfc4291\">RFC 4291</a>, beginning with ::ffff:) will fail in this test, as they do <em>not</em> provide IPv6 connectivity.",
  "detail_web_mail_ipv6_ns_aaaa_label": "IPv6 addresses for name servers",
  "detail_web_mail_ipv6_ns_aaaa_tech_table": "Name server|IPv6 address|IPv4 address",
  "detail_web_mail_ipv6_ns_aaaa_tech_table_name_server": "Name server",
  "detail_web_mail_ipv6_ns_aaaa_tech_table_ipv6_address": "IPv6 address",
  "detail_web_mail_ipv6_ns_aaaa_tech_table_ipv4_address": "IPv4 address",
  "detail_web_mail_ipv6_ns_aaaa_verdict_bad": "None of the name servers of your domain has an IPv6 address.",
  "detail_web_mail_ipv6_ns_aaaa_verdict_good": "Two or more name servers of your domain have an IPv6 address.",
  "detail_web_mail_ipv6_ns_aaaa_verdict_other": "Only one name server of your domain has an IPv6 address.",
  "detail_web_mail_ipv6_ns_reach_exp": "We check if all name servers, that have an AAAA record with IPv6 address, are reachable over IPv6.",
  "detail_web_mail_ipv6_ns_reach_label": "IPv6 reachability of name servers",
  "detail_web_mail_ipv6_ns_reach_tech_table": "Name server|Unreachable IPv6 address",
  "detail_web_mail_ipv6_ns_reach_tech_table_name_server": "Name server",
  "detail_web_mail_ipv6_ns_reach_tech_table_unreachable_ipv6_address": "Unreachable IPv6 address",
  "detail_web_mail_ipv6_ns_reach_verdict_bad": "<em>Not</em> all name servers that have an IPv6 address are reachable over IPv6.",
  "detail_web_mail_ipv6_ns_reach_verdict_good": "All name servers that have an IPv6 address are reachable over IPv6.",
  "detail_web_mail_rpki_ns_exists_exp": "We check if an RPKI Route Origin Authorization (ROA) has been published for all IP addresses of the name servers of your domain.</p><p>Your hoster (or its network provider) announces through the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. Other network providers use these route announcements to determine via which route to send traffic for your server's IP addresses.</p><p>However, a route announcement can be faked. In fact, another network provider may be able to connect the IP address block of your IP address to its network and thus potentially receive Internet traffic that is actually intended for your network provider. The cause may be accidental or malicious. In either case, this can result in your server becoming unreachable or in Internet traffic to your server being intercepted.</p><p>Resource Public Key Infrastructure (RPKI) significantly improves protection against this. With RPKI, the rightful holder of a block of IP addresses can publish a digitally signed statement with route authorization (Route Origin Authorisation; ROA for short). Another network provider that wants to send Internet traffic to a particular IP address, can use the corresponding statement to filter out <code>Invalid</code> routes. In this way, the network provider prevents Internet traffic from its network from being sent to unauthorized provider networks.",
  "detail_web_mail_rpki_ns_exists_label": "Route Origin Authorisation existence",
  "detail_web_mail_rpki_ns_exists_tech_table": "Name server|IP address|RPKI Route Origin Authorization",
  "detail_web_mail_rpki_ns_exists_tech_table_name_server": "Name server",
  "detail_web_mail_rpki_ns_exists_tech_table_ip_address": "IP address",
  "detail_web_mail_rpki_ns_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_web_mail_rpki_ns_exists_verdict_bad": "For at least one of the IP addresses of your name servers <em>no</em> RPKI Route Origin Authorisation (ROA) is published.",
  "detail_web_mail_rpki_ns_exists_verdict_good": "For all IP addresses of your name servers an RPKI Route Origin Authorisation (ROA) is published.",
  "detail_web_mail_rpki_ns_exists_verdict_no_addresses": "Your domain does <em>not</em> contain any name servers. Therefore, this subtest could not be performed.",
  "detail_web_mail_rpki_ns_valid_exp": "We check if the validation status for all IP addresses of the name servers of your domain is <code>Valid</code>. If there are multiple overlapping route announcements for the IP address, we test that they are all <code>Valid</code>.</p><p>Your hoster (or its network provider) announces via the Border Gateway Protocol (BGP) for which of its IP address blocks it accepts incoming Internet traffic. It does this by associating (parts of) its IP address blocks (Route Prefix) with the unique number of its provider network (Route Origin ASN), and then distributing this routing information. Other network providers use these route announcements to determine via which route to send traffic for the IP addresses.</p><p>Additionally, for each route announcement, your hoster (or its network provider) should publish a digitally signed statement with route authorisation (Route Origin Authorisation; abbreviated: ROA) statement using Resource Public Key Infrastructure (RPKI). </p><p>Another network provider that is asked to send Internet traffic to your server's IP address can cryptographically verify the associated statement. The verified content (Validated ROA Payload; abbreviated: VRP) includes which provider networks (VRP ASN) are authorised to receive Internet traffic for each recorded IP address block (VRP Prefix). </p><p>The network provider can then use this content to filter BGP routes. For example, he can reject any <code>Invalid</code> routes, to prevent Internet traffic from its network is  sent to unauthorised provider networks.</p><p>Checking route announcements against route authorisations (RPKI Origin Validation; abbreviated: ROV) has the following three possible outcomes.</p><p>1․ <code>Valid</code>: The route announcement of the considered IP address is matched by at least one published route authorisation. A route authorisation is also matched for more specific route announcements (i.e., for a part of the IP address block contained in the route authorisation), unless they are more specific than the limit specified in the route authorisation (via the <code>maxLength</code> attribute). </p><p>2․ <code>Invalid</code>: The route announcement of the considered IP address is covered by a route authorisation, but it does <em>not</em> match. There are two possible causes:</p><ul><li>the IP address block (Route Prefix) is announced from a provider network (Route Origin ASN) that is <em>not</em> authorised in the route authorisation (result in the table below: \"invalid (as)\");</li><li>the IP address block (Route Prefix) that is announced is <em>smaller than is allowed</em> in the route authorisation, i.e. exceeding <code>maxLength</code> value (result in table below: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: No statement with route-authorisation has been found that covers the route announcement of the considered IP address. This makes the routing of Internet traffic to your server less secure. Please contact your hoster about this. He can ask his network provider that owns your server's IP addresses to publish route authorisations.</p><p><strong>What to do if the test result shows the status Invalid?</strong></p><p>The status <code>Invalid</code> indicates an unintentional or malicious route configuration error, that can be caused by your hoster or its network provider (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your hoster as soon as possible. In the case of an internal error, your hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error. ",
  "detail_web_mail_rpki_ns_valid_label": "Route announcement validity",
  "detail_web_mail_rpki_ns_valid_tech_table": "Name server|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation state",
  "detail_web_mail_rpki_ns_valid_tech_table_name_server": "Name server",
  "detail_web_mail_rpki_ns_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_web_mail_rpki_ns_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_web_mail_rpki_ns_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation state",
  "detail_web_mail_rpki_ns_valid_verdict_bad": "At least one IP address of your name servers has a <code>NotFound</code> validation state. There is <em>no</em> RPKI Route Origin Authorisation (ROA) is published for its route announcement.",
  "detail_web_mail_rpki_ns_valid_verdict_good": "All IP addresses of your name servers have a <code>Valid</code> validation state. The route announcement of these IP addresses is matched by the published RPKI Route Origin Authorisation (ROA).",
  "detail_web_mail_rpki_ns_valid_verdict_invalid": "At least one IP address of your name servers has an <code>Invalid</code> validation state. The route announcement of the affected IP addresses is <em>not</em> matched by the published RPKI Route Origin Authorisation (ROA). This indicates an unintentional or malicious route configuration error, that can be caused by your name server hoster (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your name server hoster as soon as possible. In the case of an internal error, your name server hoster should ask its network provider that owns your server's IP addresses to fix the route configuration error.",
  "detail_web_mail_rpki_ns_valid_verdict_not_routed": "This subtest did <em>not</em> run, because <em>no</em> route announcement was available for any of the IP addresses.",
  "domain_pagetitle": "Website test:",
  "domain_title": "Website test: {{prettyaddr}}",
  "domain_tweetmessage": "The%20website%20{{report.domain}}%20scores%20{{score}}%25%20in%20the%20website%20test%20of%20%40Internet_nl%3A",
  "faqs_appsecpriv_title": "Security options",
  "faqs_badges_title": "Using the 100% badges",
  "faqs_batch_and_dashboard_title": "Batch API and web-based dashboard",
  "faqs_dnssec_title": "Domain signature (DNSSEC)",
  "faqs_halloffame_title": "Criteria for 'Hall of Fame for Hosters'",
  "faqs_https_title": "Secure website connection (HTTPS)",
  "faqs_ipv6_title": "Modern address (IPv6)",
  "faqs_mailauth_title": "Protection against email phishing (DMARC, DKIM and SPF)",
  "faqs_measurements_title": "Measurements using Internet.nl",
  "faqs_report_score_title": "Norm and score",
  "faqs_report_subtest_bad": "Bad: fail on REQUIRED subtest ⇒ null score",
  "faqs_report_subtest_error": "Test error: error encountered during testing ⇒ null score",
  "faqs_report_subtest_good": "Good: pass on REQUIRED, RECOMMENDED or OPTIONAL subtest ⇒ first: full score / latter two: no score impact",
  "faqs_report_subtest_info": "Informational: fail on OPTIONAL subtest ⇒ no score impact",
  "faqs_report_subtest_not_tested": "Not tested, because already failed related parent subtest ⇒ null score",
  "faqs_report_subtest_title": "Icons per subtest",
  "faqs_report_subtest_warning": "Warning: fail on RECOMMENDED subtest ⇒ no score impact",
  "faqs_report_test_bad": "Bad: failed at least one REQUIRED subtest ⇒ no full score in test category",
  "faqs_report_test_error": "Test error: execution error for at least one subtest ⇒ no result in test category",
  "faqs_report_test_good": "Good: passed all subtests ⇒ full score in test category",
  "faqs_report_test_info": "Informational: failed at least one OPTIONAL subtest ⇒ full score in test category ",
  "faqs_report_test_title": "Icons per test category",
  "faqs_report_test_warning": "Warning: failed at least one RECOMMENDED subtest ⇒ full score in test category ",
  "faqs_report_title": "Explanation of test report",
  "faqs_rpki_title": "Authorisation for routing (RPKI)",
  "faqs_starttls_title": "Secure email transport (STARTTLS and DANE)",
  "faqs_title": "Knowledge base",
  "halloffame_champions_menu": "Champions!",
  "halloffame_champions_subtitle": "100% in website <em>and</em> email test",
  "halloffame_champions_text": "The {{count}} domains below score 100% in both the website test and the email test. Inductees of this Hall of Fame are allowed to <a href=\"/faqs/badges/\">use both 100% badges</a>.",
  "halloffame_champions_title": "Hall of Fame - Champions!",
  "halloffame_mail_badge": "Badge with text: 100% score in email test",
  "halloffame_mail_menu": "Email",
  "halloffame_mail_subtitle": "100% in email test",
  "halloffame_mail_text": "The {{count}} domains below score 100% in the email test. Inductees of this Hall of Fame are allowed to <a href=\"/faqs/badges/\">use the 100% mail badge</a>.",
  "halloffame_mail_title": "Hall of Fame - Email",
  "halloffame_web_badge": "Badge with text: 100% score in website test",
  "halloffame_web_menu": "Websites",
  "halloffame_web_subtitle": "100% in website test",
  "halloffame_web_text": "The {{count}} domains below score 100% in the website test. Inductees of this Hall of Fame are allowed to <a href=\"/faqs/badges/\">use the 100% website badge</a>.",
  "halloffame_web_title": "Hall of Fame - Websites",
  "home_pagetitle": "Test for modern Internet Standards like IPv6, DNSSEC, HTTPS, DMARC, STARTTLS and DANE.",
  "home_stats_connection": "unique connections",
  "home_stats_connection_items": "",
  "home_stats_header": "Tests in numbers",
  "home_stats_mail": "unique mail domains",
  "home_stats_mail_items": "",
  "home_stats_notpassed": "0-99%:",
  "home_stats_passed": "100%:",
  "home_stats_website": "unique web domains",
  "home_stats_website_items": "",
  "home_teaser": "Modern Internet Standards provide for more reliability and further growth of the Internet. <br />Are you using them?",
  "mail_pagetitle": "Email test:",
  "mail_title": "Email test: {{prettyaddr}}",
  "mail_tweetmessage": "The%20mail%20server%20at%20{{report.domain}}%20scores%20{{score}}%25%20in%20the%20email%20test%20of%20%40Internet_nl%3A",
  "page_gotocontents": "Go to the content",
  "page_gotofooter": "Go to the footer",
  "page_gotomainmenu": "Go to the main menu",
  "page_metadescription": "Test for modern Internet Standards IPv6, DNSSEC, HTTPS, HSTS, DMARC, DKIM, SPF, STARTTLS, DANE, RPKI and security.txt",
  "page_metakeywords": "IPv6, DNSSEC, HTTPS, HSTS, TLS, DMARC, DKIM, SPF, STARTTLS, DANE, RPKI, security.txt, CSP, Content Security Policy, security headers, test, test tool, check, validation, Internet, Internet Standards, open standards, modern standards, security, internet security, mail, email security, website, website security, internet connection, secure connection, email authentication, encryption, ciphers, cipher suites, PKI, SSL certificate, TLS certificate, website certificate, Internet Standards Platform",
  "page_sitedescription": "Is your Internet up-to-date?",
  "page_sitetitle": "Internet.nl",
  "page404_title": "Page not found!",
  "probes_auto_redirect": "You will be automatically redirected to the results page when all tests are finished.",
  "probes_no_javascript": "Check if the test results are available. If not, you will be redirected here instead.",
  "probes_no_javascript_connection": "JavaScript inactive. Please enable JavaScript in order to execute the test.",
  "probes_no_redirection": "Test error. Please try again later, or test another domain name.",
  "probes_test_finished": "Test finished! Results available...",
  "probes_test_running": "Running...",
  "probes_tests_description": "The items below are being tested.",
  "probes_tests_duration": "The duration of the test is between 5 and {{cache_ttl}} seconds.",
  "results_dated_presentation": "Dated result presentation. Please rerun the test.",
  "results_domain_appsecpriv_http_headers_label": "HTTP security headers",
  "results_domain_appsecpriv_other_options_label": "Other security options",
  "results_domain_ipv6_web_server_label": "Web server",
  "results_domain_rpki_web_server_label": "Web server",
  "results_domain_tls_http_headers_label": "HTTP headers",
  "results_domain_tls_https_label": "HTTP",
  "results_domain_tls_tls_label": "TLS",
  "results_domain_mail_ipv6_name_servers_label": "Name servers of domain",
  "results_domain_mail_rpki_name_servers_label": "Name servers of domain",
  "results_domain_mail_tls_certificate_label": "Certificate",
  "results_domain_mail_tls_dane_label": "DANE",
  "results_empty_argument_alt_text": "None",
  "results_explanation_label": "Test explanation:",
  "results_further_testing_connection_label": "Further connection testing",
  "results_further_testing_mail_label": "Further email testing",
  "results_further_testing_web_label": "Further website testing",
  "results_mail_auth_dkim_label": "DKIM",
  "results_mail_auth_dmarc_label": "DMARC",
  "results_mail_auth_spf_label": "SPF",
  "results_mail_dnssec_domain_label": "Email address domain",
  "results_mail_dnssec_mail_servers_label": "Mail server domain(s)",
  "results_mail_ipv6_mail_servers_label": "Mail server(s)",
  "results_mail_rpki_mail_servers_label": "Mail server(s)",
  "results_mail_rpki_mx_name_servers_label": "Name servers of mail server(s)",
  "results_mail_tls_starttls_label": "TLS",
  "results_no_icon_detail_close": "close",
  "results_no_icon_detail_open": "open",
  "results_no_icon_status_error": "Error",
  "results_no_icon_status_failed": "Failed",
  "results_no_icon_status_info": "Information",
  "results_no_icon_status_not_tested": "Not testable",
  "results_no_icon_status_passed": "Passed",
  "results_no_icon_status_warning": "Recommendation",
  "results_panel_button_hide": "Hide details",
  "results_panel_button_show": "Show details",
  "results_perfect_score": "Congratulations, your domain will be added to the <strong>Hall of Fame</strong> soon!",
  "results_permalink": "Permalink test result {{permadate|date:'(Y-m-d H:i T)'}}",
  "results_rerun_test": "Rerun the test",
  "results_retest_time": "Seconds until retest option:",
  "results_score_description": "The domain {{prettyaddr}} has a test score of {{score}}%.",
  "results_tech_details_label": "Technical details:",
  "results_test_direct": "Directly test:",
  "results_test_email_label": "Test another email",
  "results_test_website_label": "Test another website",
  "results_test_info": "Explanation of test report",
  "results_verdict_label": "Verdict:",
  "test_connipv6_failed_description": "Too bad! Your internet provider has <em>not</em> given you a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>), or has not configured everything correctly. Therefore you are <em>not</em> able to reach other computers with modern addresses. Please ask your internet provider for full IPv6 connectivity.",
  "test_connipv6_failed_summary": "Modern addresses <em>not</em> reachable (IPv6)",
  "test_connipv6_info_description": "Too bad! Your internet provider has <em>not</em> given you a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>), or has not configured everything correctly. Therefore you are <em>not</em> able to reach other computers with modern addresses. Please ask your internet provider for full IPv6 connectivity.",
  "test_connipv6_info_summary": "Modern addresses <em>not</em> reachable (IPv6)",
  "test_connipv6_label": "Modern addresses reachable (IPv6)",
  "test_connipv6_passed_description": "Well done! Your internet provider has provided you with a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>). Therefore you can reach other computers with modern addresses.",
  "test_connipv6_passed_summary": "Modern addresses reachable (IPv6)",
  "test_connipv6_title": "Modern addresses reachable?",
  "test_connipv6_warning_description": "Too bad! Your internet provider has <em>not</em> given you a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>), or has not configured everything correctly. Therefore you are <em>not</em> able to reach other computers with modern addresses. Please ask your internet provider for full IPv6 connectivity.",
  "test_connipv6_warning_summary": "Modern addresses <em>not</em> reachable (IPv6)",
  "test_connresolver_failed_description": "Too bad! Domain signatures (<a href=\"/faqs/dnssec/\">DNSSEC</a>) are <em>not</em> validated for you. Therefore you are <em>not</em> protected against manipulated translation from signed domains into rogue IP addresses. Please ask your internet provider for DNSSEC validation and/or enable it on your own systems.",
  "test_connresolver_failed_summary": "Domain signatures <em>not</em> validated (DNSSEC)",
  "test_connresolver_info_description": "Too bad! Domain signatures (<a href=\"/faqs/dnssec/\">DNSSEC</a>) are <em>not</em> validated for you. Therefore you are <em>not</em> protected against manipulated translation from signed domains into rogue IP addresses. Please ask your internet provider for DNSSEC validation and/or enable it on your own systems.",
  "test_connresolver_info_summary": "Domain signatures <em>not</em> validated (DNSSEC)",
  "test_connresolver_label": "Domain signature validation (DNSSEC)",
  "test_connresolver_passed_description": "Well done! Domain signatures (<a href=\"/faqs/dnssec/\">DNSSEC</a>) are validated for you. Therefore you are protected against false translation from signed domain names into rogue IP addresses.",
  "test_connresolver_passed_summary": "Domain signatures validated (DNSSEC)",
  "test_connresolver_title": "Domain signatures validated?",
  "test_connresolver_warning_description": "Too bad! Domain signatures (<a href=\"/faqs/dnssec/\">DNSSEC</a>) are <em>not</em> validated for you. Therefore you are <em>not</em> protected against manipulated translation from signed domains into rogue IP addresses. Please ask your internet provider for DNSSEC validation and/or enable it on your own systems.",
  "test_connresolver_warning_summary": "Domain signatures <em>not</em> validated (DNSSEC)",
  "test_error_summary": "<em>Error</em> during test execution!",
  "test_mailauth_failed_description": "Too bad! Your domain does <em>not</em> contain all authenticity marks against email forgery (<a href=\"/faqs/mailauth/\">DMARC, DKIM and SPF</a>). Therefore receivers are <em>not</em> able to reliably separate phishing and spam emails abusing your domain in their sender address from your authentic emails. You should ask your mail provider to activate DMARC, DKIM and SPF.",
  "test_mailauth_failed_summary": "<em>Not</em> all authenticity marks against email phishing (DMARC, DKIM and SPF)",
  "test_mailauth_info_description": "Too bad! Your domain does <em>not</em> contain all authenticity marks against email forgery (<a href=\"/faqs/mailauth/\">DMARC, DKIM and SPF</a>). Therefore receivers are <em>not</em> able to reliably separate phishing and spam emails abusing your domain in their sender address from your authentic emails. You should ask your mail provider to activate DMARC, DKIM and SPF.",
  "test_mailauth_info_summary": "<em>Not</em> all authenticity marks against email phishing (DMARC, DKIM and SPF)",
  "test_mailauth_label": "Authenticity marks against phishing (DMARC, DKIM and SPF)",
  "test_mailauth_passed_description": "Well done! Your domain contains all authenticity marks against email forgery (<a href=\"/faqs/mailauth/\">DMARC, DKIM and SPF</a>). Therefore receivers are able to reliably separate phishing and spam emails abusing your domain in their sender address, from your authentic emails. ",
  "test_mailauth_passed_summary": "Authenticity marks against email phishing (DMARC, DKIM and SPF)",
  "test_mailauth_title": "Authenticity marks against email phishing?",
  "test_mailauth_warning_description": "Too bad! Your domain does <em>not</em> contain all authenticity marks against email forgery (<a href=\"/faqs/mailauth/\">DMARC, DKIM and SPF</a>). Therefore receivers are <em>not</em> able to reliably separate phishing and spam emails abusing your domain in their sender address from your authentic emails. You should ask your mail provider to activate DMARC, DKIM and SPF.",
  "test_mailauth_warning_summary": "<em>Not</em> all authenticity marks against email phishing (DMARC, DKIM and SPF)",
  "test_maildnssec_failed_description": "Too bad! Some or all of your email address and mail server domains are not signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore senders with enabled domain signature validation, are not able to reliably query the IP address of your receiving mail server(s). An attacker could secretly manipulate the IP address and divert e-mails addressed to you to his/her own mail server. You should ask your name server operator and/or your mail provider to enable DNSSEC.",
  "test_maildnssec_failed_summary": "<em>Not</em> all domain names signed (DNSSEC)",
  "test_maildnssec_info_description": "Too bad! Some or all of your email address and mail server domains are not signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore senders with enabled domain signature validation, are not able to reliably query the IP address of your receiving mail server(s). An attacker could secretly manipulate the IP address and divert e-mails addressed to you to his/her own mail server. You should ask your name server operator and/or your mail provider to enable DNSSEC.",
  "test_maildnssec_info_summary": "<em>Not</em> all domain names signed (DNSSEC)",
  "test_maildnssec_label": "Signed domain names (DNSSEC)",
  "test_maildnssec_passed_description": "Well done! Your email address domain and your mail server domain(s) are signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore senders with enabled domain signature validation, are able to reliably query the IP address of your receiving mail server(s). ",
  "test_maildnssec_passed_summary": "All domain names signed (DNSSEC)",
  "test_maildnssec_title": "Domain names signed?",
  "test_maildnssec_warning_description": "Too bad! Some or all of your email address and mail server domains are not signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore senders with enabled domain signature validation, are not able to reliably query the IP address of your receiving mail server(s). An attacker could secretly manipulate the IP address and divert e-mails addressed to you to his/her own mail server. You should ask your name server operator and/or your mail provider to enable DNSSEC.",
  "test_maildnssec_warning_summary": "<em>Not</em> all domain names signed (DNSSEC)",
  "test_mailipv6_failed_description": "Too bad! Your mail server can not be reached by senders using modern addresses (<a href=\"/faqs/ipv6/\">IPv6</a>), or improvement is possible. Therefore your mail server is not part of the modern Internet yet. You should ask your email provider to fully enable IPv6.",
  "test_mailipv6_failed_summary": "<em>Not</em> reachable via modern internet address, or improvement possible (IPv6)",
  "test_mailipv6_info_description": "Too bad! Your mail server can not be reached by senders using modern addresses (<a href=\"/faqs/ipv6/\">IPv6</a>), or improvement is possible. Therefore your mail server is not part of the modern Internet yet. You should ask your email provider to fully enable IPv6.",
  "test_mailipv6_info_summary": "<em>Not</em> reachable via modern internet address, or improvement possible (IPv6)",
  "test_mailipv6_label": "Modern address (IPv6)",
  "test_mailipv6_passed_description": "Well done! Your mail server can be reached by senders using modern<br />addresses (<a href=\"/faqs/ipv6/\">IPv6</a>), making it fully part of the modern Internet.",
  "test_mailipv6_passed_summary": "Reachable via modern internet address (IPv6)",
  "test_mailipv6_title": "Reachable via modern internet address?",
  "test_mailipv6_warning_description": "Too bad! Your mail server can not be reached by senders using modern addresses (<a href=\"/faqs/ipv6/\">IPv6</a>), or improvement is possible. Therefore your mail server is not part of the modern Internet yet. You should ask your email provider to fully enable IPv6.",
  "test_mailipv6_warning_summary": "<em>Not</em> reachable via modern internet address, or improvement possible (IPv6)",
  "test_mailrpki_error_description": "Test not ready to run yet. Please try again later. Sorry for the inconvenience.",
  "test_mailrpki_error_summary": "Test not ready to run (RPKI)",
  "test_mailrpki_failed_description": "Too bad! At least one of the IP addresses of your receiving mail server(s) and associated name servers has a route announcement that is <em>not</em>  matched by the published route authorisation (<a href=\"/faqs/rpki/\">RPKI</a>). This indicates an unintentional or malicious route configuration error, that can be caused by your mail hoster or your name server hoster (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your mail hoster or name server hoster as soon as possible. In the case of an internal error, they should ask their network provider that owns your server's IP addresses to fix the route configuration error.",
  "test_mailrpki_failed_summary": "<em>Unauthorised</em> route announcement (RPKI)",
  "test_mailrpki_info_description": "Informational: Your domain does <em>not</em> contain any name servers and thus contains no receiving mail server(s). There are no routable IP addresses that could be tested (<a href=\"/faqs/rpki/\">RPKI</a>).",
  "test_mailrpki_info_summary": "<em>No</em> routable IP addresses found (RPKI)",
  "test_mailrpki_label": "Route authorisation (RPKI)",
  "test_mailrpki_passed_description": "Well done! All IP addresses of your receiving mail server(s) and associated name servers have a route announcement that is matched by the published route authorisation (<a href=\"/faqs/rpki/\">RPKI</a>). As a result, email transport between sending mail servers with enabled route validation and your receiving mail server(s) is better protected against various unintentional or malicious route configuration errors, that can lead to the unreachability of your servers or the interception of Internet traffic to your servers.",
  "test_mailrpki_passed_summary": "Authorised route announcement (RPKI)",
  "test_mailrpki_title": "Route authorisation?",
  "test_mailrpki_warning_description": "Too bad! At least one of the IP addresses of your receiving mail server(s) and associated name servers has a route announcement for which <em>no</em> route authorisation is published (<a href=\"/faqs/rpki/\">RPKI</a>). As a result, email transport between sending mail servers with enabled route validation and your receiving mail server(s) is <em>not</em> (fully) protected against various unintentional or malicious route configuration errors, that can lead to the unreachability of your servers or the interception of Internet traffic to your servers. Contact your mail hoster or name server hoster about this. They can ask their network provider that owns your server's IP addresses to publish routing authorizations.",
  "test_mailrpki_warning_summary": "Route authorisation <em>not</em> published (RPKI)",
  "test_mailtls_failed_description": "Too bad! Sending mail servers that support secure email transport (<a href=\"/faqs/starttls/\">STARTTLS and DANE</a>) can establish <em>no</em> or an <em>insufficiently</em> secure connection with your receiving mail server(s). Passive and/or active attackers will therefore be able to read emails in transit to you. You should ask your mail provider to enable STARTTLS and DANE, and configure it securely.",
  "test_mailtls_failed_summary": "Mail server connection <em>not</em> or insufficiently secured (STARTTLS and DANE)",
  "test_mailtls_info_description": "Too bad! Sending mail servers that support secure email transport (<a href=\"/faqs/starttls/\">STARTTLS and DANE</a>) can establish <em>no</em> or an <em>insufficiently</em> secure connection with your receiving mail server(s). Passive and/or active attackers will therefore be able to read emails in transit to you. You should ask your mail provider to enable STARTTLS and DANE, and configure it securely.",
  "test_mailtls_info_summary": "Mail server connection <em>not</em> or insufficiently secured (STARTTLS and DANE)",
  "test_mailtls_invalid_null_mx_description": "Warning: Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, either your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary. Or on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting. ",
  "test_mailtls_invalid_null_mx_summary": "Inconsistently configured non-receiving mail domain (STARTTLS and DANE)",
  "test_mailtls_label": "Secure mail server connection (STARTTLS and DANE)",
  "test_mailtls_no_mx_description": "Informational: The SPF record on your domain indicates that your domain may be used for sending mail. However, your domain does not have a receiving mail server (MX), which could hinder deliverability of your sent mails because not having an MX may be seen by receivers as an indicator for spam. Therefore if you really want to send mail from this domain, configure an MX. However, if you do not want to send mail from this domain, configure an SPF record with the <code>-all</code> term only and besides a \"Null MX\" record if your domain has A/AAAA records. Because of your configuration, the subtests in the STARTTLS and DANE category and the mail server specific subtests in the IPv6 and DNSSEC categories are not applicable.",
  "test_mailtls_no_mx_summary": "Properly configured non-receiving mail domain (STARTTLS and DANE)",
  "test_mailtls_no_null_mx_description": "Informational: No receiving mail servers (MX) are set on your domain that has A/AAAA records and has an SPF record with only the term <code>-all</code>. We recommend you to set a \"Null MX\" record to explicitly indicate that your domain does not accept email. Because of your configuration, the subtests in the STARTTLS and DANE category and the mail server specific subtests in the IPv6 and DNSSEC categories are not applicable.",
  "test_mailtls_no_null_mx_summary": "Not explicitly configured non-receiving mail domain (STARTTLS and DANE)",
  "test_mailtls_null_mx_description": "Informational: Your domain that has A/AAAA records, clearly indicates that it does not accept email by advertising a \"Null MX\" record. This is fine if you do not want to receive email. Your configuration makes the subtests in the STARTTLS and DANE category not applicable. This also goes for the mail server specific subtests in the categories for IPv6 and DNSSEC.",
  "test_mailtls_null_mx_summary": "Properly configured non-receiving mail domain (STARTTLS and DANE)",
  "test_mailtls_null_mx_with_other_mx_description": "Warning: Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, on your domain a receiving mail server is set by another MX record, making the \"Null MX\" conflicting. ",
  "test_mailtls_null_mx_with_other_mx_summary": "Inconsistently configured non-receiving mail domain (STARTTLS and DANE)",
  "test_mailtls_null_mx_without_a_aaaa_description": "Warning: Your domain advertises a \"Null MX\" record indicating that it does not accept email. However, your domain does not have A/AAAA records, making the \"Null MX\" record unnecessary.",
  "test_mailtls_null_mx_without_a_aaaa_summary": "Properly configured non-receiving mail domain, though with unnecessary record (STARTTLS and DANE)",
  "test_mailtls_passed_description": "Well done! Sending mail servers supporting secure email transport (<a href=\"/faqs/starttls/\">STARTTLS and DANE</a>) can establish a secure connection with your receiving mail server(s). STARTTLS prevents passive attackers from reading emails in transit to you. DANE protects against active attackers stripping STARTTLS encryption by manipulating the mail traffic.",
  "test_mailtls_passed_summary": "Mail server connection sufficiently secured (STARTTLS and DANE)",
  "test_mailtls_title": "Secure mail server connection?",
  "test_mailtls_unreachable_description": "Test error: at least one of your receiving mail servers was not reachable for us, making it impossible to (fully) test for STARTTLS and DANE. This could be caused by network connectivity problems or by the mail server(s) not accepting connections.",
  "test_mailtls_unreachable_summary": "Unreachable receiving mail server (STARTTLS and DANE)",
  "test_mailtls_untestable_description": "Test error: at least one of your receiving mail servers was not testable for us,  making it impossible to (fully) test for STARTTLS and DANE. This could be caused by, among other things, SMTP errors and rate limiting measures engaging and dropping connections.",
  "test_mailtls_untestable_summary": "Untestable mail server (STARTTLS and DANE)",
  "test_mailtls_warning_description": "Too bad! Sending mail servers that support secure email transport (<a href=\"/faqs/starttls/\">STARTTLS and DANE</a>) can establish <em>no</em> or an <em>insufficiently</em> secure connection with your receiving mail server(s). Passive and/or active attackers will therefore be able to read emails in transit to you. You should ask your mail provider to enable STARTTLS and DANE, and configure it securely.",
  "test_mailtls_warning_summary": "Mail server connection <em>not</em> or insufficiently secured (STARTTLS and DANE)",
  "test_siteappsecpriv_failed_description": "Too bad! <em>Not</em> all required security options, i.e. security headers and security.txt, are set for your website (<a href=\"/faqs/appsecpriv/\">Security options</a>). With security headers you can activate browser mechanisms to protect visitors against attacks involving, for example, cross-site scripting (XSS) or framing. Security headers are also relevant for domains with response codes such as '301 Redirect' and '404 Not Found', because they create their own browsing context (MIME type 'text/html') that may be vulnerable to certain attacks. Through a security.txt file you can provide researchers who have found a vulnerability on your systems, with your contact information and your Coordinated Vulnerability Disclosure policy. Note that HTTPS is a prerequisite for all tested security options.",
  "test_siteappsecpriv_failed_summary": "One or more required security options <em>not</em> set (Security options)",
  "test_siteappsecpriv_info_description": "Informational: <em>Not</em> all optional security options, i.e. security headers and security.txt, are set for your website (<a href=\"/faqs/appsecpriv/\">Security options</a>). With security headers you can activate browser mechanisms to protect visitors against attacks involving, for example, cross-site scripting (XSS) or framing. Security headers are also relevant for domains with HTTP response codes such as '301 Redirect' and '404 Not Found', because they create their own browsing context (MIME type 'text/html') that may be vulnerable to certain attacks. Through a security.txt file you can provide researchers who have found a vulnerability on your systems, with your contact information and your Coordinated Vulnerability Disclosure policy. Note that HTTPS is a prerequisite for all tested security options.",
  "test_siteappsecpriv_info_summary": "One or more optional security options <em>not</em> set (Security options)",
  "test_siteappsecpriv_label": "Security options",
  "test_siteappsecpriv_passed_description": "Well done! All security options, i.e. security headers and security.txt, are set for your website (<a href=\"/faqs/appsecpriv/\">Security options</a>). With security headers you can activate browser mechanisms to protect visitors against attacks involving, for example, cross-site scripting (XSS) or framing. Security headers are also relevant for domains with HTTP response codes such as '301 Redirect' and '404 Not Found', because they create their own browsing context (MIME type 'text/html') that may be vulnerable to certain attacks. Through a security.txt file you can provide researchers who have found a vulnerability on your systems, with your contact information and your Coordinated Vulnerability Disclosure policy. Note that HTTPS is a prerequisite for all tested security options.",
  "test_siteappsecpriv_passed_summary": "All security options set (Security options) ",
  "test_siteappsecpriv_title": "Security options set?",
  "test_siteappsecpriv_warning_description": "Warning: <em>Not</em> all recommended security options, , i.e. security headers and security.txt, are set for your website (<a href=\"/faqs/appsecpriv/\">Security options</a>). With security headers you can activate browser mechanisms to protect visitors against attacks involving, for example, cross-site scripting (XSS) or framing. Security headers are also relevant for domains with HTTP response codes such as '301 Redirect' and '404 Not Found', because they create their own browsing context (MIME type 'text/html') that may be vulnerable to certain attacks. Through a security.txt file you can provide researchers who have found a vulnerability on your systems, with your contact information and your Coordinated Vulnerability Disclosure policy. Note that HTTPS is a prerequisite for all tested security options. ",
  "test_siteappsecpriv_warning_summary": "One or more recommended security options <em>not</em> set (Security options)",
  "test_sitednssec_failed_description": "Too bad! Your domain is <em>not</em> signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore visitors with enabled domain signature validation, are <em>not</em> protected against manipulated translation from your domain into rogue internet addresses. You should ask your name server operator (often your registrar and/or hosting provider) to enable DNSSEC.",
  "test_sitednssec_failed_summary": "Domain name <em>not</em> signed (DNSSEC)",
  "test_sitednssec_info_description": "Too bad! Your domain is <em>not</em> signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore visitors with enabled domain signature validation, are <em>not</em> protected against manipulated translation from your domain into rogue internet addresses. You should ask your name server operator (often your registrar and/or hosting provider) to enable DNSSEC.",
  "test_sitednssec_info_summary": "Domain name <em>not</em> signed (DNSSEC)",
  "test_sitednssec_label": "Signed domain name (DNSSEC)",
  "test_sitednssec_passed_description": "Well done! Your domain is signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore visitors with enabled domain signature validation, are protected against manipulated translation from your domain into rogue internet addresses.",
  "test_sitednssec_passed_summary": "Domain name signed (DNSSEC)",
  "test_sitednssec_title": "Domain name signed?",
  "test_sitednssec_warning_description": "Too bad! Your domain is <em>not</em> signed with a valid signature (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Therefore visitors with enabled domain signature validation, are <em>not</em> protected against manipulated translation from your domain into rogue internet addresses. You should ask your name server operator (often your registrar and/or hosting provider) to enable DNSSEC.",
  "test_sitednssec_warning_summary": "Domain name <em>not</em> signed (DNSSEC)",
  "test_siteipv6_failed_description": "Too bad! Your website is <em>not</em> reachable for visitors using a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>), or improvement is possible. Therefore your website is not part of the modern Internet yet. You should ask your hosting provider to fully enable IPv6.",
  "test_siteipv6_failed_summary": "<em>Not</em> reachable via modern internet address, or improvement possible (IPv6)",
  "test_siteipv6_info_description": "Too bad! Your website is <em>not</em> reachable for visitors using a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>), or improvement is possible. Therefore your website is not part of the modern Internet yet. You should ask your hosting provider to fully enable IPv6.",
  "test_siteipv6_info_summary": "<em>Not</em> reachable via modern internet address, or improvement possible (IPv6)",
  "test_siteipv6_label": "Modern address (IPv6)",
  "test_siteipv6_passed_description": "Well done! Your website is reachable for visitors using a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>), making it fully part of the modern Internet.",
  "test_siteipv6_passed_summary": "Reachable via modern internet address (IPv6)",
  "test_siteipv6_title": "Reachable via modern address?",
  "test_siteipv6_warning_description": "Too bad! Your website is <em>not</em> reachable for visitors using a modern internet address (<a href=\"/faqs/ipv6/\">IPv6</a>), or improvement is possible. Therefore your website is not part of the modern Internet yet. You should ask your hosting provider to fully enable IPv6.",
  "test_siteipv6_warning_summary": "<em>Not</em> reachable via modern internet address, or improvement possible (IPv6)",
  "test_siterpki_error_description": "Test not ready to run yet. Please try again later. Sorry for the inconvenience.",
  "test_siterpki_error_summary": "Test not ready to run (RPKI)",
  "test_siterpki_failed_description": "Too bad! At least one of the IP addresses of your web server and associated name servers has a route announcement that is <em>not</em>  matched by the published route authorisation (<a href=\"/faqs/rpki/\">RPKI</a>). This indicates an unintentional or malicious route configuration error, that can be caused by your web hoster or your name server hoster (internal error) or by a third party (external error). In either case, it increases the risk for unreachability of your server or for interception of Internet traffic to your server. Contact your web hoster or name server hoster as soon as possible. In the case of an internal error, they should ask their network provider that owns your server's IP addresses to fix the route configuration error.",
  "test_siterpki_failed_summary": "<em>Unauthorised</em> route announcement (RPKI)",
  "test_siterpki_info_description": "Informational: Your domain does <em>not</em> contain any name servers and thus contains no web server IP addresses. There are no routable IP addresses that could be tested (<a href=\"/faqs/rpki/\">RPKI</a>).",
  "test_siterpki_info_summary": "<em>No</em> routable IP addresses found (RPKI)",
  "test_siterpki_label": "Route authorisation (RPKI)",
  "test_siterpki_passed_description": "Well done! All IP addresses of your web server and associated name servers have a route announcement that is matched by the published route authorisation (<a href=\"/faqs/rpki/\">RPKI</a>). As a result, visitors with enabled route validation are better protected against various unintentional or malicious route configuration errors, that can lead to the unreachability of your servers or the interception of Internet traffic to your servers.",
  "test_siterpki_passed_summary": "Authorised route announcement (RPKI)",
  "test_siterpki_title": "Route authorisation?",
  "test_siterpki_warning_description": "Too bad! At least one of the IP addresses of your web server and associated name servers has a route announcement for which <em>no</em> route authorisation is published (<a href=\"/faqs/rpki/\">RPKI</a>). As a result, visitors with enabled route validation are <em>not</em> (fully) protected against various unintentional or malicious route configuration errors, that can lead to the unreachability of your servers or the interception of Internet traffic to your servers. Contact your mail hoster or name server hoster about this. They can ask their network provider that owns your server's IP addresses to publish routing authorizations.",
  "test_siterpki_warning_summary": "Route authorisation <em>not</em> published (RPKI)",
  "test_sitetls_failed_description": "Too bad! The connection with your website is <em>not</em> or <em>insufficiently</em>secured (<a href=\"/faqs/https/\">HTTPS</a>). Therefore information in transit between your website and its visitors is <em>not</em> sufficiently protected against eavesdropping and tampering. You should ask your hosting provider to enable HTTPS and to configure it securely.",
  "test_sitetls_failed_summary": "Connection <em>not</em> or insufficiently secured (HTTPS)",
  "test_sitetls_info_description": "Too bad! The connection with your website is <em>not</em> or <em>insufficiently</em>secured (<a href=\"/faqs/https/\">HTTPS</a>). Therefore information in transit between your website and its visitors is <em>not</em> sufficiently protected against eavesdropping and tampering. You should ask your hosting provider to enable HTTPS and to configure it securely.",
  "test_sitetls_info_summary": "Connection <em>not</em> or insufficiently secured (HTTPS)",
  "test_sitetls_label": "Secure connection (HTTPS)",
  "test_sitetls_passed_description": "Well done! The connection with your website is sufficiently secured (<a href=\"/faqs/https/\">HTTPS</a>). Therefore information in transit between your website and its visitors is protected against eavesdropping and tampering.",
  "test_sitetls_passed_summary": "Connection sufficiently secured (HTTPS)",
  "test_sitetls_title": "Secure connection?",
  "test_sitetls_unreachable_description": "Your web server was not reachable for us, making it impossible to (fully) test for HTTPS. This could be caused by network connectivity problems or by the web server not accepting connections.",
  "test_sitetls_unreachable_summary": "Unreachable web server (HTTPS)",
  "test_sitetls_warning_description": "Too bad! The connection with your website is <em>not</em> or <em>insufficiently</em>secured (<a href=\"/faqs/https/\">HTTPS</a>). Therefore information in transit between your website and its visitors is <em>not</em> sufficiently protected against eavesdropping and tampering. You should ask your hosting provider to enable HTTPS and to configure it securely.",
  "test_sitetls_warning_summary": "Connection <em>not</em> or insufficiently secured (HTTPS)",
  "widget_content_notes": "<h2>Notes</h2><ul><li>Logo: We recommend you to save and use our <a href=\"/static/logo_en.svg\">logo</a> on your own web server. In that way there will not be any contact with our web server when your website is visited.</li><li>Content-Security-Policy (CSP): In case you are using a CSP policy for your website you would also need to add <code>internet.nl</code> to the rules for <code>form-action</code> and possibly also for <code>img-src</code> in case you link to the logo on our web server.</li></ul>",
  "widget_mail_html_block": "<strong>Test your email</strong>",
  "widget_mail_intro": "<h1>Email test widget</h1><p>Would you like visitors of your website to be able to directly start an email test?<br />Copy the HTML and CSS code from the text fields below into the source code of your website.</p>",
  "widget_site_html_block": "<strong>Test your website</strong>",
  "widget_site_intro": "<h1>Website test widget</h1><p>Would you like visitors of your website to be able to directly start a website test?<br />Copy the HTML and CSS code from the text fields below into the source code of your website.</p>"
}