{
  "about_contact": "<h2>Contact</h2><p>Platform Internetstandaarden<br />p/a ECP<br />Maanweg 174 (8e verdieping)<br />2516 AB Den Haag  </p><p>KvK-nummer: 27169301 </p><h3>E-mail</h3><p><a href=\"mailto:vraag@internet.nl\">vraag@internet.nl</a>  </p><p><a href=\"/static/question@internet.nl_0x45028563.asc\">PGP publieke sleutel</a><br />Vingerafdruk: ACB7 8829 4C7E 12BA E922 8C60 D894 E15F 4502 8563<br />Vervaldatum: 19 maart 2025</p>",
  "base_about": "Over Internet.nl",
  "base_accessibility": "Toegankelijkheid",
  "base_blogs": "Blogs",
  "base_contact": "Contact",
  "base_copyright": "Auteursrecht",
  "base_disclosure": "Kwetsbaarheid melden",
  "base_faqs": "Kennisbank",
  "base_halloffame": "Hall of Fame",
  "base_halloffame_champions": "Hall of Fame - Kampioenen!",
  "base_halloffame_lead": "{{count}} domeinen met 2 x 100%<br />Laatste toevoeging: {{latest|date:'d-m-Y'}}",
  "base_halloffame_link": "Naar Hall of Fame - Kampioenen!",
  "base_halloffame_mail": "Hall of Fame - E-mail",
  "base_halloffame_web": "Hall of Fame - Websites",
  "base_home": "Home",
  "base_info": "Internet.nl is een initiatief van de internetgemeenschap en de Nederlandse overheid.",
  "base_news": "Nieuws",
  "base_newslink": "Naar nieuwsoverzicht",
  "base_privacy": "Privacyverklaring",
  "base_test_connection_explain": "<h2>Wat wordt getest?</h2><p>Nadat je de verbindingstest hebt gestart, testen we of de momenteel door jou gebruikte internetverbinding ondersteuning biedt voor de onderstaande moderne Internetstandaarden.</p><ul><li><a href=\"/faqs/ipv6/\">IPv6</a>: zijn websites met moderne internetadressen voor jou bereikbaar?</li><li><a href=\"/faqs/dnssec/\">DNSSEC</a>: worden domeinnaam-handtekeningen voor jou gecontroleerd?</li></ul><h2>Testrapport?</h2><p>Nadat de test is afgerond, wordt een testrapport getoond. Dit rapport bevat een procentuele totaalscore en resultaten per testonderdeel en subtest. Voor meer informatie zie <a href=\"/faqs/report/\">\"Toelichting op testrapport\"</a>.</p><h2>Hoe verbeteren?</h2><p>Het testrapport kan je gebruiken om je internetverbinding te verbeteren. Meestal kan je hiervoor het beste contact opnemen met je internetprovider. In de communicatie met je internetprovider kan je de permalink (oftewel de URL) van het testrapport gebruiken.</p><h2>Test je verbinding</h2>",
  "base_test_connection_label": "Test je verbinding",
  "base_test_connection_text": "Moderne adressen bereikbaar? <br />Domein-handtekeningen gecontroleerd?",
  "base_test_connection_title": "Over de verbindingstest",
  "base_test_explain": "Over de test",
  "base_test_mail_explain": "<h2>Wat wordt getest?</h2><p>Nadat je een e-mailadres hebt opgegeven, testen we of de achterliggende e-mailvoorziening ondersteuning biedt voor de onderstaande moderne Internetstandaarden.</p><ul><li><a href=\"/faqs/ipv6/\">IPv6</a>: bereikbaar via modern internetadres?</li><li><a href=\"/faqs/dnssec/\">DNSSEC</a>: domeinnamen ondertekend?</li><li><a href=\"/faqs/mailauth/\">DMARC, DKIM en SPF</a>: echtheidswaarmerken tegen e-mailphishing?</li><li><a href=\"/faqs/starttls/\">STARTTLS en DANE</a>: beveiligde mailserver-verbinding?</li><li><a href=\"/faqs/rpki/\">RPKI</a>: route-autorisatie?</li></ul><p>Let op: sommige standaarden zijn zelfs relevant als je je domeinnaam niet gebruikt voor het ontvangen en verzenden van e-mail.</p><h2>Testrapport?</h2><p>Nadat de test is afgerond, wordt een testrapport getoond. Dit rapport bevat een procentuele totaalscore en resultaten per testonderdeel en subtest. Voor meer informatie zie <a href=\"/faqs/report/\">\"Toelichting op testrapport\"</a>.  </p><h2>Hoe verbeteren?</h2><p>Het testrapport kan je gebruiken om je e-mailvoorziening te verbeteren. Meestal kan je hiervoor het beste contact opnemen met je e-mailprovider. In de communicatie met je e-mailprovider kan je de permalink (oftewel de URL) van het testrapport gebruiken.</p><h2>Widget</h2><p>Je kan de e-mailtest integreren in je eigen website door gebruik te maken van onze <a href=\"/widget-mail/\">widget code</a>.</p><h2>Test je e-mail</h2>",
  "base_test_mail_input": "Jouw e-mailadres:",
  "base_test_mail_label": "Test je e-mail",
  "base_test_mail_text": "Modern adres? Anti-phishing? Beveiligd transport? Route-autorisatie?",
  "base_test_mail_title": "Over de e-mailtest",
  "base_test_prechecks_invalid_domain": "<strong>De opgegeven domeinnaam is niet geldig!</strong><br />Toelichting: Een A- en/of AAAA-record is noodzakelijk voor de websitetest, en een SOA-record voor de e-mailtest.",
  "base_test_start": "Start test",
  "base_test_website_explain": "<h2>Wat wordt getest?</h2><p>Nadat je een domeinnaam van een website heb opgegeven, testen we of de website ondersteuning biedt voor de onderstaande moderne Internetstandaarden.</p><ul><li><a href=\"/faqs/ipv6/\">IPv6</a>: bereikbaar via modern internetadres?</li><li><a href=\"/faqs/dnssec/\">DNSSEC</a>: domeinnaam ondertekend?</li><li><a href=\"/faqs/https/\">HTTPS</a>: beveiligde verbinding?</li><li><a href=\"/faqs/appsecpriv/\">Beveiligingsopties</a>: beveiligingsopties ingesteld?</li><li><a href=\"/faqs/rpki/\">RPKI</a>: route-autorisatie?</li></ul><h2>Testrapport?</h2><p>Nadat de test is afgerond, wordt een testrapport getoond. Dit rapport bevat een procentuele totaalscore en resultaten per testonderdeel en subtest. Voor meer informatie zie <a href=\"/faqs/report/\">\"Toelichting op testrapport\"</a>. Als je website een score van 100% heeft, dan wordt deze opgenomen in de <a href=\"/halloffame/\">Hall of Fame</a>.</p><h2>Hoe verbeteren?</h2><p>Het testrapport kan je gebruiken om je website te verbeteren. Meestal kan je hiervoor het beste contact opnemen met je webhoster.In de communicatie met je webhoster kan je de permalink (oftewel de URL) van het testrapport gebruiken.</p><h2>Widget</h2><p>Je kan de websitetest integreren in je eigen website door gebruik te maken van onze <a href=\"/widget-site/\">widget code</a>.</p><h2>Test je website</h2>",
  "base_test_website_input": "Jouw website-domeinnaam:",
  "base_test_website_label": "Test je website",
  "base_test_website_text": "Modern adres? Beveiligde verbinding? Beveiligingsopties? Route-autorisatie?",
  "base_test_website_title": "Over de websitetest",
  "base_widget_mail": "E-mailtest widget",
  "base_widget_site": "Websitetest widget",
  "connection_pagetitle": "Verbindingstest",
  "connection_title": "Verbindingstest",
  "detail_conn_dnssec_validation_exp": "We testen of de door jou gebruikte resolvers de DNSSEC-handtekeningen van onze domeinnaam valideren. Resolvers worden normaal gesproken geleverd door je internetprovider. Als alternatief kun je resolvers van een andere DNS provider instellen. Je kan zelfs je eigen lokaal geïnstalleerde resolver gebruiken. Hoewel validatie plaatsvindt op de resolver, kan nog steeds door een aanvaller gerommeld worden met de communicatie tussen de resolver en jouw apparaat (ook wel 'last mile' genoemd). Het is daarom het meest veilig om zo dicht mogelijk op je apparaat te valideren (bijv. door een lokaal geïnstalleerde resolver te gebruiken), of zorg ervoor dat het kanaal tussen je resolver en je apparaat beveiligd c.q. vertrouwd is.",
  "detail_conn_dnssec_validation_label": "DNSSEC-validatie",
  "detail_conn_dnssec_validation_tech_table": "DNS-provider",
  "detail_conn_dnssec_validation_tech_table_dns_provider": "DNS-provider",
  "detail_conn_dnssec_validation_verdict_bad": "Je bent <em>niet</em> beschermd door validatie van DNSSEC-handtekeningen.",
  "detail_conn_dnssec_validation_verdict_good": "Je bent beschermd door validatie van DNSSEC-handtekeningen.",
  "detail_conn_ipv6_connection_exp": "We testen of jouw apparaat via zijn huidige internetverbinding in staat is om <em>direct</em> (d.w.z. zonder DNS-vertaling) verbinding te maken met onze webserver via ons bijbehorende IPv6-adres.</p><p>Sommige browser add-ons en routers bieden functionaliteit aan voor het filteren van domeinnamen om de privacy te verbeteren of internetgebruik te beperken. Om omzeiling te voorkomen blokkeert deze functionaliteit vaak ook het direct verbinden met IP-adressen waardoor deze subtest faalt.",
  "detail_conn_ipv6_connection_label": "IPv6-connectiviteit (direct)",
  "detail_conn_ipv6_connection_tech_table": "Geanonimiseerd IPv6-adres|Reverse name|Internetprovider",
  "detail_conn_ipv6_connection_tech_table_anonymized_ipv6_address": "Geanonimiseerd IPv6-adres",
  "detail_conn_ipv6_connection_tech_table_reverse_name": "Reverse name",
  "detail_conn_ipv6_connection_tech_table_internet_provider": "Internetprovider",
  "detail_conn_ipv6_connection_verdict_bad": "Je bent <em>niet</em> in staat om computers direct op hun IPv6-adres te bereiken.",
  "detail_conn_ipv6_connection_verdict_good": "Je bent in staat om computers direct op hun IPv6-adres te bereiken.",
  "detail_conn_ipv6_dns_conn_exp": "We testen of jouw apparaat middels zijn huidige internetverbinding in staat is om verbinding te maken met onze webserver via IPv6. Voor deze test bieden we een domeinnaam aan en we verwachten dat je resolver voor deze domeinnaam het bijbehorende IPv6-adres ophaalt.",
  "detail_conn_ipv6_dns_conn_label": "IPv6-connectiviteit (via DNS)",
  "detail_conn_ipv6_dns_conn_verdict_bad": "Je bent <em>niet</em> in staat om computers via DNS op hun IPv6-adres te bereiken.",
  "detail_conn_ipv6_dns_conn_verdict_good": "Je bent in staat om computers via DNS op hun IPv6-adres te bereiken.",
  "detail_conn_ipv6_ipv4_conn_exp": "We testen of jouw apparaat middels zijn huidige internetverbinding in staat is om verbinding te maken met onze webserver via IPv4. Voor deze test bieden we een domeinnaam aan en we verwachten dat je resolver voor deze domeinnaam het bijbehorende IPv4-adres ophaalt.</p><p><em>Niveau van vereistheid: Optioneel</em>",
  "detail_conn_ipv6_ipv4_conn_label": "IPv4-connectiviteit (via DNS)",
  "detail_conn_ipv6_ipv4_conn_tech_table": "Geanonimiseerd IPv4-adres|Reverse name|Internetprovider",
  "detail_conn_ipv6_ipv4_conn_tech_table_anonymized_ipv4_address": "Geanonimiseerd IPv4-adres",
  "detail_conn_ipv6_ipv4_conn_tech_table_reverse_name": "Reverse name",
  "detail_conn_ipv6_ipv4_conn_tech_table_internet_provider": "Internetprovider",
  "detail_conn_ipv6_ipv4_conn_verdict_bad": "Je bent <em>niet</em> in staat om computers via DNS op hun IPv4-adres te bereiken.",
  "detail_conn_ipv6_ipv4_conn_verdict_good": "Je bent in staat om computers via DNS op hun IPv4-adres te bereiken.",
  "detail_conn_ipv6_privacy_exp": "We testen of je apparaat 'IPv6 Privacy Extensions for SLAAC' (of een ander IPv6-configuratieproces dan SLAAC) gebruikt om het lekken van zijn mogelijk privacygevoelige MAC-adres naar computers waarmee het via IPv6 verbinding maakt te voorkomen.",
  "detail_conn_ipv6_privacy_label": "Privacy Extensions voor IPv6",
  "detail_conn_ipv6_privacy_verdict_bad": "Je gebruikt SLAAC <em>zonder</em> 'IPv6 Privacy Extensions'.",
  "detail_conn_ipv6_privacy_verdict_good": "Je hebt 'IPv6 Privacy Extensions' geactiveerd (of je gebruikt geen SLAAC).",
  "detail_conn_ipv6_resolver_conn_exp": "We testen of ten minste één van de door jou gebruikte DNS-resolvers in staat is om onze autoritatieve nameserver te bereiken via IPv6. Vaak levert je internetprovider de DNS-resolver(s).",
  "detail_conn_ipv6_resolver_conn_label": "IPv6-connectiviteit van DNS-resolver",
  "detail_conn_ipv6_resolver_conn_verdict_bad": "Je DNS-resolver kan <em>niet</em> nameservers via IPv6 bereiken.",
  "detail_conn_ipv6_resolver_conn_verdict_good": "Je DNS-resolver kan nameservers via IPv6 bereiken.",
  "detail_mail_auth_dkim_exp": "<p>We testen of je domeinnaam DKIM ondersteunt. Een ontvangende mailserver kande publieke sleutel in je DKIM-record gebruiken om de handtekening in eene-mail met een gebruiker van jouw domein als afzender te controleren en deauthenticiteit van de e-mail te bepalen.</p><ul><li>Om te slagen voor deze test verwachten we dat je nameserver <code>NOERROR</code> antwoordt op onze  bevragingvoor <code>_domainkey.example.nl</code>. Als <code>_domainkey.example.nl</code> een 'empty non-terminal' is, dan zullen sommige nameservers die zich niet houden aan destandaard <a href=\"https://www.rfc-editor.org/rfc/rfc2308\">RFC 2308</a>, foutief antwoorden met <code>NXDOMAIN</code> in plaats van<code>NOERROR</code>. Dit maakt het detecteren van het DKIM-record voor ons onmogelijk.</li><li>Op dit moment zijn we niet in staat om de publieke sleutel in je DKIM-record op te vragen en te beoordelen, omdat we daarvoor een e-mail van jouw domein zouden moeten ontvangen.</li><li>Bij deze test gaan we uit van 'strict alignment' hetgeen conform DMARC is. Het geteste domein wordt beschouwd als het verzenddomein in het mailbericht (<code>From:</code>) en moet gelijk zijn aan zowel het DKIM-domein (<code>d=</code>) als het SPF-domein (envelope sender, d.w.z. return-path dat terugkomt in <code>MAIL FROM</code>).</li></ul><p>Aanvullende opmerkingen:</p><ul><li>Sommige e-mailsystemen wijzigen e-mail tijdens het transport, waardoor een DKIM-handtekening mogelijk ongeldig wordt. In veel gevallen zijn deze wijzigingen onschuldig. Voorbeelden zijn het vervangen van witruimte en het herordenen van headervelden. Als u een DKIM-ondertekenende verzender bent, dan kunt u kiezen of u dit soort wijzigingen wel of niet tolereert, zowel voor de header als voor de body van e-mails. De <code>simple</code> instelling tolereert bijna geen wijzigingen en <code>relaxed</code> tolereert veel voorkomende wijzigingen. Als er geen instelling is opgegeven, wordt standaard <code>simple</code> gebruikt voor zowel de header als de body. Met name headerwijzigingen zijn een veelvoorkomende oorzaak dat een DKIM-handtekening onbedoeld ongeldig wordt, waardoor de bezorgbaarheid wordt belemmerd. Het gebruik van <code>relaxed</code> voor de header en <code>simple</code> voor de body (<code>c=relaxed/simple</code>) kan dit soort problemen verminderen.</li><li>Voor een \"good practice voor domeinnamen zonder mail\" zie de <a href=\"#control-panel-9\">uitleg van de \"DMARC-policy\" subtest</a>.</li></ul>",
  "detail_mail_auth_dkim_label": "DKIM aanwezigheid",
  "detail_mail_auth_dkim_verdict_bad": "Je domeinnaam ondersteunt <em>geen</em> DKIM-records.",
  "detail_mail_auth_dkim_verdict_good": "Je domeinnaam ondersteunt DKIM-records.",
  "detail_mail_auth_dkim_verdict_no_email": "Je domeinnaam ondersteunt <em>geen</em> DKIM-records. Echter omdat je DMARC- en SPF-records aangeven dat er geen mail vanaf je domein wordt verstuurd, is DKIM niet nodig en wordt deze subtest overgeslagen.",
  "detail_mail_auth_dmarc_exp": "We testen of DMARC beschikbaar is voor jouw domein. Een ontvangendemailserver kan de DMARC-policy gebruiken om te bepalen hoe om te gaan meteen e-mail met jouw domein als verzender waarvan de authenticatie met zowelDKIM als SPF faalt, en de ontvangende mailserver kan je e-mailadres uit het DMARC-recordgebruiken om je feedbackrapporten over het authenticatieresultaat te sturen. Het hebben van meer dan één DMARC-record op hetzelfde domein is niet geldig en zorgt ervoor dat het domein voor de test faalt. Let op: DMARC vereist dathet SPF-domein (envelope sender, d.w.z. return-path dat terugkomt in<code>MAIL FROM</code>) en het DKIM-domein (<code>d=</code>) gelijk zijn aan het verzenddomein in hetmailbericht (<code>From:</code>). ",
  "detail_mail_auth_dmarc_label": "DMARC aanwezigheid",
  "detail_mail_auth_dmarc_tech_table": "DMARC-record|Gevonden op",
  "detail_mail_auth_dmarc_tech_table_dmarc_record": "DMARC-record",
  "detail_mail_auth_dmarc_tech_table_found_on": "Gevonden op",
  "detail_mail_auth_dmarc_verdict_bad": "Je domeinnaam heeft <em>geen</em> DMARC-record.",
  "detail_mail_auth_dmarc_verdict_good": "Je domeinnaam heeft een DMARC-record.",
  "detail_mail_auth_dmarc_policy_exp": "<p>We controleren of de syntax van je DMARC-record correct is en of deze een voldoende strikte policy bevat (<code>p=quarantine</code> of <code>p=reject</code>) om misbruik van je domein door phishers en spammers tegen te gaan. Zelfs zonder een strikte policy kan DMARC nuttig zijn om met behulp van DMARC-rapporten meer inzicht te verkrijgen in legale en illegale uitgaande e-mailstromen. Maar om DMARC effectief te laten zijn tegen misbruik van je domein, is een liberale policy (<code>p=none</code>) niet voldoende.</p><p>We controleren ook of de mailadressen onder <code>rua=</code> en <code>ruf=</code> geldig zijn. Als deze een extern e-mailadres bevatten dan controleren we of het externe domein geautoriseerd is om DMARC-rapportages te ontvangen. Zorg ervoor dat het DMARC-autorisatierecord op het externe domein ten minste <code>\"v=DMARC1;\"</code> bevat.</p><p>De test staat het gebruik van de experimentele <code>np</code> tag toe (<a href=\"https://www.rfc-editor.org/rfc/rfc9091\">RFC 9091</a>).</p><p><em>Good practice voor domeinnaam zonder mail:</em></p><ul><li>Niet-verzendend: Gebruik de meest strikte DMARC policy (<code>p=reject</code>) en SPF policy (<code>-all</code>) voor (sub-)domeinnamen die je niet gebruikt om mail vanaf te versturen, om misbruik ('spoofing') tegen te gaan. Merk op dat DKIM in dit geval niet noodzakelijk is.</li><li>Niet-ontvangend: Voor meer informatie over \"Null MX\" en \"No MX\" zie de uitleg van de <a href=\"#control-panel-13\">\"STARTTLS beschikbaar\" subtest</a>.</li></ul><p>Hieronder volgen twee basisvoorbeelden van de DNS-configuratie voor een domeinnaam die niet gebruikt wordt voor het verzenden en ontvangen van mail.</p><p><em>A. Enkele domeinnaam zonder A- of AAAA-record</em></p><pre><code>example.nl. TXT \"v=spf1 -all\"*.example.nl. TXT \"v=spf1 -all\"_dmarc.example.nl. TXT \"v=DMARC1; p=reject;\"</code></pre><p>&nbsp;</p><p><em>B. Enkele domeinnaam met A- of AAAA-record</em></p><pre><code>example.nl. AAAA 2a00:d78:0:712:94:198:159:35example.nl. A 94.198.159.35example.nl. MX 0 .example.nl. TXT \"v=spf1 -all\"*.example.nl. TXT \"v=spf1 -all\"www.example.nl. CNAME example.nl_dmarc.example.nl. TXT \"v=DMARC1; p=reject;\"</code></pre>",
  "detail_mail_auth_dmarc_policy_label": "DMARC policy",
  "detail_mail_auth_dmarc_policy_verdict_bad": "Je DMARC-policy is syntactisch <em>niet</em> correct.",
  "detail_mail_auth_dmarc_policy_verdict_external": "De domeinnaam van het mailadres na <code>rua=</code> en/of <code>ruf=</code> bevat <em>geen</em> (geldig) autorisatie-record om DMARC-rapporten te ontvangen voor de geteste domeinnaam. ",
  "detail_mail_auth_dmarc_policy_verdict_good": "Je DMARC-policy is voldoende strikt.",
  "detail_mail_auth_dmarc_policy_verdict_policy": "Je DMARC-policy is <em>niet</em> voldoende strikt.",
  "detail_mail_auth_spf_exp": "We testen of je domeinnaam een SPF-record heeft. Een ontvangende mailserver kan de IP-adressen in je SPF-record gebruiken om de verzendende mailserver van een ontvangen e-mail met jouw domein als afzender te authenticeren. Het bijbehorende beleid kan worden gebruikt om passende actie te ondernemen als de authenticatie mislukt. Meer dan één SPF-record op hetzelfde domein is niet geldig en zorgt ervoor dat het domein voor de test faalt.</p><p>Voor een \"good practice voor domeinnamen zonder mail\" zie de <a href=\"#control-panel-9\">uitleg van de \"DMARC-policy\" subtest</a>.",
  "detail_mail_auth_spf_label": "SPF aanwezigheid",
  "detail_mail_auth_spf_tech_table": "SPF-record",
  "detail_mail_auth_spf_tech_table_spf_record": "SPF-record",
  "detail_mail_auth_spf_verdict_bad": "Je domeinnaam heeft geen geldig SPF-record.",
  "detail_mail_auth_spf_verdict_good": "Je domein heeft een SPF-record.",
  "detail_mail_auth_spf_policy_exp": "We controleren of de syntax van je SPF-record geldig is en of deze een voldoende strikte policy, d.w.z. <code>~all</code> (softfail) of <code>-all</code> (hardfail), bevat om misbruik van je domein door phishers en spammers tegen te gaan. Om misbruik van je domein tegen te gaan is een liberale policy, d.w.z. <code>+all</code> (pass) of <code>?all</code> (neutral), onvoldoende. Als <code>all</code> ontbreekt en er is geen <code>redirect</code> aanwezig in je SPF-record, dan is de default policy <code>?all</code>. </p><p>We volgen ook <code>include</code> en <code>redirect</code> voor geldige SPF-records. Bovendien controleren we of je SPF-record het toegestane aantal van 10 DNS-opvragingen niet overschrijdt waardoor het geen werking meer heeft. Ieder van de volgende SPF-termen telt als een DNS-opvraging: <code>redirect</code>, <code>include</code>, <code>a</code>, <code>mx</code>, <code>ptr</code> en <code>exist</code>. Terwijl de SPF-termen <code>all</code>, <code>ip4</code>, <code>ip6</code> en <code>exp</code> niet tellen als DNS-opvragingen.</p><p>Merk op dat als het domein onder <code>include</code> of <code>redirect</code> uit macro's bestaat, dan volgen we deze niet omdat we niet over de noodzakelijk informatie van een daadwerkelijke mail of mailserververbinding beschikken om de macro's uit te voeren. Dit betekent dat we het gevolg van macro's niet beoordelen. Bovendien tellen we de door macro's veroorzaakte DNS-opvragingen niet mee om te bepalen of het toegestane aantal DNS-opvragingen is overschreden.</p><p>Voor verzendende domeinen heeft het gebruik van <code>~all</code> (softfail) in plaats van <code>-all</code> (fail) meestal de voorkeur. De reden hiervoor is dat wanneer de SPF-authenticatie faalt met een SPF fail, een ontvangende mailserver de verbinding al kan blokkeren zonder de DKIM-handtekening en het DMARC-beleid te evalueren. Dit kan leiden tot ten onrechte geblokkeerde mails (bijvoorbeeld wanneer mails door de ontvangende mailserver automatisch worden doorgestuurd naar een andere ontvangende mailserver). Merk op dat een getriggerde SPF softfail er nog steeds voor zorgt dat een strikte DMARC policy je domein beschermt als ook de DKIM-authenticatie faalt.</p><p>Voor domeinen zonder mail zie de good practice op <a href=\"#control-panel-9\">uitleg van de \"DMARC-policy\" subtest</a>.",
  "detail_mail_auth_spf_policy_label": "SPF policy",
  "detail_mail_auth_spf_policy_tech_table": "Domein|SPF-record",
  "detail_mail_auth_spf_policy_tech_table_domain": "Domein",
  "detail_mail_auth_spf_policy_tech_table_spf_record": "SPF-record",
  "detail_mail_auth_spf_policy_verdict_all": "Je SPF-policy is <em>niet</em> voldoende strikt.",
  "detail_mail_auth_spf_policy_verdict_bad": "Je SPF-policy is syntactisch <em>niet</em> correct.",
  "detail_mail_auth_spf_policy_verdict_good": "Je SPF-policy is voldoende strikt.",
  "detail_mail_auth_spf_policy_verdict_include": "Je SPF-policy is <em>niet</em> voldoende strikt. Het 'include'-mechanisme in je SPF-record verwijst naar een onvoldoende strikte SPF-policy of naar een niet-bestaand SPF-record.",
  "detail_mail_auth_spf_policy_verdict_max_lookups": "Je SPF-policy is <em>niet</em> effectief omdat deze meer dan de toegestane 10 DNS-opvragingen vereist. Elk van de volgende SPF-termen telt als een DNS-opvraging: <code>redirect</code>, <code>include</code>, <code>a</code>, <code>mx</code>, <code>ptr</code> en <code>exist</code>. Terwijl de SPF-termen <code>all</code>, <code>ip4</code>, <code>ip6</code> en <code>exp</code> niet tellen als DNS-opvragingen.",
  "detail_mail_auth_spf_policy_verdict_redirect": "Je SPF-policy is <em>niet</em> voldoende strikt. De 'redirect modifier' in je SPF-record verwijst naar een onvoldoende strikte SPF-policy of naar een niet-bestaand SPF-record.",
  "detail_mail_dnssec_exists_exp": "We testen of de domeinnaam in je e-mailadres, meer specifiek het SOA-record, ondertekend is met DNSSEC. De handtekening zorgt ervoor dat een verzender, die domeinhandtekeningen controleert, op een betrouwbare wijze jouw mailserverdomeinen (MX) kan opvragen. Dit voorkomt dat een aanvaller het antwoord manipuleert en aan jou gerichte mail omleidt naar een mailserverdomein dat onder controle is van de aanvaller.</p><p>Als een domein via <code>CNAME</code> doorverwijst naar een ander domein, dan checken we (conform de DNSSEC-standaard) ook of het CNAME-domein ondertekend is met DNSSEC. Als het CNAME-domein niet ondertekend is, dan zal deze subtest een negatief resultaat tonen.</p><p>Let op: de geldigheid van de ondertekening wordt niet getest in deze subtest maar wel in de volgende subtest.",
  "detail_mail_dnssec_exists_label": "DNSSEC aanwezigheid",
  "detail_mail_dnssec_exists_tech_table": "E-mailadresdomein|Registrar",
  "detail_mail_dnssec_exists_tech_table_email_address_domain": "E-mailadresdomein",
  "detail_mail_dnssec_exists_tech_table_registrar": "Registrar",
  "detail_mail_dnssec_exists_verdict_bad": "Je e-mailadresdomein is onveilig oftewel 'insecure', omdat het <em>niet</em> ondertekend is met DNSSEC.",
  "detail_mail_dnssec_exists_verdict_good": "Je e-mailadresdomein is met DNSSEC ondertekend.",
  "detail_mail_dnssec_exists_verdict_resolver_error": "Helaas is in de resolver van Internet.nl een fout opgetreden. Neem a.j.b. <a href=\"/about/\">contact</a> met ons op.",
  "detail_mail_dnssec_exists_verdict_servfail": "De nameservers van je e-mailadresdomein zijn <em>kapot</em>. Ze gaven een foutmelding (<code>SERVFAIL</code>) terug op onze bevragingen voor een DNSSEC-handtekening. Vraag de nameserver-beheerder (vaak je registrar en/of hostingprovider) om dit spoedig op te lossen.",
  "detail_mail_dnssec_mx_exists_exp": "We testen of de domeinnamen van je mailservers (MX), meer specifiek hun SOA-records, ondertekend zijn met DNSSEC. De handtekening zorgt ervoor dat een verzender, die domeinhandtekeningen controleert, op een betrouwbare wijze de IP-adressen en DANE-records van jouw mailservers kan opvragen. Dit voorkomt dat een aanvaller het antwoord manipuleert en aan jou gerichte mail omleidt naar IP-adressen die onder controle staan van de aanvaller óf de beveiligde mailserver-verbinding afluistert.</p><p>Als een domein via <code>CNAME</code> doorverwijst naar een ander domein, dan checken we (conform de DNSSEC-standaard) ook of het CNAME-domein ondertekend is met DNSSEC. Als het CNAME-domein niet ondertekend is, dan zal deze subtest een negatief resultaat tonen.</p><p>Merk op dat de e-mailtest niet terugvalt op A/AAAA-records voor mailservers in geval van afwezigheid van een MX-record.</p><p>De geldigheid van de ondertekening wordt niet getest in deze subtest maar wel in de volgende subtest.",
  "detail_mail_dnssec_mx_exists_label": "DNSSEC aanwezigheid",
  "detail_mail_dnssec_mx_exists_tech_table": "Domein van mailserver (MX)|DNSSEC aanwezig",
  "detail_mail_dnssec_mx_exists_tech_table_domain_of_mail_server_mx": "Domein van mailserver (MX)",
  "detail_mail_dnssec_mx_exists_tech_table_dnssec_existent": "DNSSEC aanwezig",
  "detail_mail_dnssec_mx_exists_verdict_bad": "Tenminste één van jouw mailserverdomeinen is onveilig oftewel 'insecure', omdat deze <em>niet</em> ondertekend is met DNSSEC.",
  "detail_mail_dnssec_mx_exists_verdict_good": "Al je mailserverdomeinen zijn ondertekend met DNSSEC.",
  "detail_mail_dnssec_mx_exists_verdict_invalid_null_mx": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "detail_mail_dnssec_mx_exists_verdict_no_mailservers": "Het SPF-record op je domeinnaam geeft aan dat je domeinnaam kan worden gebruikt voor het verzenden van e-mail. Je domeinnaam heeft echter geen ontvangende mailserver (MX), wat de bezorgbaarheid van je verzonden e-mail kan belemmeren omdat het ontbreken van een MX door ontvangers kan worden gezien als een indicator voor spam. Als je daarom echt mail vanaf deze domeinnaam wilt verzenden, configureer dan een MX. Als je echter geen mail wilt versturen vanaf deze domeinnaam, configureer dan een SPF-record met alleen de term <code>-all</code> en daarnaast een \"Null MX\" record als je domeinnaam A/AAAA-records heeft. Vanwege je configuratie zijn de subtests in de categorie STARTTLS en DANE en de mailserver-specifieke subtests in de categorieën IPv6 en DNSSEC niet van toepassing.",
  "detail_mail_dnssec_mx_exists_verdict_no_null_mx": "Er zijn geen ontvangende mailservers (MX) ingesteld op je domeinnaam die wel A/AAAA records heeft. We adviseren je om duidelijk te laten zien dat je domeinnaam geen e-mail accepteert door een \"Null MX\" record te publiceren. Gebruik geen \"Null MX\"-record en stel een MX in als je wel e-mail wil verzenden vanaf deze domeinnaam, aangezien ontvangende servers e-mail met een ongeldig retouradres kunnen weigeren.",
  "detail_mail_dnssec_mx_exists_verdict_null_mx": "Je domeinnaam die A/AAAA-records heeft, geeft met een \"Null MX\" record duidelijk aan geen e-mail te accepteren. Dat is prima als je geen e-mail wilt ontvangen. Gebruik geen \"Null MX\"-record en stel een MX in als je wel e-mail wil verzenden vanaf deze domeinnaam, aangezien ontvangende servers e-mail met een ongeldig retouradres kunnen weigeren.",
  "detail_mail_dnssec_mx_exists_verdict_null_mx_with_other_mx": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "detail_mail_dnssec_mx_exists_verdict_null_mx_without_a_aaaa": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is.",
  "detail_mail_dnssec_mx_exists_verdict_resolver_error": "Helaas is in de resolver van Internet.nl een fout opgetreden. Neem a.j.b. <a href=\"/about/\">contact</a> met ons op.",
  "detail_mail_dnssec_mx_exists_verdict_servfail": "De nameservers van tenminste één van je mailserverdomeinen zijn <em>kapot</em>. Ze gaven een foutmelding (<code>SERVFAIL</code>) terug op onze bevragingen voor een DNSSEC-handtekening. Vraag de nameserver-beheerder (vaak je mailprovider) om dit spoedig op te lossen.",
  "detail_mail_dnssec_mx_valid_exp": "We testen of de domeinen van je ontvangende mailservers (MX), meer specifiek hun SOA-records, zijn ondertekend met een geldige DNSSEC-handtekening die ze veilig oftewel 'secure' maakt.</p><p>Als een domeinnaam via <code>CNAME</code> verwijst naar een ander ondertekend domeinnaam, dan checken we (conform de DNSSEC-standaard) ook of de ondertekening van het CNAME-domein geldig is. Als de ondertekening van de CNAME-domeinnaam niet geldig is, dan zal deze subtest een negatief resultaat tonen.</p><p>Merk op dat we alleen de nameserver testen die als eerste reageert. Als nameservers van een domeinnaam inconsistente configuraties hebben, kan dit leiden tot variërende testresultaten. In dat geval kan het resultaat voor deze subtest bijvoorbeeld de ene keer 'secure' en de andere keer 'bogus' zijn.",
  "detail_mail_dnssec_mx_valid_label": "DNSSEC geldigheid",
  "detail_mail_dnssec_mx_valid_tech_table": "Domein van mailserver (MX)|Status",
  "detail_mail_dnssec_mx_valid_tech_table_domain_of_mail_server_mx": "Domein van mailserver (MX)",
  "detail_mail_dnssec_mx_valid_tech_table_status": "Status",
  "detail_mail_dnssec_mx_valid_verdict_bad": "Tenminste één van de ondertekende domeinen van je mailservers is onbetrouwbaar oftewel 'bogus', omdat zijn DNSSEC-handtekening niet geldig is. Óf iemand manipuleerde de antwoorden van de nameservers, óf je mailserverdomein heeft serieuze DNSSEC-configuratiefouten. Dit laatste maakt je ontvangende mailserver onbereikbaar voor alle verzendende mailservers die DNSSEC-handtekeningen controleren. Neem zo spoedig mogelijk contact op met de nameserver-beheerder (vaak je mailprovider).",
  "detail_mail_dnssec_mx_valid_verdict_good": "Al de ondertekende domeinnamen van je mailservers zijn veilig oftewel 'secure', omdat hun DNSSEC-handtekeningen geldig zijn.",
  "detail_mail_dnssec_mx_valid_verdict_unsupported_ds_algo": "Tenminste één van de domeinen van je mailservers is ondertekend met een algoritme dat onze validerende resolver momenteel nog niet ondersteunt. Daardoor zijn we niet in staat de geldigheid van zijn DNSSEC-handtekening te controleren.",
  "detail_mail_dnssec_valid_exp": "We testen of je domeinnaam, meer specifiek het SOA-record, is ondertekend met een geldige DNSSEC-handtekening.</p><p>Als een domeinnaam via <code>CNAME</code> verwijst naar een ander ondertekend domeinnaam, dan checken we (conform de DNSSEC-standaard) ook of de ondertekening van het CNAME-domein geldig is. Als de ondertekening van de CNAME-domeinnaam niet geldig is, dan zal deze subtest een negatief resultaat tonen.</p><p>Merk op dat we alleen de nameserver testen die als eerste reageert. Als nameservers van een domeinnaam inconsistente configuraties hebben, kan dit leiden tot variërende testresultaten. In dat geval kan het resultaat voor deze subtest bijvoorbeeld de ene keer 'secure' en de andere keer 'bogus' zijn.",
  "detail_mail_dnssec_valid_label": "DNSSEC geldigheid",
  "detail_mail_dnssec_valid_tech_table": "E-mailadresdomein|Status",
  "detail_mail_dnssec_valid_tech_table_email_address_domain": "E-mailadresdomein",
  "detail_mail_dnssec_valid_tech_table_status": "Status",
  "detail_mail_dnssec_valid_verdict_bad": "Je e-mailadresdomein is onbetrouwbaar oftewel 'bogus', omdat de DNSSEC-handtekening <em>niet</em> geldig is. Óf iemand manipuleerde het antwoord van jouw nameserver, óf je domeinnaam heeft een <em>serieuze DNSSEC-configuratiefout</em>. Dit laatste maakt je domeinnaam onbereikbaar voor alle gebruikers die DNSSEC-handtekeningen controleren. Neem zo spoedig mogelijk contact op met je nameserver-beheerder (vaak je registrar of hostingprovider).",
  "detail_mail_dnssec_valid_verdict_good": "Je e-mailadresdomein is veilig oftewel 'secure', omdat zijn DNSSEC-handtekening geldig is.",
  "detail_mail_dnssec_valid_verdict_unsupported_ds_algo": "Je e-mailadresdomein is ondertekend met een algoritme dat onze validerende resolver momenteel nog niet ondersteunt. Daardoor zijn we niet in staat de geldigheid van zijn DNSSEC-handtekening te controleren.",
  "detail_mail_ipv6_mx_aaaa_exp": "We testen of er tenminste één AAAA-record met IPv6-adres voor iedere ontvangende mailserver (MX) is. In het geval er geen mailserver is gedefinieerd, geven we een notificatie en we voeren andere subtesten van de mailtest die nog steeds relevant zijn gewoon uit.</p><p>'IPv4-mapped IPv6 addresses' (<a href=\"https://www.rfc-editor.org/rfc/rfc4291\">RFC 4291</a>, beginnend met ::ffff:) zullen falen in deze subtest, aangezien zij <em>geen</em> IPv6-connectiviteit bieden.</p><p>Merk op dat de e-mailtest niet terugvalt op A/AAAA-records voor mailservers in geval van afwezigheid van een MX-record.",
  "detail_mail_ipv6_mx_aaaa_label": "IPv6-adressen voor mailserver(s)",
  "detail_mail_ipv6_mx_aaaa_tech_table": "Mailserver (MX)|IPv6-adres|IPv4-adres",
  "detail_mail_ipv6_mx_aaaa_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_ipv6_mx_aaaa_tech_table_ipv6_address": "IPv6-adres",
  "detail_mail_ipv6_mx_aaaa_tech_table_ipv4_address": "IPv4-adres",
  "detail_mail_ipv6_mx_aaaa_verdict_bad": "Tenminste één ontvangende mailserver op jouw domeinnaam heeft <em>geen</em> IPv6-adres.",
  "detail_mail_ipv6_mx_aaaa_verdict_good": "Alle ontvangende mailservers op jouw domeinnaam hebben een IPv6-adres.",
  "detail_mail_ipv6_mx_aaaa_verdict_invalid_null_mx": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld met een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "detail_mail_ipv6_mx_aaaa_verdict_no_null_mx": "Er zijn geen ontvangende mailservers (MX) ingesteld op je domein dat A/AAAA-records heeft en dat een SPF-record heeft met alleen de term <code>-all</code>. We raden je aan een \"Null MX\" record in te stellen om expliciet aan te geven dat je domein geen e-mail accepteert. Vanwege je configuratie zijn de subtests in de categorie STARTTLS en DANE en de mailserver-specifieke subtests in de categorieën IPv6 en DNSSEC niet van toepassing.",
  "detail_mail_ipv6_mx_aaaa_verdict_null_mx": "Je domeinnaam die A/AAAA-records heeft, geeft met een \"Null MX\" record duidelijk aan geen e-mail te accepteren. Dat is prima als je geen e-mail wilt ontvangen. Gebruik geen \"Null MX\"-record en stel een MX in als je wel e-mail wil verzenden vanaf deze domeinnaam, aangezien ontvangende servers e-mail met een ongeldig retouradres kunnen weigeren.",
  "detail_mail_ipv6_mx_aaaa_verdict_null_mx_with_other_mx": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "detail_mail_ipv6_mx_aaaa_verdict_null_mx_without_a_aaaa": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is.",
  "detail_mail_ipv6_mx_aaaa_verdict_other": "Het SPF-record op je domeinnaam geeft aan dat je domeinnaam kan worden gebruikt voor het verzenden van e-mail. Je domeinnaam heeft echter geen ontvangende mailserver (MX), wat de bezorgbaarheid van je verzonden e-mail kan belemmeren omdat het ontbreken van een MX door ontvangers kan worden gezien als een indicator voor spam. Als je daarom echt mail vanaf deze domeinnaam wilt verzenden, configureer dan een MX. Als je echter geen mail wilt versturen vanaf deze domeinnaam, configureer dan een SPF-record met alleen de term <code>-all</code> en daarnaast een \"Null MX\" record als je domeinnaam A/AAAA-records heeft. Vanwege je configuratie zijn de subtests in de categorie STARTTLS en DANE en de mailserver-specifieke subtests in de categorieën IPv6 en DNSSEC niet van toepassing.",
  "detail_mail_ipv6_mx_reach_exp": "We testen of we je mailservers (MX) kunnen bereiken via IPv6 op poort 25. We testen alle IPv6-adressen die we ontvangen van de nameservers van je mailserverdomein(en). Een deelscore wordt gegeven als niet alle IPv6-adressen bereikbaar zijn. Als een IPv6-adres (syntactisch) ongeldig is, dan beschouwen we dat als onbereikbaar.",
  "detail_mail_ipv6_mx_reach_label": "IPv6-bereikbaarheid van mailserver(s)",
  "detail_mail_ipv6_mx_reach_tech_table": "Mailserver (MX)|Onbereikbaar IPv6-adres",
  "detail_mail_ipv6_mx_reach_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_ipv6_mx_reach_tech_table_unreachable_ipv6_address": "Onbereikbaar IPv6-adres",
  "detail_mail_ipv6_mx_reach_verdict_bad": "Tenminste één van je ontvangende mailservers met een IPv6-adres is <em>niet</em> bereikbaar via IPv6.",
  "detail_mail_ipv6_mx_reach_verdict_good": "Al je ontvangende mailservers met een IPv6-adres zijn bereikbaar via IPv6.",
  "detail_mail_rpki_exists_exp": "We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van je mailserver(s) (MX).</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen.</p><p>Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar uw server wordt onderschept.</p><p>Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (<code>Invalid</code>) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.",
  "detail_mail_rpki_exists_label": "Aanwezigheid van Route Origin Authorisation",
  "detail_mail_rpki_exists_tech_table": "Mailserver|IP-adres|RPKI Route Origin Authorization",
  "detail_mail_rpki_exists_tech_table_mail_server": "Mailserver",
  "detail_mail_rpki_exists_tech_table_ip_address": "IP-adres",
  "detail_mail_rpki_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_mail_rpki_exists_verdict_bad": "Voor tenminste één van de IP-adressen van je ontvangende mailserver(s) is <em>geen</em> RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_mail_rpki_exists_verdict_good": "Voor alle IP-adressen van je ontvangende mailserver(s) is een RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_mail_rpki_exists_verdict_no_addresses": "Je domein bevat <em>geen</em> ontvangende mailservers. Daarom kon deze subtest niet worden uitgevoerd.",
  "detail_mail_rpki_mx_ns_exists_exp": "We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van de nameservers van je mailserver(s) (MX).</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen.</p><p>Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar je server wordt onderschept.</p><p>Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (<code>Invalid</code>) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.",
  "detail_mail_rpki_mx_ns_exists_label": "Aanwezigheid van Route Origin Authorisation",
  "detail_mail_rpki_mx_ns_exists_tech_table": "Nameserver van MX|IP-adres|RPKI Route Origin Authorization",
  "detail_mail_rpki_mx_ns_exists_tech_table_name_server_of_mx": "Nameserver van MX",
  "detail_mail_rpki_mx_ns_exists_tech_table_ip_address": "IP-adres",
  "detail_mail_rpki_mx_ns_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_mail_rpki_mx_ns_exists_verdict_bad": "Voor tenminste één van de IP-adressen van de nameservers van je mailserver(s) is <em>geen</em> RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_mail_rpki_mx_ns_exists_verdict_good": "Voor alle IP-adressen van de nameservers van je mailserver(s) is een RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_mail_rpki_mx_ns_exists_verdict_no_addresses": "Je domein bevat <em>geen</em> mailservers. Daarom kon deze subtest niet worden uitgevoerd.",
  "detail_mail_rpki_mx_ns_valid_exp": "We testen of de validatie-status van alle IP-adressen van de nameservers van je mailservers (MX) <code>Valid</code> is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal <code>Valid</code> zijn.</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen.</p><p>Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). </p><p>Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. </p><p>De netwerkprovider kan deze inhoud vervolgens gebruiken om  BGP-routes te filteren. Hij kan bijvoorbeeld eventuele <code>Invalid</code> routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.</p><p>Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten.</p><p>1․ <code>Valid</code>: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het <code>maxLength</code> attribuut). </p><p>2․ <code>Invalid</code>: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht <em>niet</em>. Er zijn twee mogelijke oorzaken: </p><ul><li>het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie <em>niet</em> is geautoriseerd (resultaat in onderstaande tabel: \"invalid (as)\");</li><li>het IP-adresblok (Route Prefix) dat wordt aangekondigd is <em>kleiner</em> dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van <code>maxLength</code> waarde (resultaat in onderstaande tabel: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.</p><p><strong>Wat te doen als het testresultaat de status Invalid toont?</strong></p><p>De status <code>Invalid</code> duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. ",
  "detail_mail_rpki_mx_ns_valid_label": "Geldigheid van route-aankondiging",
  "detail_mail_rpki_mx_ns_valid_tech_table": "Nameserver van MX|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status",
  "detail_mail_rpki_mx_ns_valid_tech_table_name_server_of_mx": "Nameserver van MX",
  "detail_mail_rpki_mx_ns_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_mail_rpki_mx_ns_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_mail_rpki_mx_ns_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation status",
  "detail_mail_rpki_mx_ns_valid_verdict_bad": "Ten minste één IP-adres van de nameservers van je ontvangende mailservers heeft een <code>NotFound</code> validatie-status. Er is <em>geen</em> RPKI Route Origin Authorization (ROA) gepubliceerd voor de route-aankondiging van ieder van de desbetreffende IP-adressen.",
  "detail_mail_rpki_mx_ns_valid_verdict_good": "Alle IP-adressen van de nameservers van je ontvangende mailservers hebben een <code>Valid</code> validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).",
  "detail_mail_rpki_mx_ns_valid_verdict_invalid": "Tenminste één IP-adres van de nameservers van je ontvangende mailservers heeft een <code>Invalid</code> validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt <em>niet</em> gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je mailhoster (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je mailhoster. Bij een interne fout moet je mailhoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.",
  "detail_mail_rpki_mx_ns_valid_verdict_not_routed": "Deze subtest werd <em>niet</em> uitgevoerd, omdat er voor <em>geen</em> van de IP-adressen een route-aankondiging beschikbaar was.",
  "detail_mail_rpki_valid_exp": "We testen of de validatie-status van alle IP-adressen van je mailservers (MX) <code>Valid</code> is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal <code>Valid</code> zijn.</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen.</p><p>Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). </p><p>Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. </p><p>De netwerkprovider kan deze inhoud vervolgens gebruiken om  BGP-routes te filteren. Hij kan bijvoorbeeld eventuele <code>Invalid</code> routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.</p><p>Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten.</p><p>1․ <code>Valid</code>: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het <code>maxLength</code> attribuut). </p><p>2․ <code>Invalid</code>: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht <em>niet</em>. Er zijn twee mogelijke oorzaken: </p><ul><li>het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie <em>niet</em> is geautoriseerd (resultaat in onderstaande tabel: \"invalid (as)\");</li><li>het IP-adresblok (Route Prefix) dat wordt aangekondigd is <em>kleiner</em> dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van <code>maxLength</code> waarde (resultaat in onderstaande tabel: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.</p><p><strong>Wat te doen als het testresultaat de status Invalid toont?</strong></p><p>De status <code>Invalid</code> duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. ",
  "detail_mail_rpki_valid_label": "Geldigheid van route-aankondiging",
  "detail_mail_rpki_valid_tech_table": "Mailserver|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status",
  "detail_mail_rpki_valid_tech_table_mail_server": "Mailserver",
  "detail_mail_rpki_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_mail_rpki_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_mail_rpki_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation status",
  "detail_mail_rpki_valid_verdict_bad": "Ten minste één IP-adres van je ontvangende mailservers heeft een <code>NotFound</code> validatie-status. Er is <em>geen</em> RPKI Route Origin Authorization (ROA) gepubliceerd voor de route-aankondiging van ieder van de desbetreffende IP-adressen.",
  "detail_mail_rpki_valid_verdict_good": "Alle IP-adressen van je ontvangende mailservers hebben een <code>Valid</code> validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).",
  "detail_mail_rpki_valid_verdict_invalid": "Tenminste één IP-adres van je ontvangende mailservers heeft een <code>Invalid</code> validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt <em>niet</em> gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je mailhoster (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je mailhoster. Bij een interne fout moet je mailhoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.",
  "detail_mail_rpki_valid_verdict_not_routed": "Deze subtest werd <em>niet</em> uitgevoerd, omdat er voor <em>geen</em> van de IP-adressen een route-aankondiging beschikbaar was.",
  "detail_mail_tls_cert_hostmatch_exp": "We testen of de domeinnaam van ieder van je ontvangende mailservers (MX) overeenkomt met de domeinnaam op het gepresenteerde certificaat. </p><p>Verzendende mailservers negeren doorgaans het domein op het certificaat. Zonder DNSSEC is de opvraging van het mailserverdomein kwetsbaar voor manipulatie. Daardoor voegt de controle of de domeinnaam op het certificaat overeenkomt met het mailserverdomeinnaam geen enkele authenticiteitswaarde toe. Ontvangende mailservers gebruiken daarom regelmatig zelf-ondertekende certificaten, vaak uitgegeven door een interne (private) certificaatautoriteit. </p><p>Voor authenticiteit dient een mailserver gebruikt te maken van DNSSEC en DANE. Een certificaat met domeinnaam die overeenkomt met de domeinnaam van je mailserver is alleen vereist als je gebruik maakt van DANE 'trust anchor assertion' (DANE-TA, 2).</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B3-1.</p><p><em>Niveau van vereistheid: Optioneel / Vereist (alleen als DANE-TA wordt gebruikt)</em>",
  "detail_mail_tls_cert_hostmatch_label": "Domeinnaam op certificaat",
  "detail_mail_tls_cert_hostmatch_tech_table": "Mailserver (MX)|Niet-overeenkomende domeinen op certificaat",
  "detail_mail_tls_cert_hostmatch_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_cert_hostmatch_tech_table_unmatched_domains_on_certificate": "Niet-overeenkomende domeinen op certificaat",
  "detail_mail_tls_cert_hostmatch_verdict_bad": "De domeinnaam van tenminste één van je mailservers komt <em>niet</em> overeen met de domeinnaam op het mailservercertificaat.",
  "detail_mail_tls_cert_hostmatch_verdict_good": "De domeinnamen van al je mailservers komen overeen met de domeinnamen op je mailservercertificaten.",
  "detail_mail_tls_cert_pubkey_exp": "<p>We testen of de (ECDSA of RSA) digitale handtekening van ieder van je mailserver-certificaten veilige parameters gebruikt.</p><p>Bij de verificatie van certificaten wordt gebruik gemaakt van digitale handtekeningen. Om de authenticiteit van de verbindingte garanderen, moet een betrouwbaar algoritme voor certificaatverificatie gekozen worden. Het algoritme dat gebruikt wordt om een certificaat te ondertekenen, wordt door de certificaatleverancier geselecteerd.</p><p>Het certificaat specificeert het algoritme voor digitale handtekeningen dat tijdens de sleuteluitwisseling door zijn eigenaar wordt gebruikt. Het is mogelijk om meerdere certificaten te configureren, zodat er ook meer dan één algoritme ondersteund kan worden.</p><p>De veiligheid van de ECDSA-digitale-handtekeningen is afhankelijk van de geselecteerde kromme. De veiligheid van RSA voor de versleuteling en digitale handtekeningen houdt verband met de sleutellengte van de publieke sleutel.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B5-1 en tabel 9 voor ECDSA, en richtlijn B3-3 en tabel 8 voor RSA.</p><hr /><p><strong>Elliptische krommen voor ECDSA</strong></p><ul><li>Goed: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, and <code>x25519</code></li><li>Uit te faseren: <code>secp224r1</code></li><li>Onvoldoende: Andere krommen</li></ul><p><strong>Lengte van RSA-sleutels</strong></p><ul><li>Goed: Minimaal 3072 bit</li><li>Voldoende: 2048 – 3071 bit</li><li>Onvoldoende: Minder dan 2048 bit</li></ul>",
  "detail_mail_tls_cert_pubkey_label": "Publieke sleutel van certificaat",
  "detail_mail_tls_cert_pubkey_tech_table": "Mailserver (MX)|Getroffen handtekening-parameters|Status",
  "detail_mail_tls_cert_pubkey_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_cert_pubkey_tech_table_affected_signature_parameters": "Getroffen handtekening-parameters",
  "detail_mail_tls_cert_pubkey_tech_table_status": "Status",
  "detail_mail_tls_cert_pubkey_verdict_bad": "De digitale handtekening van tenminste één van je mailserver-certificaten gebruikt <em>onvoldoende</em> veilige parameters.",
  "detail_mail_tls_cert_pubkey_verdict_good": "De digitale handtekeningen van al je mailserver-certificaten gebruiken veilige parameters.",
  "detail_mail_tls_cert_pubkey_verdict_phase_out": "De digitale handtekening van tenminste één van je mailserver-certificaten gebruikt parameters die de status <em>uit te faseren</em> hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_mail_tls_cert_signature_exp": "<p>We testen of de ondertekende fingerprint van ieder van je mailserver-certificaten is gemaakt met een veilig algoritme voor hashing. </p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B3-2 en tabel 3.</p><hr /><p><strong>Hashfuncties voor certificaatverificatie</strong></p><ul><li>Goed: SHA-512, SHA-384, SHA-256</li><li>Onvoldoende: SHA-1, MD5</li></ul>",
  "detail_mail_tls_cert_signature_label": "Handtekening van certificaat",
  "detail_mail_tls_cert_signature_tech_table": "Mailserver (MX)|Getroffen hashing-algoritme|Status",
  "detail_mail_tls_cert_signature_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_cert_signature_tech_table_affected_hash_algorithm": "Getroffen hashing-algoritme",
  "detail_mail_tls_cert_signature_tech_table_status": "Status",
  "detail_mail_tls_cert_signature_verdict_bad": "Tenminste één van je mailserver-certificaten is ondertekend met een algoritme voor hashing dat <em>onvoldoende</em> veilig is.",
  "detail_mail_tls_cert_signature_verdict_good": "Al je mailserver-certificaten zijn ondertekend met een veilig algoritme voor hashing.",
  "detail_mail_tls_cert_trust_exp": "We testen of we een geldige vertrouwensketen voor je mailserver-certificaten kunnen opbouwen. </p><p>Er is sprake van een geldige vertrouwensketen, als je certificaat is uitgegeven door een <a href=\"https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/\">publiekelijk vertrouwde certificaatautoriteit</a> én je ontvangende mailserver alle noodzakelijke tussenliggende certificaten presenteert. </p><p>Verzendende mailservers negeren doorgaans of een mailservercertificaat is uitgegeven door een publiekelijk vertrouwde certificaatautoriteit. Zonder DNSSEC is de opvraging van het mailserverdomein kwetsbaar voor manipulatie. Daardoor kan een certificaat dat is uitgegeven door een publiekelijk vertrouwde certificaatautoriteit geen enkele authenticiteitswaarde toevoegen. Ontvangende mailservers gebruiken daarom regelmatig zelf-ondertekende certificaten, vaak uitgegeven door een interne (private) certificaatautoriteit. Voor authenticiteit dient een mailserver gebruikt te maken van DNSSEC en DANE.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B3-4.</p><p><em>Niveau van vereistheid: Optioneel</em>",
  "detail_mail_tls_cert_trust_label": "Vertrouwensketen van certificaat",
  "detail_mail_tls_cert_trust_tech_table": "Mailserver (MX)|Onvertrouwde certificaatketen",
  "detail_mail_tls_cert_trust_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_cert_trust_tech_table_untrusted_certificate_chain": "Onvertrouwde certificaatketen",
  "detail_mail_tls_cert_trust_verdict_bad": "De vertrouwensketen van tenminste één van je mailserver-certificaten is <em>niet</em> compleet en/of <em>niet</em> ondertekend door een vertrouwde certificaatautoriteit.",
  "detail_mail_tls_cert_trust_verdict_good": "De vertrouwensketen van al je mailserver-certificaten is compleet én ondertekend door een vertrouwde certificaatautoriteit.",
  "detail_mail_tls_cipher_order_exp": "We testen of je ontvangende mailservers (MX) hun eigen cipher-voorkeur afdwingen ('I'), en ciphers aanbieden conform de voorgeschreven volgorde ('II').</p><p>Als je mailserver alleen 'Goede' ciphers ondersteunt, dan is deze test niet van toepassing omdat de volgorde dan geen significant beveiligingsvoordeel oplevert.</p><p>I. <em>Server afgedwongen cipher-voorkeur</em>: Ontvangende mailservers dwingen hun cipher-voorkeur af tijdens de onderhandeling met verzendende mailservers, en accepteren geen voorkeur van de verzendende mailservers;</p><p>II. <em>Voorgeschreven volgorde</em>: Ciphers worden aangeboden door de ontvangende mailservers in overeenstemming met de voorgeschreven volgorde waarbij <em>Goede</em> boven <em>Voldoende</em> boven <em>Uit te faseren</em> ciphers worden geprefereerd. </p><p>In de bovenstaande tabel met technische details staan <strong>alleen de eerst gevonden algoritmeselecties die niet voldoen aan de voorgeschreven volgorde</strong>.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B2-5.",
  "detail_mail_tls_cipher_order_label": "Cipher-volgorde",
  "detail_mail_tls_cipher_order_tech_table": "Mail server (MX)|Eerst gevonden getroffen cipher-paren|Overtreden regel # ('II-B')",
  "detail_mail_tls_cipher_order_tech_table_mail_server_mx": "Mail server (MX)",
  "detail_mail_tls_cipher_order_tech_table_first_found_affected_cipher_pair": "Eerst gevonden getroffen cipher-paren",
  "detail_mail_tls_cipher_order_tech_table_violated_rule_ii_b": "Overtreden regel # ('II-B')",
  "detail_mail_tls_cipher_order_verdict_bad": "Tenminste één van je mailservers dwingt <em>niet</em> zijn eigen cipher-voorkeur af ('I').",
  "detail_mail_tls_cipher_order_verdict_good": "Al je mailservers dwingen hun eigen cipher-voorkeur af ('I'), en bieden ciphers aan conform de voorgeschreven volgorde ('II').",
  "detail_mail_tls_cipher_order_verdict_na": "Deze subtest is niet van toepassing aangezien je mailserver alleen 'Goede' ciphers ondersteunt.",
  "detail_mail_tls_cipher_order_verdict_seclevel_bad": "Tenminste één van je mailservers prefereert <em>niet</em> 'Goede' boven 'Voldoende' en dan pas 'Uit te faseren' ciphers ('II').",
  "detail_mail_tls_cipher_order_verdict_warning": "OUTDATED TEXT; VERDICT NOT USED</p><p>Tenminste een van je mailservers biedt <em>niet</em> ciphers aan conform de voorgeschreven volgorde binnen een bepaald veiligheidsniveau ('II-B').",
  "detail_mail_tls_ciphers_exp": "<p>We testen of je ontvangende mailservers (MX) alleen veilige, d.w.z. 'Goede' en/of 'Voldoende', ciphers (ook algoritmeselecties genoemd) ondersteunen. Om te voorkomen dat we tegen 'rate limits' van ontvangende mailservers aanlopen, bevat het testresultaat <strong>alleen de eerstgevonden getroffen algoritmeselectie</strong>.</p><p>Een algoritmeselectie bestaat uit ciphers voor vier cryptografische functies: 1) sleuteluitwisseling, 2) certificaatverificatie, 3) bulkversleuteling, en 4) hashing.</p><ul><li>Vanaf TLS 1.3 omvat de term 'cipher suite' alleen ciphers voor bulkversleuteling en hashing. Als TLS 1.3 gebruikt wordt dan zijn de ciphers voor sleuteluitwisseling en certificaatverificatie onderhandelbaar en niet langer onderdeel van de naam van de cipher suite. Omdat dit de term 'cipher suite' ambigu maakt, gebruikt NCSC de term 'algoritmeselectie' om alle vier de functies te omvatten.</li><li>NCSC gebruikt de <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4\">IANA-naamgeving</a> voor algoritmeselectie. Internet.nl hanteert de <a href=\"https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES\">OpenSSL-naamgeving</a>. Vanaf TLS 1.3 volgt OpenSSL de IANA-naamgeving. Een vertaling tussen beide is onderdeel van de  OpenSSL-documentation.</li><li>Merk op dat ciphers die PSK of SRP gebruiken voor sleuteluitwisseling (die onvoldoende veilig zijn) in deze test niet worden gedetecteerd vanwege een beperking die samenhangt met onze testwijze.</li></ul><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B2-1 t/m B2-4 en tabel 2, 4, 6 en 7.</p><hr /><p>Hieronder staan 'Goede', 'Voldoende' en 'Uit te faseren' algoritmeselecties in de door NCSC voorgeschreven volgorde, gebaseerd op bijlage C van de 'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.0'. Achter iedere algoritmeselectie staat de minimale TLS-versie (bijv. [1.2]) die deze algoritmeselectie ondersteunt en die tenminste 'Uit te faseren' is.</p><p>Goed:</p><ul><li><code>ECDHE-ECDSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li></ul><p>Voldoende:</p><ul><li><code>ECDHE-ECDSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-ECDSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-ECDSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-ECDSA-AES128-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-RSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-RSA-AES128-SHA</code> [1.0]</li><li><code>DHE-RSA-AES256-GCM-SHA384</code> [1.2]</li><li><code>DHE-RSA-CHACHA20-POLY1305</code> [1.2]</li><li><code>DHE-RSA-AES128-GCM-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA</code> [1.0]</li><li><code>DHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES128-SHA</code> [1.0]</li></ul><p>Uit te faseren:</p><ul><li><code>ECDHE-ECDSA-DES-CBC3-SHA</code> [1.0]</li><li><code>ECDHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>DHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>AES256-GCM-SHA384</code> [1.2]</li><li><code>AES128-GCM-SHA256</code> [1.2]</li><li><code>AES256-SHA256</code> [1.2]</li><li><code>AES256-SHA</code>  [1.0]</li><li><code>AES128-SHA256</code> [1.2]</li><li><code>AES128-SHA</code> [1.0]</li><li><code>DES-CBC3-SHA</code> [1.0]</li></ul>",
  "detail_mail_tls_ciphers_label": "Ciphers (Algoritmeselecties)",
  "detail_mail_tls_ciphers_tech_table": "Mailserver (MX)|Eerst gevonden onveilige cipher|Status",
  "detail_mail_tls_ciphers_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_ciphers_tech_table_first_found_affected_cipher": "Eerst gevonden onveilige cipher",
  "detail_mail_tls_ciphers_tech_table_status": "Status",
  "detail_mail_tls_ciphers_verdict_bad": "Tenminste één van je mailservers ondersteunt een of meer <em>onvoldoende</em> veilige ciphers.",
  "detail_mail_tls_ciphers_verdict_good": "Al je mailservers ondersteunen alleen veilige ciphers.",
  "detail_mail_tls_ciphers_verdict_phase_out": "Tenminste één van je mailservers ondersteunt een of meer ciphers die de status <em>uit te faseren</em> hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_mail_tls_compression_exp": "<p>We testen of je ontvangende mailservers (MX) TLS-compressie ondersteunen. </p><p>Het gebruik van compressie kan een aanvaller informatie bieden over geheime delen van versleutelde communicatie. Een aanvaller die in staat is om een deel van de verzonden data te achterhalen of te beïnvloeden, kan door middel van een groot aantal verzoeken stukje bij beetje de oorspronkelijke data reconstrueren. TLS-compressie wordt zo weinig gebruikt dat het geen kwaadkan om deze optie uit te schakelen.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B7-1 en tabel 11.</p><hr /><p><strong>Compressie-optie</strong></p><ul><li>Goed: Geen compressie</li><li>Voldoende: Compressie op applicatieniveau </li><li>Onvoldoende: TLS-compressie</li></ul>",
  "detail_mail_tls_compression_label": "TLS-compressie",
  "detail_mail_tls_compression_tech_table": "Mailserver (MX)|TLS-compressie",
  "detail_mail_tls_compression_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_compression_tech_table_tls_compression": "TLS-compressie",
  "detail_mail_tls_compression_verdict_bad": "Tenminste één van je mailservers ondersteunt TLS-compressie, wat <em>niet</em> veilig is.",
  "detail_mail_tls_compression_verdict_good": "Al je mailservers ondersteunen geen TLS-compressie.",
  "detail_mail_tls_dane_exists_exp": "We testen of de nameservers van ieder van je ontvangende mailservers (MX) een of meer TLSA-records voor DANE bevatten. </p><p>Aangezien DNSSEC een noodzakelijke randvoorwaarde is voor DANE, zal een domeinnaam niet slagen voor de test als DNSSEC ontbreekt op het mailserver-domein.</p><p>Merk op dat de test TLSA-records van de types PKIX-TA(0) or PKIX-EE(1) negeert, omdat deze niet gebruikt dienen te worden voor ontvangende mailservers. </p><p>De test slaagt daarnaast niet als er geen DNSSEC-bewijs van 'Denial of Existence' voor TLSA-records is. Als een ondertekend TLSA-record bestaat maar tegelijkertijd is er een 'insecure' <code>NXDOMAIN</code> voor hetzelfde domein (door verkeerd werkende DNSSEC-ondertekeningssoftware), dan zal de test ook niet slagen. De laatste twee foutscenario's kunnen leiden tot afleveringsproblemen van aan jou gerichte e-mails door DANE-validerende mailverzenders.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, Appendix A, onder 'Certificate pinning en DANE'.",
  "detail_mail_tls_dane_exists_label": "DANE aanwezigheid",
  "detail_mail_tls_dane_exists_tech_table": "Mailserver (MX)|DANE TLSA-record aanwezig",
  "detail_mail_tls_dane_exists_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_dane_exists_tech_table_dane_tlsa_record_existent": "DANE TLSA-record aanwezig",
  "detail_mail_tls_dane_exists_verdict_bad": "Tenminste één van je mailserverdomeinen bevat <em>geen</em> TLSA-record voor DANE.",
  "detail_mail_tls_dane_exists_verdict_bogus": "Tenminste één van je mailserverdomeinen bevat <em>geen</em> DNSSEC-bewijs dat DANE TLSA-records niet bestaan. Dit kan leiden tot afleveringsproblemen van mail die aan aan jou gericht is door DANE-validerende mailverstuurders. Vraag je nameserver-beheerder om deze fout op te lossen.",
  "detail_mail_tls_dane_exists_verdict_good": "Al je mailserverdomeinen bevatten een TLSA-record voor DANE.",
  "detail_mail_tls_dane_rollover_exp": "We testen of er een actief schema met tenminste twee DANE TLSA records is om de vervanging van certificaten op je ontvangende mailservers (MX) betrouwbaar te kunnen uitvoeren.</p><p>Een dergelijk schema is vooral handig bij het vervangen van je mailserver-certificaten. Het kan voorkomen dat DANE tijdens de vervangingsperiode ongeldig raakt waardoor aan jouw domein gerichte mail niet afgeleverd wordt. Een vervangingsschema voor DANE kan maar hoeft niet continu 'actief' te zijn.</p><p>We adviseren je om één van de twee volgende schema's met dubbele DANE TLSA records toe te passen:</p><ol><li>Huidige + Volgende (\"3 1 1\" + \"3 1 1\"): Publiceer twee \"DANE-EE(3) SPKI(1) SHA2-256(1)\" records, één voor het huidige en één voor het volgende TLS-certificaat van je mailserver. </li><li>Huidige + Uitgever CA (\"3 1 1\" + \"2 1 1\"): Publiceer een \"DANE-EE(3) SPKI(1) SHA2-256(1)\" record voor het huidige TLS-certificaat van je mailserver, en daarnaast een \"DANE-TA(2) SPKI(1) SHA2-256(1)\" record voor het huidige bovenliggende certificaat van de (niet noodzakelijkerwijs publieke) certificaatautoriteit. </li></ol><p>Deze subtest accepteert ook andere combinaties van DANE TLSA records, d.w.z. \"3 x x\"  + \"3 x x\" of \"3 x x\" + \"2 x x\". Andere typen dan de bovengenoemde zijn in de regel gevoeliger voor fouten en minder interoperabel.</p><p>Merk op dat als een mailserver tegelijkertijd twee certificaten aanbiedt (één gebaseerd op RSA en één gebaseerd op ECDSA), een afzonderlijk DANE TLSA rollover schema wordt aanbevolen voor ieder certificaat. De subtest controleert niet op dit scenario. Als er slechts één DANE TLSA-record is geconfigureerd voor elk certificaat, dan geeft deze subtest een vals-positief resultaat.</p><p><em>Niveau van vereistheid: Optioneel</em>",
  "detail_mail_tls_dane_rollover_label": "DANE-vervangingsschema",
  "detail_mail_tls_dane_rollover_tech_table": "Mailserver (MX)|DANE-vervangingsschema",
  "detail_mail_tls_dane_rollover_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_dane_rollover_tech_table_dane_rollover_scheme": "DANE-vervangingsschema",
  "detail_mail_tls_dane_rollover_verdict_bad": "Tenminste een van je mailserver-domeinen heeft <em>geen</em> actief DANE-schema voor het betrouwbaar vervangen van certificaat-sleutels.",
  "detail_mail_tls_dane_rollover_verdict_good": "Al je mailserver-domeinen hebben een actief DANE-schema voor het betrouwbaar vervangen van certificaat-sleutels.",
  "detail_mail_tls_dane_valid_exp": "We testen of de DANE-fingerprints die je mailserverdomeinen presenteren geldig zijn voor je mailservercertificaten. </p><p>Met DANE kan je informatie over jouw mailservercertificaten publiceren in een speciaal DNS-record, een TLSA-record. Verzendende mailservers kunnen de  certificaten nu niet alleen via de certificaatautoriteit, maar ook via de TLSA-records controleren op authenticiteit. Een verzendende mail server kan het TLSA-record ook als signaal gebruiken om alleen via STARTTLS (en niet onversleuteld) te verbinden. Als de DANE-fingerprint van een ontvangende mailserver wordt gecontroleerd door de verzendende mailserver, dan kan een actieve aanvaller die in staat is het berichtenverkeer te manipuleren de STARTTLS-encryptie niet verwijderen.",
  "detail_mail_tls_dane_valid_label": "DANE geldigheid",
  "detail_mail_tls_dane_valid_tech_table": "Mailserver (MX)|DANE TLSA-record geldig",
  "detail_mail_tls_dane_valid_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_dane_valid_tech_table_dane_tlsa_record_valid": "DANE TLSA-record geldig",
  "detail_mail_tls_dane_valid_verdict_bad": "Tenminste één van je mailservers heeft <em>geen</em> geldige DANE-fingerprints. Óf iemand manipuleerde het antwoord van je mailserver, óf je mailserver heeft een ernstige DANE-configuratiefout. Dit laatste maakt je domeinnaam onbereikbaar voor verzendende mailservers die DANE-fingerprints controleren. Neem zo spoedig mogelijk contact op met je mailprovider.",
  "detail_mail_tls_dane_valid_verdict_good": "Ieder van je mailservers heeft tenminste één geldige DANE-fingerprint. Daardoor kunnen verzendende mailservers die DANE-verificatie ondersteunen, een geauthenticeerde versleutelde transportverbinding met je ontvangende mailserver(s) opzetten.",
  "detail_mail_tls_fs_params_exp": "We testen of de publieke parameters, die in de Diffie-Hellman sleuteluitwisseling worden gebruikt door je mailservers (MX), veilig zijn. </p><p><strong>ECDHE</strong>: De veiligheid van de ECDHE-sleuteluitwisseling is afhankelijk van de geselecteerde elliptische kromme. We testen of de bitlengte van de gebruikte kromme tenminste 224 bits is. Op dit moment kunnen we niet de naam van de elliptische kromme testen.</p><p><strong>DHE</strong>: De veiligheid van de Diffie-Hellman Ephemeral (DHE) sleuteluitwisseling is afhankelijk van de lengte van de publieke en geheime sleutels die in de geselecteerde finite field-groep wordt gebruikt. We testen of je publieke DHE-sleutelmateriaal gebruikmaakt van een van de gepredefinieerde finite field-groepen die zijn gespecificeerd in <a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>. Zelf-gegenereerde groepen zijn 'Onvoldoende'.</p><p>De grotere sleutellengtes die noodzakelijk zijn voor het gebruik van DHE gaan ten koste van de prestaties. Maak een zorgvuldige afweging en gebruik waar mogelijk ECDHE in plaats van DHE.</p><p><strong>RSA als alternatief</strong>: Naast ECDHE en DHE, kan RSA gebruikt worden voor sleuteluitwisseling. RSA loopt het risico om onvoldoende veilig te worden (huidige status 'Uit te faseren'). De publieke RSA-parameters worden getest in de subtest 'Handtekening-parameters van certificaat'. Overigens heeft RSA voor certificaatverificatie wel de status 'Goed'.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B5-1 en tabel 9 voor ECDHE, en richtlijn B6-1 en tabel 10 voor DHE.</p><hr /><p><strong>Elliptische krommen voor ECDHE</strong></p><ul><li>Goed: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, en <code>x25519</code></li><li>Uit te faseren: <code>secp224r1</code></li><li>Onvoldoende: Andere krommen</li></ul><p><strong>Finite field-groepen voor DHE</strong></p><ul><li><p>Voldoende:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/main/ffdhe4096.pem\">ffdhe4096</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3</code></li><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/main/ffdhe3072.pem\">ffdhe3072</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab</code></li><li>Merk op dat we ook testen op ffdhe8192 and ffdhe6144 die beide voldoende zijn. Echter, hun beperkte beveiligingswinst weegt zelden op tegen het prestatie-verlies.</li></ul></li><li><p>Uit te faseren:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/main/ffdhe2048.pem\">ffdhe2048</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b</code></li></ul></li><li><p>Onvoldoende: Andere groepen</p></li></ul><hr /><p>Let op: de bovenstaande namen zijn gebaseerd op de <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml\">IANA naamgevingsconventies</a>. Soms worden alternatieve namen gebruikt om te verwijzen naar dezelfde krommen, zoals <code>prime256v1</code> (ANSI) en <code>NIST P-256</code> voor <code>secp256r1</code>.",
  "detail_mail_tls_fs_params_label": "Sleuteluitwisselingsparameters",
  "detail_mail_tls_fs_params_tech_table": "Mailserver (MX)|Getroffen parameters|Veiligheidsniveau",
  "detail_mail_tls_fs_params_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_fs_params_tech_table_affected_parameters": "Getroffen parameters",
  "detail_mail_tls_fs_params_tech_table_security_level": "Veiligheidsniveau",
  "detail_mail_tls_fs_params_verdict_bad": "Tenminste één van je mailservers ondersteunt <em>onvoldoende</em> veilige parameters voor Diffie-Hellman-sleuteluitwisseling.",
  "detail_mail_tls_fs_params_verdict_good": "Je mailserver ondersteunt voldoende veilige parameters voor Diffie-Hellman-sleuteluitwisseling.",
  "detail_mail_tls_fs_params_verdict_na": "Deze subtest is niet van toepassing, omdat je mailservers <em>niet</em> Diffie-Hellman-sleuteluitwisseling ondersteunen. Let op: RSA is een alternatief voor sleuteluitwisseling, maar heeft de status <em>uit te faseren</em>.",
  "detail_mail_tls_fs_params_verdict_phase_out": "Tenminste één van je mailservers ondersteunt parameters voor Diffie-Hellman-sleuteluitwisseling die de status <em>uit te faseren</em> hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_mail_tls_kex_hash_func_exp": "<p>We testen of je mailservers (MX) ondersteuning bieden voor veilige hashfuncties om tijdens sleuteluitwisseling de digitale handtekening te maken.</p><p>Een ontvangende mailserver maakt tijdens de sleuteluitwisseling gebruik van een digitale handtekening om het eigenaarschap te bewijzen van de geheime sleutel die bij het certificaat hoort. De mailserver creëert deze digitale handtekening door het ondertekenen van de output van een hashfunctie.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, tabel 5.</p><p><em>Niveau van vereistheid: Aanbevolen</em></p><hr /><p><strong>SHA2-ondersteuning voor handtekeningen</strong></p><ul><li>Goed: Ja (ondersteuning van SHA-256, SHA-384 of SHA-512)</li><li>Uit te faseren: Nee (<em>geen</em> ondersteuning van SHA-256, SHA-384 of SHA-512)</li></ul>",
  "detail_mail_tls_kex_hash_func_label": "Hashfunctie voor sleuteluitwisseling",
  "detail_mail_tls_kex_hash_func_tech_table": "Mailserver (MX)|SHA-2-ondersteuning voor handtekeningen",
  "detail_mail_tls_kex_hash_func_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_kex_hash_func_tech_table_sha2_support_for_signatures": "SHA-2-ondersteuning voor handtekeningen",
  "detail_mail_tls_kex_hash_func_verdict_good": "Al je mailservers ondersteunen veilige hashfuncties voor sleuteluitwisseling.",
  "detail_mail_tls_kex_hash_func_verdict_other": "Het was niet mogelijk om vast te stellen welke hashfunctie tenminste één van je mailservers gebruikt. Dit kan veroorzaakt worden doordat de gebruikte cipher-combinatie geen handtekening voor certificaatverificatie heeft (bijv. deze gebruikt RSA-sleuteluitwisseling of is anoniem d.w.z. <code>anon</code>).",
  "detail_mail_tls_kex_hash_func_verdict_phase_out": "Ten minste één van je mailservers ondersteunt <em>geen</em> veilige hashfunctie voor sleuteluitwisseling. Deze instelling dien je weloverwogen <em>uit te faseren</em>, omdat deze het risico loopt in de toekomst <em>onvoldoende</em> veilig te worden.  ",
  "detail_mail_tls_ocsp_stapling_exp": "OUTDATED TEXT; TEST NOT USED <br />TODO",
  "detail_mail_tls_ocsp_stapling_label": "OUTDATED TEXT; TEST NOT USED <br />TODO",
  "detail_mail_tls_ocsp_stapling_tech_table": "OUTDATED TEXT; TEST NOT USED<br />Mailserver (MX)|TODO",
  "detail_mail_tls_ocsp_stapling_tech_table_outdated_text_test_not_used_mail_server_mx": "OUTDATED TEXT; TEST NOT USED<br />Mailserver (MX)",
  "detail_mail_tls_ocsp_stapling_tech_table_ocsp_stapling": "TODO",
  "detail_mail_tls_ocsp_stapling_verdict_bad": "OUTDATED TEXT; TEST NOT USED<br />TODO",
  "detail_mail_tls_ocsp_stapling_verdict_good": "OUTDATED TEXT; TEST NOT USED<br />TODO",
  "detail_mail_tls_ocsp_stapling_verdict_ok": "OUTDATED TEXT; TEST NOT USED<br />TODO",
  "detail_mail_tls_renegotiation_client_exp": "<p>We testen of een verzendende mailserver een renegotiation kan initiëren met jouw ontvangende mailservers (MX). </p><p>In het algemeen is het niet nodig om clients de mogelijkheid te bieden om een renegotiation te initiëren (client-initiated renegotiation). Bovendien komt een ontvangende mailserver hierdoor binnen een TLS-verbinding bloot te staan aan DoS-aanvallen. Een aanvaller kan ook zonder renegotiation op initiatief van een client soortgelijke DoS-aanvallen uitvoeren door veel parallelle TLS-verbindingen te openen. Dergelijke aanvallen zijn echter eenvoudiger te traceren en met de standaardmaatregelen te mitigeren. Merk op dat client-initiated renegotiation impact heeft op de beschikbaarheid en niet op de vertrouwelijkheid.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn 8-1 en tabel 13.</p><p><em>Niveau van vereistheid: Optioneel</em></p><hr /><p><strong>Client-initiated renegotiation</strong></p><ul><li>Goed: Uit (of n.v.t. voor TLS 1.3)</li><li>Voldoende: Aan</li></ul>",
  "detail_mail_tls_renegotiation_client_label": "Client-initiated renegotiation",
  "detail_mail_tls_renegotiation_client_tech_table": "Mailserver (MX)|Client-initiated renegotiation",
  "detail_mail_tls_renegotiation_client_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_renegotiation_client_tech_table_client_initiated_renegotiation": "Client-initiated renegotiation",
  "detail_mail_tls_renegotiation_client_verdict_bad": "Tenminste één van je mailservers staat client-initiated renegotiation toe, wat een negatieve invloed kan hebben op de beschikbaarheid van je mailserver.",
  "detail_mail_tls_renegotiation_client_verdict_good": "Al je mailservers staan geen client-initiated renegotiation toe.",
  "detail_mail_tls_renegotiation_secure_exp": "<p>We testen of je mailservers (MX) secure renegotiation ondersteunen. </p><p>In de oudere versies van TLS (vóór TLS 1.3) is het tot stand brengen van een nieuwe handshake toegestaan. Dit zogeheten 'opnieuw onderhandelen' (renegotiation) was in het oorspronkelijke ontwerp onveilig. Inmiddels is de standaard gerepareerd en is er een veiliger renegotiation-mechanisme beschikbaar. De oude versie wordt sindsdien als insecure renegotiation aangeduid en deze moet derhalve uitgeschakeld worden.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B8-1 en tabel 12.</p><hr /><p><strong>Insecure renegotiation</strong></p><ul><li>Goed: Uit (of n.v.t. voor TLS 1.3)</li><li>Onvoldoende: Aan </li></ul>",
  "detail_mail_tls_renegotiation_secure_label": "Secure renegotiation",
  "detail_mail_tls_renegotiation_secure_tech_table": "Mailserver (MX)|Secure renegotiation",
  "detail_mail_tls_renegotiation_secure_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_renegotiation_secure_tech_table_secure_renegotiation": "Secure renegotiation",
  "detail_mail_tls_renegotiation_secure_verdict_bad": "Tenminste één van je mailservers ondersteunt insecure renegotiation, wat uiteraard <em>niet</em> veilig is.",
  "detail_mail_tls_renegotiation_secure_verdict_good": "Al je mailservers ondersteunen secure renegotiation.",
  "detail_mail_tls_starttls_exists_exp": "We testen of je ontvangende mailservers (MX) ondersteuning bieden voor STARTTLS. Als dat het geval is, dan testen we in de subtesten van deze testcategorie of STARTTLS ook voldoende veilig is geconfigureerd. </p><p>Vanwege performance-redenen worden maximaal tien mailservers via of IPv6 of IPv4 getest voor STARTTLS en DANE.</p><p>Merk op dat de e-mailtest <em>niet</em> terugvalt op A/AAAA-records voor mailservers in geval van afwezigheid van een MX-record.</p><p><em>Niet ontvangende domeinnaam</em>:</p><ol><li>Null MX: Indien je geen mail wenst te ontvangen op je domeinnaam die A/AAAA-records heeft, dan adviseren we om \"Null MX\" (<a href=\"https://www.rfc-editor.org/rfc/rfc7505\">RFC 7505</a>) te gebruiken. Merk op dat een \"Null MX record\" niet gecombineerd dient te worden met een gewoon MX-record dat naar een mail-host wijst.</li><li><p>Geen MX: In het geval dat je domein geen A/AAAA-records heeft en je er geen mail op wenst te ontvangen, adviseren we je om helemaal geen MX-record te configureren (dus ook geen \"Null MX\" record). </p></li><li><p>Als we een van de twee bovenstaande gevallen ontdekken, zijn de subtesten in de STARTTLS- en DANE-categorie niet van toepassing. Dit geldt ook voor de mailserver-specifieke subtests in de categorieën voor IPv6 en DNSSEC. Andere subtesten van de e-mailtest (bijv. voor DMARC) zijn nog steeds van toepassing.</p></li><li>Merk op dat het hebben van een \"Null MX\"-record of geen MX-record ook van invloed kan zijn op het verzenden van e-mail, omdat ontvangende servers e-mail kunnen weigeren die een ongeldig retouradres heeft.</li></ol><p>Voor een \"good practice voor domeinnamen zonder mail\" zie de <a href=\"#control-panel-9\">uitleg van de \"DMARC-policy\" subtest</a>.",
  "detail_mail_tls_starttls_exists_label": "STARTTLS beschikbaar",
  "detail_mail_tls_starttls_exists_tech_table": "Mailserver (MX)|STARTTLS",
  "detail_mail_tls_starttls_exists_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_starttls_exists_tech_table_starttls": "STARTTLS",
  "detail_mail_tls_starttls_exists_verdict_bad": "Tenminste één van je mailservers biedt <em>geen</em> STARTTLS aan.",
  "detail_mail_tls_starttls_exists_verdict_good": "Al je mailservers bieden STARTTLS aan.",
  "detail_mail_tls_starttls_exists_verdict_invalid_null_mx": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "detail_mail_tls_starttls_exists_verdict_no_null_mx": "Er zijn geen ontvangende mailservers (MX) ingesteld op je domein dat A/AAAA-records heeft en dat een SPF-record heeft met alleen de term <code>-all</code>. We raden je aan een \"Null MX\" record in te stellen om expliciet aan te geven dat je domein geen e-mail accepteert. Vanwege je configuratie zijn de subtests in de categorie STARTTLS en DANE en de mailserver-specifieke subtests in de categorieën IPv6 en DNSSEC niet van toepassing.",
  "detail_mail_tls_starttls_exists_verdict_null_mx": "Je domeinnaam die A/AAAA-records heeft, geeft met een \"Null MX\" record duidelijk aan geen e-mail te accepteren. Dat is prima als je geen e-mail wilt ontvangen. Gebruik geen \"Null MX\"-record en stel een MX in als je wel e-mail wil verzenden vanaf deze domeinnaam, aangezien ontvangende servers e-mail met een ongeldig retouradres kunnen weigeren.",
  "detail_mail_tls_starttls_exists_verdict_null_mx_with_other_mx": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "detail_mail_tls_starttls_exists_verdict_null_mx_without_a_aaaa": "Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is.",
  "detail_mail_tls_starttls_exists_verdict_other": "Tenminste één van je mailservers is onbereikbaar.",
  "detail_mail_tls_starttls_exists_verdict_other_2": "Het SPF-record op je domeinnaam geeft aan dat je domeinnaam kan worden gebruikt voor het verzenden van e-mail. Je domeinnaam heeft echter geen ontvangende mailserver (MX), wat de bezorgbaarheid van je verzonden e-mail kan belemmeren omdat het ontbreken van een MX door ontvangers kan worden gezien als een indicator voor spam. Als je daarom echt mail vanaf deze domeinnaam wilt verzenden, configureer dan een MX. Als je echter geen mail wilt versturen vanaf deze domeinnaam, configureer dan een SPF-record met alleen de term <code>-all</code> en daarnaast een \"Null MX\" record als je domeinnaam A/AAAA-records heeft. Vanwege je configuratie zijn de subtests in de categorie STARTTLS en DANE en de mailserver-specifieke subtests in de categorieën IPv6 en DNSSEC niet van toepassing.",
  "detail_mail_tls_version_exp": "<p>We testen of je ontvangende mailservers (MX) alleen veilige TLS-versies ondersteunen. </p><p>Een mailserver kan meer dan één TLS-versie ondersteunen.</p><p>Merk op dat behoorlijk wat mailservers alleen oudere TLS-versies ondersteunen. Als de verzendende en ontvangende mailserver niet allebei dezelfde TLS-versie ondersteunen, dan zullen ze doorgaans terugvallen op onversleuteld transport. Om die reden kan het raadzaam zijn om de TLS-versies met status 'uit te faseren' voorlopig te blijven ondersteunen. Maak op basis van loggegevens een weloverwogen keuze voor het uitzetten van deze 'uit te faseren' TLS-versies.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B1-1 en tabel 1</p><hr /><p><strong>Versie</strong></p><ul><li>Goed: TLS 1.3</li><li>Voldoende: TLS 1.2</li><li>Uit te faseren: TLS 1.1 en 1.0</li><li>Onvoldoende: SSL 3.0, 2.0 en 1.0</li></ul>",
  "detail_mail_tls_version_label": "TLS-versie",
  "detail_mail_tls_version_tech_table": "Mailserver (MX)|TLS-versies|Status",
  "detail_mail_tls_version_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_version_tech_table_tls_versions": "TLS-versies",
  "detail_mail_tls_version_tech_table_status": "Status",
  "detail_mail_tls_version_verdict_bad": "Tenminste één van je mailservers ondersteunt een of meer <em>onvoldoende</em> veilige TLS-versies.",
  "detail_mail_tls_version_verdict_good": "Al je mailservers ondersteunen alleen veilige TLS-versies.",
  "detail_mail_tls_version_verdict_phase_out": "Tenminste één van je mailservers ondersteunt een of meer TLS-versies die je weloverwogen dient <em>uit te faseren</em>, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_mail_tls_zero_rtt_exp": "<p>We testen of je mailservers (MX) Zero Round Trip Time Resumption (0-RTT) ondersteunen.</p><p>0-RTT is een optie in TLS 1.3 waarmee applicatiedata wordt getransporteerd tijdens het eerste handshake-bericht. 0-RTT biedt echter geen bescherming tegen replay-aanvallen op de TLS-laag en dient daarom uitgezet te worden. Alhoewel het risico gemitigeerd kan worden door 0-RTT niet toe te staan voor non-idempotent requests, is een dergelijke configuratie vaak niet triviaal, afhankelijk van applicatielogica en daardoor foutgevoelig.</p><p>Als je mailservers geen TLS 1.3 ondersteunen, dan is deze test niet van toepassing. Voor mailservers die TLS 1.3 ondersteunen, wordt het STARTTLS-commando gegeven en wordt een TLS-sessie geïnitieerd. De omvang van de ondersteuning voor <a href=\"https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html\">early data</a> zoals <a href=\"https://www.rfc-editor.org/rfc/rfc8446#section-4.2.10\">aangegeven</a> door de mailserver wordt gecontroleerd. Indien deze groter is dan nul, dan wordt een tweede verbinding gemaakt waarbij de TLS-sessiedetails van de eerste connectie worden hergebruikt, maar waarbij het EHLO-commando vóór de TLS handshake maar na het STARTTLS-commando plaatsvindt (d.w.z. geen round trips (0-RTT) nodig voordat applicatiedata naar de server gaat). Als de TLS handshake slaagt en de mailserver antwoordt, dan wordt aangenomen dat de mailserver 0-RTT ondersteunt.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B9-1 en tabel 14.</p><hr /><p><strong>0-RTT</strong></p><ul><li>Goed: Uit (of n.v.t. voor oudere versies dan TLS 1.3)</li><li>Onvoldoende: Aan</li></ul>",
  "detail_mail_tls_zero_rtt_label": "0-RTT",
  "detail_mail_tls_zero_rtt_tech_table": "Mailserver (MX)|0-RTT",
  "detail_mail_tls_zero_rtt_tech_table_mail_server_mx": "Mailserver (MX)",
  "detail_mail_tls_zero_rtt_tech_table_0_rtt": "0-RTT",
  "detail_mail_tls_zero_rtt_verdict_bad": "Tenminste één van je mailservers ondersteunt 0-RTT, wat <em>niet</em> veilig is.",
  "detail_mail_tls_zero_rtt_verdict_good": "Geen van je mailservers ondersteunen 0-RTT.",
  "detail_mail_tls_zero_rtt_verdict_na": "Deze subtest is niet van toepassing aangezien je mailservers TLS 1.3 niet ondersteunen.",
  "detail_tech_data_bogus": "bogus",
  "detail_tech_data_good": "goed",
  "detail_tech_data_http_csp_has_bare_https": "Aanbeveling: 'https:' schema zonder specifiek hoofddomein moet niet worden gebruikt (#9).",
  "detail_tech_data_http_csp_has_data": "Aanbeveling: 'data:' schema moet niet worden gebruikt waar dat niet is toegestaan (#7).",
  "detail_tech_data_http_csp_has_host_without_scheme": "Aanbeveling: Een domein zonder schema moet niet worden gebruikt (#8). ",
  "detail_tech_data_http_csp_has_http": "Aanbeveling: 'http:' schema moet niet worden gebruikt (#8).",
  "detail_tech_data_http_csp_has_invalid_host": "Aanbeveling: Een wildcard (d.w.z. '*') of '127.0.0.1' moeten niet worden gebruikt (#9 en #10).",
  "detail_tech_data_http_csp_has_unsafe_eval": "Aanbeveling: 'unsafe-eval' moet niet worden gebruikt (#6).",
  "detail_tech_data_http_csp_has_unsafe_hashes": "Aanbeveling: 'unsafe-hashes' moet niet worden gebruikt (#6).",
  "detail_tech_data_http_csp_has_unsafe_inline": "Aanbeveling: 'unsafe-inline' moet niet worden gebruikt (#6).",
  "detail_tech_data_http_csp_missing_invalid_base_uri": "Aanbeveling: 'base-uri' met voldoende veilige waarde moet zijn gedefinieerd (#2).",
  "detail_tech_data_http_csp_missing_invalid_default_src": "Aanbeveling: 'default-src' met voldoende veilige waarde moet zijn gedefinieerd (#1).",
  "detail_tech_data_http_csp_missing_invalid_form_action": "Aanbeveling: 'form-action' met voldoende veilige waarde moet zijn gedefinieerd (#5).",
  "detail_tech_data_http_csp_missing_invalid_frame_ancestors": "Aanbeveling: 'frame-ancestors' met voldoende veilige waarde moet zijn gedefinieerd (#4).",
  "detail_tech_data_http_csp_missing_invalid_frame_src": "Aanbeveling: 'frame-src' (of 'child-src' of 'default-src' als fallback) met voldoende veilige waarde moet zijn gedefinieerd (#3).",
  "detail_tech_data_http_csp_no_policy_found": "Geen CSP gevonden.",
  "detail_tech_data_http_csp_policy_found": "Opgehaalde CSP-waarde: {policy}",
  "detail_tech_data_http_referrer_policy_bad_invalid": "Slecht: policy-waarde is niet geldig.",
  "detail_tech_data_http_referrer_policy_bad_no_referrer_when_downgrade": "Slecht: 'no-referrer-when-downgrade' moet niet worden gebruikt.",
  "detail_tech_data_http_referrer_policy_bad_origin": "Slecht: 'origin' moet niet worden gebruikt.",
  "detail_tech_data_http_referrer_policy_bad_origin_when_cross_origin": "Slecht: 'origin-when-cross-origin' moet niet worden gebruikt.",
  "detail_tech_data_http_referrer_policy_bad_unsafe_url": "Slecht: 'unsafe-url' moet niet worden gebruikt.",
  "detail_tech_data_http_referrer_policy_no_policy": "Geen Referrer-Policy gevonden.",
  "detail_tech_data_http_referrer_policy_recommendation_strict_origin": "Aanbeveling: 'strict-origin' zou niet gebruikt moeten worden.",
  "detail_tech_data_http_referrer_policy_recommendation_strict_origin_when_cross_origin": "Aanbeveling: 'strict-origin-when-cross-origin' zou niet gebruikt moeten worden.",
  "detail_tech_data_http_referrer_policy_values": "Gevonden policy: {values}",
  "detail_tech_data_http_securitytxt_bom_in_file": "Fout: De Byte Order Mark (\"BOM\") handtekening moet niet voorkomen aan het begin van de inhoud die gecodeerd moet zijn met UTF-8 in Net-Unicode vorm.",
  "detail_tech_data_http_securitytxt_data_after_sig": "Fout: Ondertekende security.txt moet geen gegevens bevatten na de handtekening (regel {line_no}).",
  "detail_tech_data_http_securitytxt_empty_key": "Fout: Veldnaam moet niet leeg zijn (regel {line_no}).",
  "detail_tech_data_http_securitytxt_empty_value": "Fout: Veldwaarde moet niet leeg zijn (regel {line_no}).",
  "detail_tech_data_http_securitytxt_expired": "Fout: Datum en tijd in het veld 'Expires' moeten niet in het verleden liggen (regel {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_cert": "Fout: security.txt moet worden geserveerd met een geldig TLS-certificaat.</p><p>[Note: this content label is currently not used. See #1046.]",
  "detail_tech_data_http_securitytxt_invalid_charset": "Fout: Charset parameter in Content-Type header moet 'utf-8' zijn indien aanwezig.",
  "detail_tech_data_http_securitytxt_invalid_expiry": "Fout: Datum en tijd in het veld 'Expires' moeten worden geformatteerd conform ISO 8601 (regel {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_lang": "Fout: De waarde in het veld 'Preferred-Languages' moet overeenkomen met één of meer taal-tags zoals gedefinieerd in <a href=\"https://www.rfc-editor.org/rfc/rfc5646\">RFC 5646</a>, gescheiden door komma's (regel {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_line": "Fout: Regel moet een veldnaam en -waarde bevatten, tenzij de regel leeg is of een commentaar bevat (regel {line_no}).",
  "detail_tech_data_http_securitytxt_invalid_media": "Fout: Media type in Content-Type header moet 'text/plain' zijn.",
  "detail_tech_data_http_securitytxt_invalid_uri_scheme": "Fout: De toegang tot het bestand security.txt moet het HTTPS-schema gebruiken.</p><p>[Note: this content label is currently not used. See #1046.]",
  "detail_tech_data_http_securitytxt_location": "Fout: security.txt stond op het top-level pad (verouderde locatie), maar moet geplaatst worden onder het '/.well-known/' pad.",
  "detail_tech_data_http_securitytxt_long_expiry": "Aanbeveling: Datum en tijd in het veld 'Expires' zouden minder dan een jaar in de toekomst moeten liggen (regel {line_no}).",
  "detail_tech_data_http_securitytxt_multi_expire": "Fout: Het veld 'Expires' moet niet meer dan één keer voorkomen.",
  "detail_tech_data_http_securitytxt_multi_lang": "Fout: Het veld 'Preferred-Languages' moet niet meer dan één keer voorkomen.",
  "detail_tech_data_http_securitytxt_multiple_csaf_fields": "Aanbeveling: Meerdere 'CSAF'-velden zouden moeten worden teruggebracht tot één 'CSAF'-veld.",
  "detail_tech_data_http_securitytxt_no_canonical": "Aanbeveling: Het veld 'Canonical' zou aanwezig moeten zijn in een ondertekend bestand.",
  "detail_tech_data_http_securitytxt_no_canonical_match": "Fout: De web URI van security.txt (d.w.z. bij redirecting ten minste de laatste URI van de redirect-keten) moet worden vermeld in een 'Canonical'-veld als dat aanwezig is.",
  "detail_tech_data_http_securitytxt_no_contact": "Fout: Het veld 'Contact' moet minstens één keer voorkomen.",
  "detail_tech_data_http_securitytxt_no_content_type": "Fout: HTTP Content-Type header moet worden verstuurd.",
  "detail_tech_data_http_securitytxt_no_csaf_file": "Fout: Ieder optioneel 'CSAF'-veld moet verwijzen naar een bestand met de naam 'provider-metadata.json'.",
  "detail_tech_data_http_securitytxt_no_encryption": "Aanbeveling: Het veld 'Encryption' zou aanwezig moeten zijn wanneer het veld 'Contact' een e-mailadres bevat.",
  "detail_tech_data_http_securitytxt_no_expire": "Fout: Het veld 'Expires' moet aanwezig zijn.",
  "detail_tech_data_http_securitytxt_no_https": "Fout: De web URI moet beginnen met 'https://' (regel {line_no}).",
  "detail_tech_data_http_securitytxt_no_line_separators": "Fout: Elke regel moet eindigen met óf een carriage return en line feed characters óf alleen een line feed character.",
  "detail_tech_data_http_securitytxt_no_security_txt_404": "Fout: security.txt kon niet gevonden worden.",
  "detail_tech_data_http_securitytxt_no_security_txt_other": "Fout: security.txt kon niet gevonden worden (onverwachte HTTP response code {status_code}).",
  "detail_tech_data_http_securitytxt_no_space": "Fout: Veld-scheidingsteken (dubbele punt) moet worden gevolgd door een spatie (regel {line_no}).",
  "detail_tech_data_http_securitytxt_no_uri": "Fout: Veldwaarde moet een URI zijn (bijv. beginnend met 'mailto:') (regel {line_no}).",
  "detail_tech_data_http_securitytxt_not_signed": "Aanbeveling: security.txt zou digitaal ondertekend moeten zijn.",
  "detail_tech_data_http_securitytxt_pgp_data_error": "Fout: Ondertekende security.txt moet een correct 'ASCII-armored PGP block' bevatten.",
  "detail_tech_data_http_securitytxt_pgp_error": "Fout: Het decoderen of parsen van de ondertekende security.txt moet slagen.",
  "detail_tech_data_http_securitytxt_prec_ws": "Fout: Er mag geen spatie staan voor het veld-scheidingsteken (dubbele punt) (regel {line_no}).",
  "detail_tech_data_http_securitytxt_requested_from": "security.txt opgevraagd van {hostname}.",
  "detail_tech_data_http_securitytxt_retrieved_from": "security.txt opgehaald van {hostname}.",
  "detail_tech_data_http_securitytxt_signed_format_issue": "Fout: Ondertekende security.txt moet beginnen met de kop '-----BEGIN PGP SIGNED MESSAGE-----'.",
  "detail_tech_data_http_securitytxt_unknown_field": "Notificatie: security.txt bevat een onbekend veld. Ofwel het gaat om een aangepast veld dat misschien niet algemeen ondersteund wordt, ofwel er is sprake van een typfout in een gestandaardiseerde veldnaam (regel {line_no}).",
  "detail_tech_data_http_securitytxt_utf8": "Fout: Inhoud moet gecodeerd zijn met UTF-8 in Net-Unicode vorm.",
  "detail_tech_data_insecure": "insecure",
  "detail_tech_data_insufficient": "onvoldoende",
  "detail_tech_data_no": "nee",
  "detail_tech_data_not_applicable": "niet van toepassing",
  "detail_tech_data_not_reachable": "niet bereikbaar",
  "detail_tech_data_not_testable": "niet testbaar",
  "detail_tech_data_not_tested": "niet getest",
  "detail_tech_data_phase_out": "uit te faseren",
  "detail_tech_data_secure": "secure",
  "detail_tech_data_sufficient": "voldoende",
  "detail_tech_data_yes": "ja",
  "detail_verdict_could_not_test": "Testfout. Graag later opnieuw proberen.",
  "detail_verdict_not_tested": "Deze subtest is niet uitgevoerd, omdat een bovenliggende test waarvan deze subtest afhankelijk is een negatief testresultaat gaf, of omdat onvoldoende informatie beschikbaar was om de subtest uit te kunnen voeren. ",
  "detail_web_appsecpriv_http_csp_exp": "We testen of je webserver een HTTP-header voor <code>Content-Security-Policy</code> (CSP) aanbiedt. Verder controleren we op verschillende veilige CSP-instellingen, hoewel we de effectiviteit van je CSP-configuratie <em>niet</em> uitputtend testen. </p><p>CSP beschermt een website tegen aanvallen via content injection zoals cross-site scripting (XSS). Door met CSP een 'allowlist' met <em>bronnen van goedgekeurde content</em> in te stellen, kan je voorkomen dat browsers die jouw website tonen daarbij kwaadaardige content van aanvallers laden. </p><p>We testen op onderstaande regels die gebaseerd zijn op good pracrices voor een veilige CSP-configuratie.</p><ol><li>De <code>default-src</code> richtlijn moet zijn gedefinieerd en de waarde moet zijn óf <code>'none'</code>, óf <code>'self'</code> en/of één of meer URL's van het domein zelf (inclusief het subdomein of superdomein ervan). Dit is om een restrictief default fallback beleid te hebben voor bron-typen die gebruikt worden in je website waarvoor geen specifiek beleid is gedefinieerd. Naast deze waarden kan <code>'report-sample'</code> als waarde zijn ingesteld als je wil dat in de 'violation reports' code-voorbeelden worden opgenomen.</li><li>De <code>base-uri</code> richtlijn moet zijn gedefinieerd en de waarde moet zijn óf <code>'none'</code>, óf <code>'self'</code> en/of één of meer URL's van het domein zelf (inclusief  het subdomein of superdomein ervan). Dit limiteert de <code>baseURI</code> zodat de injectie van een gemanipuleerd <code>&lt;base&gt;</code> element wordt geblokkeerd. Dit beperkt de mogelijkheden van aanvallers om de locaties van bronnen (bijv. scripts) die vanaf relatieve URL's worden geladen te manipuleren.</li><li>De <code>frame-src</code> richtlijn moet zijn gebruikt (hetzij per definitie of via de fallback naar <code>child-src</code> en <code>default-src</code>) en de waarde moet zijn óf <code>'none'</code>, óf <code>'self'</code> en/of één of meer specifieke URL's. Dit voorkomt dat inhoud van niet-geautoriseerde locaties wordt geframed of ge-embed in je website (met HTML-elementen zoals <code>&lt;frame&gt;</code> en <code>&lt;iframe&gt;</code>).</li><li>De <code>frame-ancestors</code> richtlijn moet zijn gedefinieerd zijn en de waarde moet zijn óf <code>'none'</code>, óf <code>'self'</code> en/of één of meer specifieke URL's. Dit voorkomt dat ongeautoriseerde websites je website kunnen framen of embedden (met de HTML-elementen <code>&lt;frame&gt;</code>, <code>&lt;iframe&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;embed&gt;</code>, of <code>&lt;applet&gt;</code>).</li><li>De <code>form-action</code> richtlijn moet zijn gedefinieerd en de waarde ervan moet zijn óf <code>'none'</code>, óf <code>'self'</code> en/of één of meer specifieke URLs. Dit limiteert de URL's die gebruikt kunnen worden als doel voor formulierverzendingen.</li><li><code>unsafe-inline</code>, <code>unsafe-eval</code> en <code>unsafe-hashes</code> moeten <em>niet</em> gebruikt worden, omdat deze XSS-aanvallen mogelijk maken.</li><li><code>data:</code> moet <em>niet</em> gebruikt  worden in <code>default-src</code>, <code>script-src</code> en <code>object-src</code>, omdat dit XSS-aanvallen mogelijk maakt.</li><li>Een domein met het <code>http://</code> schema of een domein zonder schema moet <em>niet</em> worden gebruikt, omdat hiermee bronnen kunnen worden gedownload over een onveilige verbinding. Gebruik in plaats daarvan het <code>https://</code> schema.</li><li>Een wildcard (dat wil zeggen <code>*</code>) voor volledige host-gedeelte van een URL moet <em>niet</em> gebruikt worden in een CSP-richtlijn, omdat daardoor iedere externe bron is toegestaan. Gebruik bovendien <em>niet</em> alleen <code>https:</code> omdat dit gelijk staat aan <code>https://*</code>. Specificeer altijd het hoofddomein (bijvoorbeeld <code>https://scripts.example.nl</code> of <code>https://*.example.nl</code>). </li><li><code>127.0.0.1</code> moet <em>niet</em> gebruikt worden in een CSP-richtlijn, omdat dit aanvallen via content injection mogelijk maakt in een gecompromitteerd systeem.</li></ol><p>Aanvullende aanbevelingen:</p><ol><li><p>Sta alleen zo specifiek mogelijke domeinen toe in CSP-richtlijnen. Dit wordt in deze subtest voor CSP tot op zekere hoogte automatisch getest.</p><ul><li>Sta <em>niet</em> alle domeinen onder een TLD (<code>*.nl</code>) of SLD (<code>*.gov.uk</code>) toe, hoewel we hier momenteel <em>niet</em> op testen. </li><li>Sta <em>niet</em> een ander domein onder een SLD toe in <code>default-src</code> (bijvoorbeeld <code>voorbeeld2.gov.nl</code> voor <code>voorbeeld1.gov.nl</code>), hoewel we hier momenteel <em>niet</em> op testen.</li></ul></li><li><p>Gebruik <em>niet</em> inline scripts of styles. In gevallen waarin je het gebruik van inline scripts of styles niet kunt vermijden, gebruik dan <em>niet</em> <code>unsafe-inline</code> (zoals hierboven vermeld) maar gebruik bij voorkeur CSP-hashes of anders CSP-nonces.</p></li><li>Gebruik de HTTP-header als mechanisme voor het serveren van je CSP-beleid. Gebruik <em>niet</em> het HTML <code>&lt;meta&gt;</code> element om je CSP-beleid te serveren. Het laatste is minder veilig en ondersteunt niet alle CSP-richtlijnen (bijvoorbeeld niet het vereiste <code>frame-ancestors</code>). Daarom controleren we <em>niet</em> op CSP die wordt aangeboden via het HTML <code>&lt;meta&gt;</code>-element.</li><li>Gebruik de HTTP-header voor <code>Content-Security-Policy-Report-Only</code> om te experimenteren met je CSP-configuratie door het effect ervan te controleren maar nog niet af te dwingen.</li><li>Merk op dat een lege bronnenlijst (d.w.z. een CSP-richtlijn zonder waarde) gelijk is aan een bronnenlijst met <code>none</code>. Merk bovendien op dat als er andere bronnen in een bronnenlijst naast <code>none</code> staan, het attribuut <code>none</code> wordt genegeerd.</li></ol><p>Opmerking over IPv6/IPv4: vanwege performance-redenen worden alle testen in de categorie 'Beveiligingsopties' alleen uitgevoerd voor het eerste beschikbare IPv6- en IPv4-adres.</p><p>Zie ook <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Webapplicatie-richtlijnen van NCSC, Verdieping'</a>, richtlijn U/PW.03.</p><p><em>Niveau van vereistheid: Aanbevolen</em>",
  "detail_web_appsecpriv_http_csp_label": "Content-Security-Policy",
  "detail_web_appsecpriv_http_csp_tech_table": "Webserver-IP-adres|Bevindingen",
  "detail_web_appsecpriv_http_csp_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_appsecpriv_http_csp_tech_table_findings": "Bevindingen",
  "detail_web_appsecpriv_http_csp_verdict_bad": "Je webserver biedt <em>geen</em> Content-Security-Policy (CSP) aan, of biedt CSP aan met bepaalde <em>onveilige</em> instellingen .",
  "detail_web_appsecpriv_http_csp_verdict_good": "Je webserver biedt Content-Security-Policy (CSP) aan en maakt geen gebruik van bepaalde onveilige CSP-instellingen.",
  "detail_web_appsecpriv_http_referrer_policy_exp": "We testen of je webserver een HTTP-header voor <code>Referrer-Policy</code> aanbiedt met een voldoende veilige en privacybeschermende policy-waarde. Met deze policy instrueert je webserver browsers of, wat en wanneer referrer-gegevens moeten worden verzonden naar de website waar de gebruiker naartoe navigeert vanaf jouw website. Deze referrer-gegevens worden in de <code>Referer</code>-header door de browser verzonden naar de website waar de gebruiker naartoe navigeert. Deze navigatie hoeft niet per se domeinoverschrijdend te zijn.</p><p>De gegevens in de <code>Referer</code> header worden meestal gebruikt voor analytics en logging. Er kunnen echter privacy- en beveiligingsrisico's zijn. De gegevens kunnen bijvoorbeeld worden gebruikt voor het volgen van gebruikers en de gegevens kunnen uitlekken naar derden die de verbinding afluisteren. Met de HTTP-header voor <code>Referrer-Policy</code> kun je deze risico's beperken door het verzenden van referrer-gegevens te controleren en zelfs te minimaliseren.</p><p>We raden je aan om een weloverwogen beslissing te nemen, met privacy- en beveiligingsrisico's in gedachten, over het gebruik van een van de policy-waarden uit de eerste twee categorieën hieronder.</p><p><strong>1. Goed</strong> </p><ul><li><code>no-referrer</code></li><li><code>same-origin</code></li></ul><p>Met deze policy-waarden worden er geen gevoelige referrer-gegevens naar derden verzonden.</p><p><strong>2. Waarschuwing</strong> </p><ul><li><code>strict-origin</code></li><li><code>strict-origin-when-cross-origin</code> (default waarde van browsers; zie ook onder aanvullende opmerking 2)</li></ul><p>Met deze policy-waarden worden basis referrer-gegevens, die gevoelig kunnen zijn, alleen via beveiligde verbindingen (HTTPS) naar derden verzonden. Daarom zouden deze waarden alleen gebruikt moeten worden als dit noodzakelijk en wettelijk toegestaan is.</p><p><strong>3. Slecht</strong></p><ul><li><code>no-referrer-when-downgrade</code></li><li><code>origin-when-cross-origin</code></li><li><code>origin</code></li><li><code>unsafe-url</code></li></ul><p>Met deze policy-waarden worden alle of alleen basis referrer-gegevens, die gevoelig kunnen zijn, mogelijk via onveilige verbindingen (HTTP) naar derden verzonden. Daarom moeten deze waarden niet worden gebruikt.</p><p><strong>Aanvullende opmerkingen:</strong></p><ol><li>Om het lekken van gevoelige gegevens via URL's te voorkomen, moet u ervoor zorgen dat URL's van uw website geen persoonlijke of anderszins gevoelige gegevens bevatten (zoals persoonlijke namen of wachtwoorden).</li><li><code>strict-origin-when-cross-origin</code> is de default policy-waarde wanneer er geen <code>Referrer-Policy</code> is gepubliceerd zoals voorgeschreven in de huidige \"Editor's Draft\" van de <code>Referrer-Policy</code> standaard en deze default wordt gebruikt door alle nieuwste grote browsers. Merk op dat sommige gebruikers nog steeds een ander default waarde geconfigureerd kunnen hebben in hun browser.</li><li>Gebruik de HTTP <code>Referrer-Policy</code> header als mechanisme om je referrer policy aan te bieden. We raden <em>niet</em> aan om het HTML <code>&lt;meta&gt;</code> element of het HTML <code>referrerpolicy</code> content attribuut te gebruiken om je referrer policy te publiceren, vooral omdat de secties die deze methoden beschrijven in de standaard gemarkeerd zijn als \"niet normatief\". Daarom controleren we niet op een referrer policy die wordt aangeboden via de laatste twee methoden.</li><li>Merk op dat een webserver meerdere <code>Referrer-Policy</code> headers kan sturen, en dat een <code>Referrer-Policy</code> header meerdere waarden kan bevatten. Onbekende waarden worden genegeerd door de browser en alleen de laatst bekende waarde wordt gebruikt. Dit maakt het mogelijk om toekomstig gestandaardiseerde policy-waarden te gebruiken die nog niet door alle browsers worden ondersteund. Op dit moment ondersteunen echter alle nieuwste grote browsers de bovenstaande policy-waarden onder \"Goed\" en \"Waarschuwing\".</li></ol><p>Opmerking over IPv6/IPv4: vanwege performance-redenen worden alle testen in de categorie 'Beveiligingsopties' alleen uitgevoerd voor het eerste beschikbare IPv6- en IPv4-adres.</p><p><em>Niveau van vereistheid: Aanbevolen</em>",
  "detail_web_appsecpriv_http_referrer_policy_label": "Referrer-Policy",
  "detail_web_appsecpriv_http_referrer_policy_tech_table": "Webserver-IP-adres|Bevindingen",
  "detail_web_appsecpriv_http_referrer_policy_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_appsecpriv_http_referrer_policy_tech_table_findings": "Bevindingen",
  "detail_web_appsecpriv_http_referrer_policy_verdict_bad": "Je webserver biedt een Referrer-Policy aan met een policy-waarde die <em>niet</em> voldoende veilig en privacybeschermend is.",
  "detail_web_appsecpriv_http_referrer_policy_verdict_good": "Je webserver biedt een Referrer-Policy aan met een policy-waarde die voldoende veilig en privacybeschermend is.",
  "detail_web_appsecpriv_http_referrer_policy_verdict_recommendations": "Je webserver biedt ofwel geen Referrer-Policy aan en vertrouwt dus op de standaard browserpolicy, óf je webserver biedt een Referrer-Policy aan met een policy-waarde die met terughoudendheid moet worden gebruikt vanwege de mogelijke impact op beveiliging en privacy.",
  "detail_web_appsecpriv_http_securitytxt_exp": "We testen of je webserver een <code>security.txt</code> bestand op de juiste locatie aanbiedt, of het opgehaald kan worden, en of de inhoud ervan syntactisch geldig is. </p><p><code>security.txt</code> is een tekstbestand met contactinformatie dat je op je webserver plaatst. Beveiligingsonderzoekers kunnen deze informatie gebruiken om direct contact met de juiste afdeling of persoon binnen je organisatie op te nemen over kwetsbaarheden die zij in je website of IT-systemen hebben gevonden. Dit kan het verhelpen van gevonden kwetsbaarheden versnellen, waardoor kwaadwillenden minder kans hebben om er misbruik van te maken. </p><p>Het formaat van het bestand is bedoeld om machinaal en menselijk leesbaar te zijn. De contactinformatie kan een e-mailadres, een telefoonnummer en/of een webpagina (bijvoorbeeld een webformulier) zijn. Merk op dat gepubliceerde contactinformatie openbaar is en ook kan worden misbruikt, bijvoorbeeld om spam te sturen naar een gepubliceerd e-mailadres.</p><p>Naast contactinformatie moet het <code>security.txt</code> bestand ook een vervaldatum bevatten. Om te voorkomen dat de informatie niet meer actueel is, wordt aanbevolen een vervaldatum op te nemen die minder dan een jaar in de toekomst ligt. Het is optioneel om ook andere relevante informatie voor beveiligingsonderzoekers op te nemen, zoals een link naar je beleid voor het omgaan met meldingen van beveiligingskwetsbaarheden (meestal Coordinated Vulnerability Disclosure policy genoemd).</p><p>Het wordt aanbevolen om het <code>security.txt</code> bestand te ondertekenen met PGP en daarbij de web URI waarop het bestand staat in een <code>Canonical</code> veld op te nemen. We controleren of het <code>security.txt</code> bestand ondertekend is. We valideren de handtekening echter <em>niet</em>, omdat er helaas geen gestandaardiseerde plaats is om een publieke PGP-sleutel (die nodig is voor handtekeningvalidatie) op te halen.</p><p>Als een of meer <code>Canonical</code> velden aanwezig zijn, moet de web URI van het <code>security.txt</code> bestand in een <code>Canonical</code> veld staan. Bij het redirecten naar een <code>security.txt</code> bestand moet ten minste de laatste URI van de redirect-keten in een <code>Canonical</code> veld worden vermeld.</p><p>Het bestand moet gepubliceerd worden onder het <code>/.well-known/</code> pad. Merk op dat het plaatsen onder het top-level pad verouderd is. Elk web(sub)domein dient zijn eigen <code>security.txt</code> bestand te hebben. Een voorbeeldbestand is te vinden op <a href=\"https://example.nl/.well-known/security.txt\"><code>https://example.nl/.well-known/security.txt</code></a>.</p><p>Met een redirect doorverwijzen naar een <code>security.txt</code> op een andere domeinnaam is toegestaan. Vooral in het geval van een grote domeinnaamportfolio is het vanuit onderhoudsperspectief aan te raden om de domeinnamen te redirecten naar een centrale <code>security.txt</code>.</p><p>Merk op dat <code>security.txt</code> bestanden normaal gesproken slechts enkele kilobytes groot zijn. We lezen en evalueren daarom maximaal de eerste 100 kB van een gevonden <code>security.txt</code> bestand.</p><p>Opmerking over IPv6/IPv4: vanwege performance-redenen worden alle testen in de categorie 'Beveiligingsopties' alleen uitgevoerd voor het eerste beschikbare IPv6- en IPv4-adres.</p><p><em>Niveau van vereistheid: Aanbevolen</em>",
  "detail_web_appsecpriv_http_securitytxt_label": "security.txt",
  "detail_web_appsecpriv_http_securitytxt_tech_table": "Webserver-IP-adres|Bevindingen",
  "detail_web_appsecpriv_http_securitytxt_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_appsecpriv_http_securitytxt_tech_table_findings": "Bevindingen",
  "detail_web_appsecpriv_http_securitytxt_verdict_bad": "Je webserver biedt <em>geen</em> security.txt-bestand op de juiste plaats aan, het kon <em>niet</em> worden opgehaald, of de inhoud ervan is syntactisch <em>niet</em> geldig.",
  "detail_web_appsecpriv_http_securitytxt_verdict_good": "Je webserver biedt een security.txt-bestand op de juiste plaats aan en de inhoud ervan is syntactisch geldig.",
  "detail_web_appsecpriv_http_securitytxt_verdict_recommendations": "Je webserver biedt een security.txt-bestand op de juiste plaats aan en de inhoud ervan is syntactisch geldig. Echter, er zijn een of meer aanbevelingen voor verbetering.",
  "detail_web_appsecpriv_http_x_content_type_exp": "We testen of je webserver een HTTP header voor <code>X-Content-Type-Options</code> aanbiedt. Met deze HTTP header kan je webbrowsers laten weten dat zij geen 'MIME type sniffing' mogen uitvoeren en altijd het <code>Content-Type</code> zoals gedeclareerd door jouw webserver moeten volgen. De enige geldige waarde voor deze HTTP header is <code>nosniff</code>. Indien actief, dan zal een browser verzoeken voor <code>style</code> en <code>script</code> blokkeren als deze geen corresponderende <code>Content-Type</code> (dat wil zeggen <code>text/css</code> of een 'Javascript MIME type' zoals <code>application/javascript</code>) hebben.</p><p>'MIME type sniffing' is een techniek waarbij de browser de inhoud van een bestand scant om te bepalen wat het formaat van het bestand is, ongeacht het door de webserver gedeclareerde <code>Content-Type</code>. Deze techniek is kwetsbaar voor de zogenaamde 'MIME confusion attack' waarbij de aanvaller de content van een bestand zodanig manipuleert dat de browser deze behandelt als een andere <code>Content-Type</code>, zoals een executeerbaar bestand.</p><p>Opmerking over IPv6/IPv4: vanwege performance-redenen worden alle testen in de categorie 'Beveiligingsopties' alleen uitgevoerd voor het eerste beschikbare IPv6- en IPv4-adres.</p><p><em>Niveau van vereistheid: Aanbevolen</em>",
  "detail_web_appsecpriv_http_x_content_type_label": "X-Content-Type-Options",
  "detail_web_appsecpriv_http_x_content_type_tech_table": "Webserver-IP-adres|X-Content-Type-Options waarde",
  "detail_web_appsecpriv_http_x_content_type_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_appsecpriv_http_x_content_type_tech_table_x_content_type_options_value": "X-Content-Type-Options waarde",
  "detail_web_appsecpriv_http_x_content_type_verdict_bad": "Je webserver biedt <em>geen</em> X-Content-Type-Options aan.",
  "detail_web_appsecpriv_http_x_content_type_verdict_good": "Je webserver biedt X-Content-Type-Options aan.",
  "detail_web_appsecpriv_http_x_frame_exp": "We testen of je webserver een HTTP header voor <code>X-Frame-Options</code> aanbiedt die een voldoende veilige instelling heeft. Met deze HTTP header kan je webbrowsers laten weten of het toegestaan is om jouw website te 'framen'. Het voorkomen van 'framen' beschermt bezoekers tegen aanvallen zoals clickjacking. We beschouwen de volgende waarden als voldoende veilig:</p><ul><li><code>DENY</code> ('framen' niet toegestaan); of</li><li><code>SAMEORIGIN</code> ('framen' alleen door je eigen website toegestaan).</li></ul><p>Alhoewel de waarde <code>ALLOW-FROM</code> (alleen genoemde websites mogen jouw website 'framen') onderdeel is van de specificatie voor<code>X-Frame-Options</code> (<a href=\"https://www.rfc-editor.org/rfc/rfc7034\">RFC 7034</a>), wordt deze <em>niet</em> ondersteund door moderne webbrowsers. Om die reden beschouwen we deze waarde <em>niet</em> als voldoende veilig.</p><p>Merk op dat <code>Content-Security-Policy</code> (<a href=\"#control-panel-29\">CSP</a>) via <code>frame-ancestors</code> vergelijkbare bescherming en daarnaast nog veel meer biedt voor bezoekers met moderne webbrowsers. Maar <code>X-Frame-Options</code> kan nog steeds bescherming bieden aan bezoekers van oudere browsers die geen CSP ondersteunen. Bovendien kan <code>X-Frame-Options</code> waardevolle bescherming aan alle bezoekers bieden, indien CSP niet (goed) is ingesteld voor de desbetreffende website.</p><p>Opmerking over IPv6/IPv4: vanwege performance-redenen worden alle testen in de categorie 'Beveiligingsopties' alleen uitgevoerd voor het eerste beschikbare IPv6- en IPv4-adres.</p><p>Zie ook <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Webapplicatie-richtlijnen van NCSC, Verdieping'</a>, richtlijn U/PW.03.</p><p><em>Niveau van vereistheid: Optioneel</em> ",
  "detail_web_appsecpriv_http_x_frame_label": "X-Frame-Options",
  "detail_web_appsecpriv_http_x_frame_tech_table": "Webserver-IP-adres|X-Frame-Options waarde",
  "detail_web_appsecpriv_http_x_frame_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_appsecpriv_http_x_frame_tech_table_x_frame_options_value": "X-Frame-Options waarde",
  "detail_web_appsecpriv_http_x_frame_verdict_bad": "Je webserver biedt <em>geen</em> veilig ingestelde X-Frame-Options aan.",
  "detail_web_appsecpriv_http_x_frame_verdict_good": "Je webserver biedt veilig ingestelde X-Frame-Options aan.",
  "detail_web_appsecpriv_http_x_xss_exp": "OUTDATED TEXT; TEST NOT USED</p><p>We testen of je webserver een HTTP header voor <code>X-XSS-Protection</code> aanbiedt die een voldoende veilige waarde heeft (dat wil zeggen <code>1</code> of <code>1; mode=block</code>). Deze HTTP header kan worden gebruikt om het beschermingsfilter van browsers tegen reflectieve cross-site scripting (XSS) aanvallen te activeren.</p><p>Geldige waardes voor de <code>X-XSS-Protection</code> header zijn:</p><ul><li><code>0</code> deactiveert het XSS-filter. Deze waarde dient NIET te worden gebruikt.</li><li><code>1</code> activeert het XSS-filter. Als een cross-site scripting aanval wordt gedetecteerd, dan zal de browser het script opschonen en de onveilige delen verwijderen. Deze waarde is normaal gesproken de standaard-waarde ('default') in browsers als een website geen <code>X-XSS-Protection</code> header aanbiedt. </li><li><code>1; mode=block</code> activeert het XSS-filter én de blokkeermodus. Als een cross-site scripting aanval wordt gedetecteerd, dan zal de browser het antwoord blokkeren en de webpagina niet laden. Dit is de aanbevolen waarde.</li></ul><p>Mits goed geconfigureerd kan <code>Content-Security-Policy</code> (CSP) vergelijkbare bescherming en meer bieden aan gebruikers van moderne webbrowsers. <code>X-XSS-Protection</code> biedt in dat geval nog altijd bescherming aan bezoekers van oudere browsers die geen CSP ondersteunen. Bovendien kan <code>X-XSS-Protection</code> waardevolle bescherming aan alle bezoekers bieden, indien CSP niet (goed) is ingesteld voor de desbetreffende website.</p><p><em>Niveau van vereistheid: Aanbevolen</em>",
  "detail_web_appsecpriv_http_x_xss_label": "OUTDATED TEXT; TEST NOT USED</p><p>X-XSS-Protection",
  "detail_web_appsecpriv_http_x_xss_tech_table": "OUTDATED TEXT; TEST NOT USED</p><p>Webserver-IP-adres|X-XSS-Protection waarde",
  "detail_web_appsecpriv_http_x_xss_tech_table_outdated_text_test_not_used_web_server_ip_address": "OUTDATED TEXT; TEST NOT USED</p><p>Webserver-IP-adres",
  "detail_web_appsecpriv_http_x_xss_tech_table_x_xss_protection_value": "X-XSS-Protection waarde",
  "detail_web_appsecpriv_http_x_xss_verdict_bad": "OUTDATED TEXT; TEST NOT USED</p><p>Je webserver biedt <em>geen</em> veilig ingestelde X-XSS-Protection aan.",
  "detail_web_appsecpriv_http_x_xss_verdict_good": "OUTDATED TEXT; TEST NOT USED</p><p>Je webserver biedt veilig ingestelde X-XSS-Protection aan.",
  "detail_web_dnssec_exists_exp": "We testen of je domeinnaam, meer specifiek het SOA-record, ondertekend is met DNSSEC.</p><p>Als een domein via  <code>CNAME</code> doorverwijst naar een ander domein, dan checken we (conform de DNSSEC-standaard) ook of het CNAME-domein ondertekend is met DNSSEC. Als het CNAME-domein niet ondertekend is, dan zal deze subtest een negatief resultaat tonen.</p><p>Let op: de geldigheid van de ondertekening wordt niet getest in deze subtest maar wel in de volgende subtest.",
  "detail_web_dnssec_exists_label": "DNSSEC aanwezigheid",
  "detail_web_dnssec_exists_tech_table": "Domein|Registrar",
  "detail_web_dnssec_exists_tech_table_domain": "Domein",
  "detail_web_dnssec_exists_tech_table_registrar": "Registrar",
  "detail_web_dnssec_exists_verdict_bad": "Je domein is onveilig oftewel 'insecure', omdat het <em>niet</em> ondertekend is met DNSSEC.",
  "detail_web_dnssec_exists_verdict_good": "Je domein is met DNSSEC ondertekend.",
  "detail_web_dnssec_exists_verdict_resolver_error": "Helaas is in de resolver van Internet.nl een fout opgetreden. Neem a.j.b. <a href=\"/about/\">contact</a> met ons op.",
  "detail_web_dnssec_exists_verdict_servfail": "De nameservers van je domeinnaam zijn <em>kapot</em>. Ze gaven een foutmelding (<code>SERVFAIL</code>) terug op onze bevragingen voor een DNSSEC-handtekening. Vraag de nameserver-beheerder (vaak je registrar en/of hostingprovider) om dit spoedig op te lossen.",
  "detail_web_dnssec_valid_exp": "We testen of je domeinnaam, meer specifiek het SOA-record, is ondertekend met een geldige DNSSEC-handtekening.</p><p>Als een domeinnaam via <code>CNAME</code> verwijst naar een ander ondertekend domeinnaam, dan checken we (conform de DNSSEC-standaard) ook of de ondertekening van het CNAME-domein geldig is. Als de ondertekening van de CNAME-domeinnaam niet geldig is, dan zal deze subtest een negatief resultaat tonen.</p><p>Merk op dat we alleen de nameserver testen die als eerste reageert. Als nameservers van een domeinnaam inconsistente configuraties hebben, kan dit leiden tot variërende testresultaten. In dat geval kan het resultaat voor deze subtest bijvoorbeeld de ene keer 'secure' en de andere keer 'bogus' zij",
  "detail_web_dnssec_valid_label": "DNSSEC geldigheid",
  "detail_web_dnssec_valid_tech_table": "Domein|Status",
  "detail_web_dnssec_valid_tech_table_domain": "Domein",
  "detail_web_dnssec_valid_tech_table_status": "Status",
  "detail_web_dnssec_valid_verdict_bad": "Je domeinnaam is onbetrouwbaar oftewel 'bogus', omdat de DNSSEC-handtekening <em>niet</em> geldig is. Óf iemand manipuleerde het antwoord van jouw nameserver, óf je domeinnaam heeft een <em>serieuze DNSSEC-configuratiefout</em>. Dit laatste maakt je domeinnaam onbereikbaar voor alle gebruikers die DNSSEC-handtekeningen controleren. Neem zo spoedig mogelijk contact op met je nameserver-beheerder (vaak je registrar of hostingprovider).",
  "detail_web_dnssec_valid_verdict_good": "Je domeinnaam is veilig oftewel 'secure', omdat zijn DNSSEC-handtekening geldig is.",
  "detail_web_dnssec_valid_verdict_unsupported_ds_algo": "Je domeinnaam is ondertekend met een algoritme dat onze validerende resolver momenteel nog niet ondersteunt. Daardoor zijn we niet in staat de geldigheid van zijn DNSSEC-handtekening te controleren.",
  "detail_web_ipv6_web_aaaa_exp": "We testen of er tenminste één AAAA-record met IPv6-adres voor je webserver is.</p><p>'IPv4-mapped IPv6 addresses' (<a href=\"https://www.rfc-editor.org/rfc/rfc4291\">RFC 4291</a>, beginnend met ::ffff:) zullen falen in deze subtest, aangezien zij <em>geen</em> IPv6-connectiviteit bieden.",
  "detail_web_ipv6_web_aaaa_label": "IPv6-adressen voor webserver",
  "detail_web_ipv6_web_aaaa_tech_table": "Webserver|IPv6-adres|IPv4-adres",
  "detail_web_ipv6_web_aaaa_tech_table_web_server": "Webserver",
  "detail_web_ipv6_web_aaaa_tech_table_ipv6_address": "IPv6-adres",
  "detail_web_ipv6_web_aaaa_tech_table_ipv4_address": "IPv4-adres",
  "detail_web_ipv6_web_aaaa_verdict_bad": "<em>Geen</em> van je webservers heeft een IPv6-adres.",
  "detail_web_ipv6_web_aaaa_verdict_good": "Tenminste één van je webservers heeft een IPv6-adres.",
  "detail_web_ipv6_web_ipv46_exp": "We vergelijken de beschikbare poorten en aangeboden headers en inhoud van je webserver via IPv6 met die via IPv4.</p><p>We controleren of:</p><ol><li>dezelfde poorten, dat wil zeggen HTTP (poort 80) en/of HTTPS (poort 443), beschikbaar zijn via zowel IPv6 als IPv4;</li><li>dezelfde HTTP-headers worden aangeboden via zowel IPv6 als IPv4. Dit omvat HTTP response codes, zoals 'successful responses' (200 – 299) en 'redirection messages' (300 – 399). Bij een 'client error response' (400 - 499) of een 'server error response' (500 - 599) wordt een waarschuwing zonder score-impact gegeven, omdat een dergelijke HTTP response code kan wijzen op een configuratieprobleem;</li><li>dezelfde HTML-inhoud wordt aangeboden via zowel IPv6 als IPv4. We doen dit door de ontvangen inhoud te vergelijken na het strippen van eventuele nonces. Het verschil in inhoud mag niet groter zijn dan 10% om te slagen voor deze subtest. Deze drempel zorgt ervoor dat kleine niet-problematische verschillen (bijvoorbeeld door veranderende advertenties) niet direct leiden tot een onvoldoende voor deze subtest. Een waargenomen verschil kan nog steeds bedoeld zijn of te maken hebben met een meetfout. Daarom leidt dit deel van de subtest in geval van falen alleen tot een waarschuwing zonder score-impact.</li></ol><p>Aanvullende opmerkingen:- Als er meerdere IPv6- en IPv4-adressen zijn, dan kiezen we één IPv6-adres en één IPv4-adres om de subtest uit te voeren.- Als er alleen een IPv6-adres en geen IPv4-adres (of omgekeerd) beschikbaar is, dan is de subtest niet van toepassing omdat er geen vergelijking kan worden gemaakt.- Deze subtest volgt redirects en controleert ook alle onderliggende URL's.",
  "detail_web_ipv6_web_ipv46_label": "Gelijke website op IPv6 en IPv4",
  "detail_web_ipv6_web_ipv46_verdict_bad": "Beschikbare poorten of aangeboden headers van je website via IPv4 zijn <em>niet</em> hetzelfde via IPv6.",
  "detail_web_ipv6_web_ipv46_verdict_good": "Je website via IPv6 lijkt identiek via IPv4.",
  "detail_web_ipv6_web_ipv46_verdict_notice": "De HTML-inhoud van je website via IPv4 is <em>niet</em> hetzelfde via IPv6. ",
  "detail_web_ipv6_web_ipv46_verdict_notice_status_code": "Je website via IPv6 lijkt identiek via IPv4, maar de HTTP response code is 4xx of 5xx. Dit kan wijzen op een configuratiefout.",
  "detail_web_ipv6_web_reach_exp": "We testen of we je webserver(s) kunnen bereiken via IPv6 op alle beschikbare poorten (80 en/of 443). We testen alle IPv6-adressen die we ontvangen van je nameservers. Een deelscore wordt gegeven als niet alle IPv6-adressen bereikbaar zijn. Als een IPv6-adres (syntactisch) ongeldig is, dan beschouwen we dat als onbereikbaar.",
  "detail_web_ipv6_web_reach_label": "IPv6-bereikbaarheid van webserver",
  "detail_web_ipv6_web_reach_tech_table": "Webserver|Onbereikbaar IPv6-adres",
  "detail_web_ipv6_web_reach_tech_table_web_server": "Webserver",
  "detail_web_ipv6_web_reach_tech_table_unreachable_ipv6_address": "Onbereikbaar IPv6-adres",
  "detail_web_ipv6_web_reach_verdict_bad": "Tenminste één van jouw webservers met een IPv6-adres, is <em>niet</em> bereikbaar via IPv6.",
  "detail_web_ipv6_web_reach_verdict_good": "Al je webservers met een IPv6-adres zijn bereikbaar via IPv6.",
  "detail_web_rpki_exists_exp": "We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van je webserver.</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen.</p><p>Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar je server wordt onderschept.</p><p>Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (<code>Invalid</code>) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.",
  "detail_web_rpki_exists_label": "Aanwezigheid van Route Origin Authorisation",
  "detail_web_rpki_exists_tech_table": "Webserver|IP-adres|RPKI Route Origin Authorization",
  "detail_web_rpki_exists_tech_table_web_server": "Webserver",
  "detail_web_rpki_exists_tech_table_ip_address": "IP-adres",
  "detail_web_rpki_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_web_rpki_exists_verdict_bad": "Voor tenminste één van de IP-adressen van je webserver is <em>geen</em> RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_web_rpki_exists_verdict_good": "Voor alle IP-adressen van je webserver is een RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_web_rpki_exists_verdict_no_addresses": "Je domein bevat <em>geen</em> IP-adressen van webservers. Daarom kon deze subtest niet worden uitgevoerd.",
  "detail_web_rpki_valid_exp": "We testen of de validatie-status van alle IP-adressen van je webserver <code>Valid</code> is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal <code>Valid</code> zijn.</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen.</p><p>Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). </p><p>Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. </p><p>De netwerkprovider kan deze inhoud vervolgens gebruiken om  BGP-routes te filteren. Hij kan bijvoorbeeld eventuele <code>Invalid</code> routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.</p><p>Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten.</p><p>1․ <code>Valid</code>: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het <code>maxLength</code> attribuut). </p><p>2․ <code>Invalid</code>: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht <em>niet</em>. Er zijn twee mogelijke oorzaken: </p><ul><li>het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie <em>niet</em> is geautoriseerd (resultaat in onderstaande tabel: \"invalid (as)\");</li><li>het IP-adresblok (Route Prefix) dat wordt aangekondigd is <em>kleiner</em> dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van <code>maxLength</code> waarde (resultaat in onderstaande tabel: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.</p><p><strong>Wat te doen als het testresultaat de status Invalid toont?</strong></p><p>De status <code>Invalid</code> duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. ",
  "detail_web_rpki_valid_label": "Geldigheid van route-aankondiging",
  "detail_web_rpki_valid_tech_table": "Webserver|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status",
  "detail_web_rpki_valid_tech_table_web_server": "Webserver",
  "detail_web_rpki_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_web_rpki_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_web_rpki_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation status",
  "detail_web_rpki_valid_verdict_bad": "Ten minste één IP-adres van je webserver heeft een <code>NotFound</code> validatie-status. Er is <em>geen</em> RPKI Route Origin Authorization (ROA) gepubliceerd voor de route-aankondiging van ieder van de desbetreffende IP-adressen.",
  "detail_web_rpki_valid_verdict_good": "Alle IP-adressen van je webserver hebben een <code>Valid</code> validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).",
  "detail_web_rpki_valid_verdict_invalid": "Tenminste één IP-adres van je webserver heeft een <code>Invalid</code> validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt <em>niet</em> gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je webhoster (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept.  Neem zo spoedig mogelijk contact op met je webhoster. Bij een interne fout moet je webhoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.",
  "detail_web_rpki_valid_verdict_not_routed": "Deze subtest werd <em>niet</em> uitgevoerd, omdat er voor <em>geen</em> van de IP-adressen een route-aankondiging beschikbaar was.",
  "detail_web_tls_cert_hostmatch_exp": "We testen of de domeinnaam van je website overeenkomt met de domeinnaam op het certificaat. </p><p>Het kan handig zijn om meerdere domeinnamen (bijvoorbeeld de domeinnaam met en zonder www) als Subject Alternative Name (SAN) in het certificaat op te nemen. </p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B3-1.",
  "detail_web_tls_cert_hostmatch_label": "Domeinnaam op certificaat",
  "detail_web_tls_cert_hostmatch_tech_table": "Webserver-IP-adres|Niet-overeenkomende domeinen op certificaat",
  "detail_web_tls_cert_hostmatch_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_cert_hostmatch_tech_table_unmatched_domains_on_certificate": "Niet-overeenkomende domeinen op certificaat",
  "detail_web_tls_cert_hostmatch_verdict_bad": "De domeinnaam van je website komt <em>niet</em> overeen met de domeinnaam op je websitecertificaat.",
  "detail_web_tls_cert_hostmatch_verdict_good": "De domeinnaam van je website komt overeen met de domeinnaam op je websitecertificaat.",
  "detail_web_tls_cert_pubkey_exp": "<p>We testen of de (ECDSA of RSA) digitale handtekening van je websitecertificaat veilige parameters gebruikt.</p><p>Bij de verificatie van certificaten wordt gebruik gemaakt van digitale handtekeningen. Om de authenticiteit van de verbindingte garanderen, moet een betrouwbaar algoritme voor certificaatverificatie gekozen worden. Het algoritme dat gebruikt wordt om een certificaat te ondertekenen, wordt door de certificaatleverancier geselecteerd.</p><p>Het certificaat specificeert het algoritme voor digitale handtekeningen dat tijdens de sleuteluitwisseling door zijn eigenaar wordt gebruikt. Het is mogelijk om meerdere certificaten te configureren, zodat er ook meer dan één algoritme ondersteund kan worden.</p><p>De veiligheid van de ECDSA-digitale-handtekeningen is afhankelijk van de geselecteerde kromme. De veiligheid van RSA voor de versleuteling en digitale handtekeningen houdt verband met de sleutellengte van de publieke sleutel.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B5-1 en tabel 9 voor ECDSA, en richtlijn B3-3 en tabel 8 voor RSA. </p><hr /><p><strong>Elliptische krommen voor ECDSA</strong></p><ul><li>Goed: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, and <code>x25519</code></li><li>Uit te faseren: <code>secp224r1</code></li><li>Onvoldoende: Andere krommen</li></ul><p><strong>Lengte van RSA-sleutels</strong></p><ul><li>Goed: Minimaal 3072 bit</li><li>Voldoende: 2048 – 3071 bit</li><li>Onvoldoende: Minder dan 2048 bit</li></ul>",
  "detail_web_tls_cert_pubkey_label": "Publieke sleutel van certificaat",
  "detail_web_tls_cert_pubkey_tech_table": "Webserver-IP-adres|Getroffen handtekening-parameters|Status",
  "detail_web_tls_cert_pubkey_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_cert_pubkey_tech_table_affected_signature_parameters": "Getroffen handtekening-parameters",
  "detail_web_tls_cert_pubkey_tech_table_status": "Status",
  "detail_web_tls_cert_pubkey_verdict_bad": "De digitale handtekening van je websitecertificaat gebruikt <em>onvoldoende</em> veilige parameters.",
  "detail_web_tls_cert_pubkey_verdict_good": "De digitale handtekening van je websitecertificaat gebruikt veilige parameters.",
  "detail_web_tls_cert_pubkey_verdict_phase_out": "De digitale handtekening van je websitecertificaat gebruikt parameters die de status <em>uit te faseren</em> hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_web_tls_cert_signature_exp": "<p>We testen of de ondertekende fingerprint van het websitecertificaat is gemaakt met een veilig algoritme voor hashing. </p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B3-2 en tabel 3.</p><hr /><p><strong>Hashfuncties voor certificaatverificatie</strong></p><ul><li>Goed: SHA-512, SHA-384, SHA-256</li><li>Onvoldoende: SHA-1, MD5</li></ul>",
  "detail_web_tls_cert_signature_label": "Handtekening van certificaat",
  "detail_web_tls_cert_signature_tech_table": "Webserver-IP-adres|Getroffen hashing-algoritme|Status",
  "detail_web_tls_cert_signature_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_cert_signature_tech_table_affected_hash_algorithm": "Getroffen hashing-algoritme",
  "detail_web_tls_cert_signature_tech_table_status": "Status",
  "detail_web_tls_cert_signature_verdict_bad": "Je websitecertificaat is ondertekend met een algoritme voor hashing dat <em>onvoldoende</em> veilig is.",
  "detail_web_tls_cert_signature_verdict_good": "Je websitecertificaat is ondertekend met een voldoende algoritme voor hashing.",
  "detail_web_tls_cert_trust_exp": "We testen of we een geldige vertrouwensketen voor je websitecertificaat kunnen opbouwen. </p><p>Er is sprake van een geldige vertrouwensketen, als je certificaat is uitgegeven door een <a href=\"https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/\">publiekelijk vertrouwde certificaatautoriteit</a> én je webserver alle noodzakelijke tussenliggende certificaten presenteert. </p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B3-4.",
  "detail_web_tls_cert_trust_label": "Vertrouwensketen van certificaat",
  "detail_web_tls_cert_trust_tech_table": "Webserver-IP-adres|Onvertrouwde certificaatketen",
  "detail_web_tls_cert_trust_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_cert_trust_tech_table_untrusted_certificate_chain": "Onvertrouwde certificaatketen",
  "detail_web_tls_cert_trust_verdict_bad": "De vertrouwensketen van je websitecertificaat is <em>niet</em> compleet en/of <em>niet</em> ondertekend door een vertrouwde certificaatautoriteit.",
  "detail_web_tls_cert_trust_verdict_good": "De vertrouwensketen van je websitecertificaat is compleet en ondertekend door een vertrouwde certificaatautoriteit.",
  "detail_web_tls_cipher_order_exp": "We testen of je webserver zijn eigen cipher-voorkeur afdwingt ('I'), en ciphers aanbiedt conform de voorgeschreven volgorde ('II').</p><p>Als je webserver alleen 'Goede' ciphers ondersteunt, dan is deze subtest niet van toepassing omdat de volgorde dan geen significant beveiligingsvoordeel oplevert.</p><p>I. <em>Server afgedwongen cipher-voorkeur</em>: De webserver dwingt zijn cipher-voorkeur af tijdens de onderhandeling met een webbrowser, en accepteert geen voorkeur van de webbrowser;</p><p>II. <em>Voorgeschreven volgorde</em>: Ciphers worden aangeboden door de webserver in overeenstemming met de voorgeschreven volgorde waarbij <em>Goede</em> boven <em>Voldoende</em> boven <em>Uit te faseren</em> ciphers worden geprefereerd. </p><p>In de bovenstaande tabel met technische details staan <strong>alleen de eerst gevonden algoritmeselecties die niet voldoen aan de voorgeschreven volgorde</strong>.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B2-5.",
  "detail_web_tls_cipher_order_label": "Cipher-volgorde",
  "detail_web_tls_cipher_order_tech_table": "Webserver IP-adres|Eerst gevonden getroffen cipher-paren|Overtreden regel # ('II-B')",
  "detail_web_tls_cipher_order_tech_table_web_server_ip_address": "Webserver IP-adres",
  "detail_web_tls_cipher_order_tech_table_first_found_affected_cipher_pair": "Eerst gevonden getroffen cipher-paren",
  "detail_web_tls_cipher_order_tech_table_violated_rule_ii_b": "Overtreden regel # ('II-B')",
  "detail_web_tls_cipher_order_verdict_bad": "Je webserver dwingt <em>niet</em> zijn eigen cipher-voorkeur af ('I').",
  "detail_web_tls_cipher_order_verdict_good": "Je webserver dwingt zijn eigen cipher-voorkeur af ('I'), en biedt ciphers aan conform de voorgeschreven volgorde ('II').",
  "detail_web_tls_cipher_order_verdict_na": "Deze subtest is niet van toepassing aangezien je webserver alleen 'Goede' ciphers ondersteunt.",
  "detail_web_tls_cipher_order_verdict_seclevel_bad": "Je webserver prefereert <em>niet</em> 'Goede' boven 'Voldoende' en dan pas 'Uit te faseren' ciphers ('II').",
  "detail_web_tls_cipher_order_verdict_warning": "OUTDATED TEXT; VERDICT NOT USED</p><p>Je webserver biedt <em>niet</em> ciphers aan conform de voorgeschreven volgorde binnen een bepaald veiligheidsniveau ('II-B').",
  "detail_web_tls_ciphers_exp": "<p>We testen of je webserver alleen veilige, d.w.z. 'Goede' en/of 'Voldoende', ciphers (ook algoritmeselecties genoemd) ondersteunt.</p><p>Een algoritmeselectie bestaat uit ciphers voor vier cryptografische functies: 1) sleuteluitwisseling, 2) certificaatverificatie, 3) bulkversleuteling, en 4) hashing. Een webserver kan meer dan één algoritmeselectie ondersteunen.</p><ul><li>Vanaf TLS 1.3 omvat de term 'cipher suite' alleen ciphers voor bulkversleuteling en hashing. Als TLS 1.3 gebruikt wordt dan zijn de ciphers voor sleuteluitwisseling en certificaatverificatie onderhandelbaar en niet langer onderdeel van de naam van de cipher suite. Omdat dit de term 'cipher suite' ambigu maakt, gebruikt NCSC de term 'algoritmeselectie' om alle vier de functies aan te duiden.</li><li>NCSC gebruikt de <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4\">IANA-naamgeving</a> voor algoritmeselecties. Internet.nl hanteert de <a href=\"https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES\">OpenSSL-naamgeving</a>. Vanaf TLS 1.3 volgt OpenSSL de IANA-naamgeving. Een vertaling tussen beide is onderdeel van de  OpenSSL-documentation.</li><li>Merk op dat ciphers die PSK of SRP gebruiken voor sleuteluitwisseling (die onvoldoende veilig zijn) in deze test niet worden gedetecteerd vanwege een beperking die samenhangt met onze testwijze. </li></ul><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B2-1 t/m B2-4 en tabel 2, 4, 6 en 7.</p><hr /><p>Hieronder staan 'Goede', 'Voldoende' en 'Uit te faseren' algoritmeselecties in de door NCSC voorgeschreven volgorde, gebaseerd op bijlage C van de 'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.0'. Achter iedere algoritmeselectie noemen we de minimale TLS-versie (bijv. [1.2]) die deze algoritmeselectie ondersteunt en die tenminste 'Uit te faseren' is.</p><p>Goed:</p><ul><li><code>ECDHE-ECDSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-ECDSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES256-GCM-SHA384</code> (<code>TLS_AES_256_GCM_SHA384</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-CHACHA20-POLY1305</code> (<code>TLS_CHACHA20_POLY1305_SHA256</code> in 1.3) [1.2]</li><li><code>ECDHE-RSA-AES128-GCM-SHA256</code> (<code>TLS_AES_128_GCM_SHA256</code> in 1.3) [1.2]</li></ul><p>Voldoende:</p><ul><li><code>ECDHE-ECDSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-ECDSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-ECDSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-ECDSA-AES128-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES256-SHA384</code> [1.2]</li><li><code>ECDHE-RSA-AES256-SHA</code> [1.0]</li><li><code>ECDHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>ECDHE-RSA-AES128-SHA</code> [1.0]</li><li><code>DHE-RSA-AES256-GCM-SHA384</code> [1.2]</li><li><code>DHE-RSA-CHACHA20-POLY1305</code> [1.2]</li><li><code>DHE-RSA-AES128-GCM-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES256-SHA</code> [1.0]</li><li><code>DHE-RSA-AES128-SHA256</code> [1.2]</li><li><code>DHE-RSA-AES128-SHA</code> [1.0]</li></ul><p>Uit te faseren:</p><ul><li><code>ECDHE-ECDSA-DES-CBC3-SHA</code> [1.0]</li><li><code>ECDHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>DHE-RSA-DES-CBC3-SHA</code> [1.0]</li><li><code>AES256-GCM-SHA384</code> [1.2]</li><li><code>AES128-GCM-SHA256</code> [1.2]</li><li><code>AES256-SHA256</code> [1.2]</li><li><code>AES256-SHA</code>  [1.0]</li><li><code>AES128-SHA256</code> [1.2]</li><li><code>AES128-SHA</code> [1.0]</li><li><code>DES-CBC3-SHA</code> [1.0]</li></ul>",
  "detail_web_tls_ciphers_label": "Ciphers (Algoritmeselecties)",
  "detail_web_tls_ciphers_tech_table": "Webserver-IP-adres|Getroffen ciphers|Status",
  "detail_web_tls_ciphers_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_ciphers_tech_table_affected_ciphers": "Getroffen ciphers",
  "detail_web_tls_ciphers_tech_table_status": "Status",
  "detail_web_tls_ciphers_verdict_bad": "Je webserver ondersteunt een of meer <em>onvoldoende</em> veilige ciphers.",
  "detail_web_tls_ciphers_verdict_good": "Je webserver ondersteunt alleen veilige ciphers.",
  "detail_web_tls_ciphers_verdict_phase_out": "Je webserver ondersteunt een of meer ciphers die de status <em>uit te faseren</em> hebben omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_web_tls_compression_exp": "<p>We testen of je webserver TLS-compressie ondersteunt. </p><p>Het gebruik van compressie kan een aanvaller informatie bieden over geheime delen van versleutelde communicatie. Een aanvaller die in staat is om een deel van de verzonden data te achterhalen of te beïnvloeden, kan door middel van een groot aantal verzoeken stukje bij beetje de oorspronkelijke data reconstrueren. TLS-compressie wordt zo weinig gebruikt dat het geen kwaadkan om deze optie uit te schakelen.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B7-1 en tabel 11.</p><hr /><p><strong>Compressie-optie</strong></p><ul><li>Goed: Geen compressie</li><li>Voldoende: Compressie op applicatieniveau (in dit geval HTTP-compressie)</li><li>Onvoldoende: TLS-compressie</li></ul>",
  "detail_web_tls_compression_label": "TLS-compressie",
  "detail_web_tls_compression_tech_table": "Webserver-IP-adres|TLS-compressie",
  "detail_web_tls_compression_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_compression_tech_table_tls_compression": "TLS-compressie",
  "detail_web_tls_compression_verdict_bad": "Je webserver ondersteunt TLS-compressie, wat <em>niet</em> veilig is.",
  "detail_web_tls_compression_verdict_good": "Je webserver ondersteunt geen TLS-compressie.",
  "detail_web_tls_dane_exists_exp": "We testen of de nameserver van je websitedomein een correct ondertekend TLSA-record voor DANE bevat. </p><p>Aangezien DNSSEC een noodzakelijke randvoorwaarde is voor DANE, zal een domeinnaam niet slagen voor de test als DNSSEC ontbreekt op het websitedomein, of als er DANE-gerelateerde DNSSEC-issues zijn (bijv. geen bewijs voor 'Denial of Existence').</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, Appendix A, onder 'Certificate pinning en DANE'.</p><p><em>Niveau van vereistheid: Optioneel</em>",
  "detail_web_tls_dane_exists_label": "DANE aanwezigheid",
  "detail_web_tls_dane_exists_tech_table": "Webserver-IP-adres|DANE TLSA-record aanwezig",
  "detail_web_tls_dane_exists_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_dane_exists_tech_table_dane_tlsa_record_existent": "DANE TLSA-record aanwezig",
  "detail_web_tls_dane_exists_verdict_bad": "Je websitedomein bevat <em>geen</em> TLSA-record voor DANE.",
  "detail_web_tls_dane_exists_verdict_bogus": "Je websitedomein bevat <em>geen</em> DNSSEC-bewijs dat DANE TLSA-records niet bestaan. Vraag je nameserver-beheerder om deze fout op te lossen.",
  "detail_web_tls_dane_exists_verdict_good": "Je websitedomein bevat een TLSA-record voor DANE.",
  "detail_web_tls_dane_rollover_exp": "<p>OUTDATED TEXT; TEST NOT USED</p><p>We check if your website domain has a proper DANE rolloverscheme to handle DANE certificate rollovers. Having a DANE rollover schemein place is not required. It will be proven useful when there is a need toupdate your DANE certificate and you want to ensure that DANE validationwill continue to work during the transition period. The way to achievethis is by publishing two different TLSA records. The configurations ofthe TLSA record types are the following:</p><ul><li>record type 3 1 1 (current key) + record type 3 1 1 (future key), or</li><li>record type 3 1 1 (current key) + record type 2 1 1 (trusted CA).</li></ul>",
  "detail_web_tls_dane_rollover_label": "OUTDATED TEXT; TEST NOT USED</p><p>DANE rollover scheme",
  "detail_web_tls_dane_rollover_tech_table": "OUTDATED TEXT; TEST NOT USED</p><p>Web server IP address|DANE rollover scheme",
  "detail_web_tls_dane_rollover_tech_table_outdated_text_test_not_used_web_server_ip_address": "OUTDATED TEXT; TEST NOT USED</p><p>Web server IP address",
  "detail_web_tls_dane_rollover_tech_table_dane_rollover_scheme": "DANE rollover scheme",
  "detail_web_tls_dane_rollover_verdict_bad": "OUTDATED TEXT; TEST NOT USED</p><p>Your website domain does <em>not</em> have a proper scheme forrolling DANE certificates.",
  "detail_web_tls_dane_rollover_verdict_good": "OUTDATED TEXT; TEST NOT USED</p><p>Your website domain has a proper scheme for rolling DANEcertificates.",
  "detail_web_tls_dane_valid_exp": "We testen of de DANE-fingerprint die je domein presenteert geldig is voor je websitecertificaat. </p><p>Met DANE kan je informatie over jouw websitecertificaat  publiceren in een speciaal DNS-record, een TLSA-record. Clients, zoals webbrowsers, kunnen het certificaat nu niet alleen via de certificaatautoriteit, maar ook via het TLSA-record controleren op authenticiteit. Een client kan het TLSA-record ook als signaal gebruiken om alleen via HTTPS (en niet via HTTP) te verbinden. DNSSEC is een noodzakelijke randvoorwaarde voor DANE. Helaas ondersteunen nog niet veel webbrowsers DANE-validatie.</p><p><em>Niveau van vereistheid: Aanbevolen (alleen als subtest voor 'DANE aanwezigheid' is geslaagd)</em>",
  "detail_web_tls_dane_valid_label": "DANE geldigheid",
  "detail_web_tls_dane_valid_tech_table": "Webserver-IP-adres|DANE TLSA-record geldig",
  "detail_web_tls_dane_valid_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_dane_valid_tech_table_dane_tlsa_record_valid": "DANE TLSA-record geldig",
  "detail_web_tls_dane_valid_verdict_bad": "De DANE-fingerprint op je domeinnaam is <em>niet</em> geldig voor je websitecertificaat. Óf iemand manipuleerde het antwoord van jouw nameserver, óf je domeinnaam heeft een serieuze DANE-configuratiefout. Dit laatste maakt je domeinnaam onbereikbaar voor alle gebruikers die DANE-fingerprints controleren. Neem zo spoedig mogelijk contact op met je nameserver-beheerder en/of hostingprovider.",
  "detail_web_tls_dane_valid_verdict_good": "De DANE-fingerprint op je domeinnaam is geldig voor je websitecertificaat.",
  "detail_web_tls_fs_params_exp": "We testen of de publieke parameters, die in de Diffie-Hellman sleuteluitwisseling worden gebruikt door je webserver, veilig zijn. </p><p><strong>ECDHE</strong>: De veiligheid van de ECDHE-sleuteluitwisseling is afhankelijk van de geselecteerde elliptische kromme. We testen of de bitlengte van de gebruikte kromme tenminste 224 bits is. Op dit moment kunnen we niet de naam van de elliptische kromme testen.</p><p><strong>DHE</strong>: De veiligheid van de Diffie-Hellman Ephemeral (DHE) sleuteluitwisseling is afhankelijk van de lengte van de publieke en geheime sleutels die in de geselecteerde finite field-groep wordt gebruikt. We testen of je publieke DHE-sleutelmateriaal gebruikmaakt van een van de gepredefinieerde finite field-groepen die zijn gespecificeerd in <a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>. Zelf-gegenereerde groepen zijn 'Onvoldoende'.</p><p>De grotere sleutellengtes die noodzakelijk zijn voor het gebruik van DHE gaan ten koste van de prestaties. Maak een zorgvuldige afweging en gebruik waar mogelijk ECDHE in plaats van DHE.</p><p><strong>RSA als alternatief</strong>: Naast ECDHE en DHE, kan RSA gebruikt worden voor sleuteluitwisseling. RSA loopt het risico om onvoldoende veilig te worden (huidige status 'Uit te faseren'). De publieke RSA-parameters worden getest in de subtest 'Handtekening-parameters van certificaat'. Overigens heeft RSA voor certificaatverificatie wel de status 'Goed'.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B5-1 en tabel 9 voor ECDHE, en richtlijn B6-1 en tabel 10 voor DHE.</p><hr /><p><strong>Elliptische krommen voor ECDHE</strong></p><ul><li>Goed: <code>secp384r1</code>, <code>secp256r1</code>, <code>x448</code>, en <code>x25519</code></li><li>Uit te faseren: <code>secp224r1</code></li><li>Onvoldoende: Andere krommen</li></ul><p><strong>Finite field-groepen voor DHE</strong></p><ul><li><p>Voldoende:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem\">ffdhe4096</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3</code></li><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem\">ffdhe3072</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab</code></li><li>Merk op dat we ook testen op ffdhe8192 and ffdhe6144 die beide voldoende zijn. Echter, hun beperkte beveiligingswinst weegt zelden op tegen het prestatie-verlies.</li></ul></li><li><p>Uit te faseren:</p><ul><li><a href=\"https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem\">ffdhe2048</a> (<a href=\"https://www.rfc-editor.org/rfc/rfc7919\">RFC 7919</a>)<br />  sha256 checksum: <code>9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b</code></li></ul></li><li><p>Onvoldoende: Andere groepen</p></li></ul><hr /><p>Let op: de bovenstaande namen zijn gebaseerd op de <a href=\"https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml\">IANA naamgevingsconventies</a>. Soms worden alternatieve namen gebruikt om te verwijzen naar dezelfde krommen, zoals <code>prime256v1</code> (ANSI) en <code>NIST P-256</code> voor <code>secp256r1</code>.",
  "detail_web_tls_fs_params_label": "Sleuteluitwisselingsparameters",
  "detail_web_tls_fs_params_tech_table": "Webserver-IP-adres|Getroffen parameters|Status",
  "detail_web_tls_fs_params_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_fs_params_tech_table_affected_parameters": "Getroffen parameters",
  "detail_web_tls_fs_params_tech_table_status": "Status",
  "detail_web_tls_fs_params_verdict_bad": "Je webserver ondersteunt <em>onvoldoende</em> veilige parameters voor Diffie-Hellman-sleuteluitwisseling.",
  "detail_web_tls_fs_params_verdict_good": "Je webserver ondersteunt veilige parameters voor Diffie-Hellman-sleuteluitwisseling.",
  "detail_web_tls_fs_params_verdict_na": "Deze subtest is niet van toepassing, omdat je webserver <em>niet</em> Diffie-Hellman-sleuteluitwisseling ondersteunt. Let op: RSA is een alternatief voor sleuteluitwisseling, maar heeft de status <em>uit te faseren</em>.",
  "detail_web_tls_fs_params_verdict_phase_out": "Je webserver ondersteunt parameters voor Diffie-Hellman-sleuteluitwisseling die de status <em>uit te faseren</em> hebben, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_web_tls_http_compression_exp": "<p>We testen of je webserver HTTP-compressie ondersteunt.</p><p>Bij het HTTP-protocol wordt compressie vaak gebruikt om de beschikbare bandbreedte efficiënter te gebruiken. HTTP-compressie maakt de beveiligde verbinding met je webserver echter kwetsbaar voor de BREACH-aanval. Weeg de voors en tegens van HTTP-compressie zorgvuldig tegen elkaar af. Wanneer u kiest voor het gebruik van HTTP-compressie, ga dan na of het mogelijk is om hieruit voortvloeiende potentiële applicatie-aanvallen te beperken. Een voorbeeld van een dergelijke maatregel is het beperken van de mate waarin een aanvaller de respons van de server kan beïnvloeden.</p><p>Dit testonderdeel controleert of de webserver op rootdirectory-niveau HTTP-compressie ondersteunt, maar controleert geen andere websitebronnen zoals plaatje en scripts. </p><p>Zie <a href=\"https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B7-1 en tabel 11.</p><p><em>Niveau van vereistheid: Optioneel</em></p><hr /><p><strong>Compressie-optie</strong></p><ul><li>Goed: Geen compressie</li><li>Voldoende: Compressie op applicatieniveau (in dit geval HTTP-compressie)</li><li>Onvoldoende: TLS-compressie</li></ul>",
  "detail_web_tls_http_compression_label": "HTTP-compressie",
  "detail_web_tls_http_compression_tech_table": "Webserver-IP-adres|HTTP-compressie",
  "detail_web_tls_http_compression_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_http_compression_tech_table_http_compression": "HTTP-compressie",
  "detail_web_tls_http_compression_verdict_bad": "Je webserver ondersteunt HTTP-compressie, wat een beveiligingsrisico kan vormen.",
  "detail_web_tls_http_compression_verdict_good": "Je webserver ondersteunt geen HTTP-compressie.",
  "detail_web_tls_https_exists_exp": "We testen of je website bereikbaar is via HTTPS. </p><p>Als dat het geval is, dan testen we in de navolgende subtesten of HTTPS ook veilig is geconfigureerd conform de <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a>.</p><p>HTTPS garandeert de vertrouwelijkheid en integriteit van uitgewisselde informatie. Omdat het van de situatie afhangt hoe (privacy-)gevoelig en waardevol informatie is, een bezoeker van je website bepaalt hoe (privacy-) gevoelig en waardevol informatie is, is een veilige HTTPS-configuratie voor iedere website van belang. Ook triviale, publieke informatie kan door omstandigheden voor de gebruiker zeer gevoelig en waardevol zijn. </p><p>Opmerking over IPv6/IPv4: vanwege performance-redenen worden alle testen in de categorie 'Beveiligde verbinding (HTTPS)' alleen uitgevoerd voor het eerst beschikbare IPv6- en IPv4-adres.",
  "detail_web_tls_https_exists_label": "HTTPS beschikbaar",
  "detail_web_tls_https_exists_tech_table": "Webserver-IP-adres|HTTPS aanwezig",
  "detail_web_tls_https_exists_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_https_exists_tech_table_https_existent": "HTTPS aanwezig",
  "detail_web_tls_https_exists_verdict_bad": "Je website biedt <em>geen</em> HTTPS aan.",
  "detail_web_tls_https_exists_verdict_good": "Je website biedt HTTPS aan.",
  "detail_web_tls_https_exists_verdict_other": "Je webserver is niet bereikbaar.",
  "detail_web_tls_https_forced_exp": "We testen of je webserver bezoekers automatisch doorverwijst van HTTP naar HTTPS op dezelfde domeinnaam (via een 3xx redirect status code zoals 301 en 302), óf dat deze ondersteuning biedt voor alleen HTTPS en niet voor HTTP. </p><p>In geval van doorverwijzing moet de domeinnaam eerst zelf 'upgraden' door een redirect naar zijn HTTPS-versie, voordat deze eventueel doorverwijst naar een andere domeinnaam. Dit zorgt er ook voor dat een webbrowser de HSTS-policy kan accepteren. Voorbeelden van correcte redirect-volgorde:</p><ul><li><code>http://example.nl</code> ⇒ <code>https://example.nl</code> ⇒ <code>https://www.example.nl</code></li><li><code>http://www.example.nl</code> ⇒ <code>https://www.example.nl</code></li></ul><p>Merk op dat deze subtest alleen test of de opgegeven domeinnaam goed doorverwijst van HTTP naar HTTPS. Een eventuele verdere doorverwijzing naar een andere domeinnaam (inclusief een subdomeinnaam van het geteste domeinnaam) wordt niet getest. Je kan een afzonderlijke test starten om een dergelijke domeinnaam waarnaar wordt doorverwezen zelf te testen. </p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Webapplicatie-richtlijnen, Verdieping'</a> van NCSC, richtlijn U/WA.05.",
  "detail_web_tls_https_forced_label": "HTTPS-doorverwijzing",
  "detail_web_tls_https_forced_tech_table": "Webserver-IP-adres|HTTPS-doorverwijzing",
  "detail_web_tls_https_forced_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_https_forced_tech_table_https_redirect": "HTTPS-doorverwijzing",
  "detail_web_tls_https_forced_verdict_bad": "Je webserver ondersteunt zowel HTTP als HTTPS, maar verwijst bezoekers <em>niet</em> automatisch door van HTTP naar HTTPS op dezelfde domeinnaam.",
  "detail_web_tls_https_forced_verdict_good": "Je webserver verwijst bezoekers automatisch door van HTTP naar HTTPS op dezelfde domeinnaam.",
  "detail_web_tls_https_forced_verdict_no_https": "Deze test is niet uitgevoerd, omdat je webserver geen HTTPS biedt of alleen HTTPS met een te verouderde, onveilige TLS-configuratie.",
  "detail_web_tls_https_forced_verdict_other": "Je webserver biedt alleen ondersteuning voor HTTPS en niet voor HTTP.",
  "detail_web_tls_https_hsts_exp": "We testen of je webserver HSTS ondersteunt. </p><p>Browsers onthouden HSTS per (sub-)domein. Het niet toevoegen van HSTS voor ieder (sub-)domein (in een redirect-keten) kan gebruikers kwetsbaar maken voor MITM-aanvallen. Om die reden testen we HSTS  bij het eerste contact, d.w.z. voordat een eventuele doorverwijzing plaatsvindt.</p><p>HSTS dwingt af dat een webbrowser direct via HTTPS verbindt bij terugkerend bezoek. Dit helpt man-in-the-middle-aanvallen te voorkomen. Een cache-geldigheidsduur voor HSTS van <em>tenminste</em> 1 jaar (<code>max-age=31536000</code>) achten we voldoende veilig. Een lange geldigheidsduur heeft als voordeel dat ook infrequente bezoekers beschermd zijn. Het nadeel is dat wanneer je wil stoppen met HTTPS (wat over het algemeen een slecht idee is), je langer moet wachten totdat de geldigheid van de HSTS-policy in alle browsers die je website bezochten, is verlopen. </p><p>De test controleert <strong>niet</strong> of <code>preload</code> wordt gebruikt en of het domein is opgenomen in de <a href=\"https://hstspreload.org/\">HSTS Preload Lijst</a>.</p><hr /><p><strong>Aanbevelingen voor implementatie</strong></p><p>HSTS vereist dat je website volledig over HTTPS werkt. Dit houdt ook in dat je website een geldig certificaat moet hebben van een publiekelijk vertrouwde certificaatautoriteit. Dus wanneer je website geen goede ondersteuning voor HTTPS biedt, dan zal deze <em>niet bereikbaar</em> zijn voor browsers die je website eerder hebben benaderd. Een wijziging van je HSTS-policy om de effecten terug te draaien, zal voor deze browsers niet onmiddellijk effect hebben, aangezien zij je vorige HSTS-policy in de cache hebben opgeslagen. </p><p>Daarom adviseren we u om de onderstaande implementatiestappen te volgen:</p><ol><li>Zorg ervoor dat de website op je domein nu en in de toekomst volledig over HTTPS werkt (o.a. door een gedegen certificaat rollover procedure te hebben);</li><li><p>Verhoog de geldigheidsduur van de HSTS-cache in de onderstaande fasen. Controleer tijdens elke fase zorgvuldig op bereikbaarheidsproblemen en niet goed werkende pagina's. Los eventuele problemen op en wacht dan de volledige cacheduur van de fase af voordat je naar de volgende fase gaat.</p></li><li><p>Begin met 5 minuten (<code>max-age=300</code>);</p></li><li>Verhoog dit naar 1 week (<code>max-age=604800</code>);</li><li>Verhoog dit naar 1 maand (<code>max-age=2592000</code>);</li><li><p>Verhoog het naar 1 jaar (<code>max-age=31536000</code>) of meer.</p></li><li><p>Herhaal stap 1 en 2 voor elk subdomein dat je met HSTS wilt beveiligen. Gebruik <code>includeSubDomains</code> alleen als je er volledig zeker van bent dat <strong>alle</strong> (geneste) subdomeinen van je domein HTTPS goed ondersteunen, nu en in de toekomst.</p></li><li>Gebruik <code>preload</code> <strong>alleen</strong> als je heel zeker weet dat je je domein wil laten opnemen in de <a href=\"https://hstspreload.org/\">HSTS Preload Lijst</a>. HSTS-preloading is vooral interessant voor de meest gevoelige websites. Beheerders die HSTS-preloading voor een bepaald domein willen inschakelen, moeten dit uiterst bedachtzaam doen. Het kan gevolgen hebben voor de bereikbaarheid van het domein en van eventuele subdomeinen, en is niet snel terug te draaien. </li></ol><hr /><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties\">'Webapplicatie-richtlijnen, Verdieping'</a> van NCSC, richtlijn U/WA.05.",
  "detail_web_tls_https_hsts_label": "HSTS",
  "detail_web_tls_https_hsts_tech_table": "Webserver-IP-adres|HSTS-policy",
  "detail_web_tls_https_hsts_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_https_hsts_tech_table_hsts_policy": "HSTS-policy",
  "detail_web_tls_https_hsts_verdict_bad": "Je webserver biedt <em>geen</em> HSTS-policy aan.",
  "detail_web_tls_https_hsts_verdict_good": "Je webserver biedt een HSTS-policy aan.",
  "detail_web_tls_https_hsts_verdict_other": "Je webserver biedt een HSTS-policy aan met een geldigheidsduur voor caching (<code>max-age</code>) die <em>niet</em> voldoende lang (d.w.z. korter dan 1 jaar) is.",
  "detail_web_tls_kex_hash_func_exp": "<p>We testen of je webserver ondersteuning biedt voor veilige hashfuncties om tijdens sleuteluitwisseling de digitale handtekening te maken.</p><p>De webserver maakt tijdens de sleuteluitwisseling gebruik van een digitale handtekening om het eigenaarschap te bewijzen van de geheime sleutel die bij het certificaat hoort. De webserver creëert deze digitale handtekening door het ondertekenen van de output van een hashfunctie.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, tabel 5.</p><p><em>Niveau van vereistheid: Aanbevolen</em></p><hr /><p><strong>SHA2-ondersteuning voor handtekeningen</strong></p><ul><li>Goed: Ja (ondersteuning van SHA-256, SHA-384 of SHA-512)</li><li>Uit te faseren: Nee (<em>geen</em> ondersteuning van SHA-256, SHA-384 of SHA-512)</li></ul>",
  "detail_web_tls_kex_hash_func_label": "Hashfunctie voor sleuteluitwisseling",
  "detail_web_tls_kex_hash_func_tech_table": "Webserver-IP-adress|SHA-2-ondersteuning voor handtekeningen",
  "detail_web_tls_kex_hash_func_tech_table_web_server_ip_address": "Webserver-IP-adress",
  "detail_web_tls_kex_hash_func_tech_table_sha2_support_for_signatures": "SHA-2-ondersteuning voor handtekeningen",
  "detail_web_tls_kex_hash_func_verdict_good": "Je webserver ondersteunt een veilige hashfunctie voor sleuteluitwisseling.",
  "detail_web_tls_kex_hash_func_verdict_other": "Het was niet mogelijk om vast te stellen welke hashfunctie  je webserver gebruikt. Dit kan veroorzaakt worden doordat de gebruikte cipher-combinatie geen handtekening voor certificaatverificatie heeft (bijv. deze gebruikt RSA-sleuteluitwisseling of is anoniem d.w.z. <code>anon</code>).",
  "detail_web_tls_kex_hash_func_verdict_phase_out": "Je webserver ondersteunt <em>geen</em> veilige hashfunctie voor sleuteluitwisseling. Deze instelling dien je weloverwogen <em>uit te faseren</em>, omdat deze het risico loopt in de toekomst <em>onvoldoende</em> veilig te worden.  ",
  "detail_web_tls_ocsp_stapling_exp": "<p>We testen of je webserver de <a href=\"https://www.rfc-editor.org/rfc/rfc6961\">TLS Certificate Status extension</a> of te wel OCSP stapling ondersteunt. </p><p>De webbrowser kan de geldigheid van het certificaat van de webserver via het OCSP-protocol controleren bij de certificaatleverancier. Dat OCSP-protocol verschaft de certificaatleverancier informatie over browsers die met de betreffende webserver communiceren. Dit kan een privacy-risico vormen. Een server kan de OCSP-informatie ook zelf verstrekken (OCSP stapling). Dit lost niet alleen het privacy-risico op, maar vereist ook geen connectiviteit tussen de webbrowser en certificaatleverancier en dit gaat dan ook sneller.</p><p>Als we verbinden met je webserver dan verzoeken we via de TLS Certificate Status extension om OCSP-data op te nemen in het antwoord van de webserver. Als je webserver OCSP-data heeft opgenomen in het antwoord, dan verifiëren we of de OCSP-data valide is, d.w.z. correct ondertekend door een bekende certificaatleverancier. Let op: we gebruiken de OCSP-data niet om de geldigheid van het certificaat te controleren.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, tabel 15.</p><p><em>Niveau van vereistheid: Optioneel</em></p><hr /><p><strong>OCSP stapling</strong></p><ul><li>Goed: Aan</li><li>Voldoende: Uit</li></ul>",
  "detail_web_tls_ocsp_stapling_label": "OCSP stapling",
  "detail_web_tls_ocsp_stapling_tech_table": "Webserver-IP-adres|OCSP stapling",
  "detail_web_tls_ocsp_stapling_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_ocsp_stapling_tech_table_ocsp_stapling": "OCSP stapling",
  "detail_web_tls_ocsp_stapling_verdict_bad": "Je webserver ondersteunt OCSP maar de data in het antwoord is <em>niet</em> valide.",
  "detail_web_tls_ocsp_stapling_verdict_good": "Je webserver ondersteunt OCSP en de data in het antwoord is valide.",
  "detail_web_tls_ocsp_stapling_verdict_ok": "Je webserver ondersteunt OCSP <em>niet</em>.",
  "detail_web_tls_renegotiation_client_exp": "<p>We testen of een client (doorgaans een webbrowser) een renegotiation kan initiëren met jouw webserver. </p><p>In het algemeen is het niet nodig om clients de mogelijkheid te bieden om een renegotiation te initiëren (client-initiated renegotiation). Bovendien komt een webserver hierdoor binnen een TLS-verbinding bloot te staan aan DoS-aanvallen. Een aanvaller kan ook zonder renegotiation op initiatief van een client soortgelijke DoS-aanvallen uitvoeren door veel parallelle TLS-verbindingen te openen. Dergelijke aanvallen zijn echter eenvoudiger te traceren en met de standaardmaatregelen te mitigeren. Merk op dat client-initiated renegotiation impact heeft op de beschikbaarheid en niet op de vertrouwelijkheid.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn 8-1 en tabel 13.</p><p><em>Niveau van vereistheid: Optioneel</em></p><hr /><p><strong>Client-initiated renegotiation</strong></p><ul><li>Goed: Uit (of n.v.t. voor TLS 1.3)</li><li>Voldoende: Aan</li></ul>",
  "detail_web_tls_renegotiation_client_label": "Client-initiated renegotiation",
  "detail_web_tls_renegotiation_client_tech_table": "Webserver-IP-adres|Client-initiated renegotiation",
  "detail_web_tls_renegotiation_client_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_renegotiation_client_tech_table_client_initiated_renegotiation": "Client-initiated renegotiation",
  "detail_web_tls_renegotiation_client_verdict_bad": "Je webserver staat client-initiated renegotiation toe, wat een negatieve invloed kan hebben op de beschikbaarheid van je website.",
  "detail_web_tls_renegotiation_client_verdict_good": "Je webserver staat geen client-initiated renegotiation toe.",
  "detail_web_tls_renegotiation_secure_exp": "<p>We testen of je webserver secure renegotiation ondersteunt. </p><p>In de oudere versies van TLS (vóór TLS 1.3) is het tot stand brengen van een nieuwe handshake toegestaan. Dit zogeheten 'opnieuw onderhandelen' (renegotiation) was in het oorspronkelijke ontwerp onveilig. Inmiddels is de standaard gerepareerd en is er een veiliger renegotiation-mechanisme beschikbaar. De oude versie wordt sindsdien als insecure renegotiation aangeduid en deze moet derhalve uitgeschakeld worden.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B8-1 en tabel 12.</p><hr /><p><strong>Insecure renegotiation</strong></p><ul><li>Goed: Uit (of n.v.t. voor TLS 1.3)</li><li>Onvoldoende: Aan </li></ul>",
  "detail_web_tls_renegotiation_secure_label": "Secure renegotiation",
  "detail_web_tls_renegotiation_secure_tech_table": "Webserver-IP-adres|Secure renegotiation",
  "detail_web_tls_renegotiation_secure_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_renegotiation_secure_tech_table_secure_renegotiation": "Secure renegotiation",
  "detail_web_tls_renegotiation_secure_verdict_bad": "Je webserver ondersteunt insecure renegotiation, wat uiteraard <em>niet</em> veilig is.",
  "detail_web_tls_renegotiation_secure_verdict_good": "Je webserver ondersteunt secure renegotiation.",
  "detail_web_tls_version_exp": "<p>We testen of je webserver alleen veilige TLS-versies ondersteunt. </p><p>Een webserver kan meer dan één TLS-versie ondersteunen.</p><p>Merk op dat browsermakers hebben aangekondigd dat ze zullen stoppen met de ondersteuning van TLS 1.1 en 1.0. Daardoor zullen websites die geen TLS 1.2 en/of 1.3 ondersteunen onbereikbaar worden.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B1-1 en tabel 1</p><hr /><p><strong>Versie</strong></p><ul><li>Goed: TLS 1.3</li><li>Voldoende: TLS 1.2</li><li>Uit te faseren: TLS 1.1 en 1.0</li><li>Onvoldoende: SSL 3.0, 2.0 en 1.0</li></ul>",
  "detail_web_tls_version_label": "TLS-versie",
  "detail_web_tls_version_tech_table": "Webserver-IP-adres|TLS-versie|Status",
  "detail_web_tls_version_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_version_tech_table_tls_version": "TLS-versie",
  "detail_web_tls_version_tech_table_status": "Status",
  "detail_web_tls_version_verdict_bad": "Je webserver ondersteunt <em>onvoldoende</em> veilige TLS-versies.",
  "detail_web_tls_version_verdict_good": "Je webserver ondersteunt alleen veilige TLS-versies.",
  "detail_web_tls_version_verdict_phase_out": "Je webserver ondersteunt TLS-versies die je weloverwogen dient <em>uit te faseren</em>, omdat bekend is dat deze fragiel zijn en het risico lopen in de toekomst <em>onvoldoende</em> veilig te worden.",
  "detail_web_tls_zero_rtt_exp": "<p>We testen of je webserver Zero Round Trip Time Resumption (0-RTT) ondersteunt.</p><p>0-RTT is een optie in TLS 1.3 waarmee applicatiedata wordt getransporteerd tijdens het eerste handshake-bericht. 0-RTT biedt echter geen bescherming tegen replay-aanvallen op de TLS-laag en dient daarom uitgezet te worden. Alhoewel het risico gemitigeerd kan worden door 0-RTT niet toe te staan voor non-idempotent requests, is een dergelijke configuratie vaak niet triviaal, afhankelijk van applicatielogica en daardoor foutgevoelig.</p><p>Als je webserver geen TLS 1.3 ondersteunt, dan is deze test niet van toepassing. Voor webservers die TLS 1.3 ondersteunen, wordt de indexpagina <code>/</code> opgehaald via TLS 1.3 en daarbij wordt de omvang van de ondersteuning voor <a href=\"https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html\">early data</a> zoals <a href=\"https://www.rfc-editor.org/rfc/rfc8446#section-4.2.10\">aangegeven</a> door de webserver gecontroleerd. Indien deze groter is dan nul, dan wordt een tweede verbinding gemaakt waarbij de TLS-sessiedetails van de eerste connectie worden hergebruikt maar de HTTP opvraging <em>vóór</em> de TLS handshake plaatsvindt (d.w.z. geen round trips (0-RTT) nodig voordat applicatiedata naar de server gaat). Als de TLS handshake slaagt en de webserver antwoordt met een non-<a href=\"https://www.rfc-editor.org/rfc/rfc8470#section-5.2\">HTTP 425 Too Early</a>, dan wordt aangenomen dat de webserver 0-RTT ondersteunt.</p><p>Zie <a href=\"https://www.ncsc.nl/documenten/publicaties/2021/januari/19/ict-beveiligingsrichtlijnen-voor-transport-layer-security-2.1\">'ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS) v2.1'</a> van NCSC, richtlijn B9-1 en tabel 14.</p><hr /><p><strong>0-RTT</strong></p><ul><li>Goed: Uit (of n.v.t. voor oudere versies dan TLS 1.3)</li><li>Onvoldoende: Aan</li></ul>",
  "detail_web_tls_zero_rtt_label": "0-RTT",
  "detail_web_tls_zero_rtt_tech_table": "Webserver-IP-adres|0-RTT",
  "detail_web_tls_zero_rtt_tech_table_web_server_ip_address": "Webserver-IP-adres",
  "detail_web_tls_zero_rtt_tech_table_0_rtt": "0-RTT",
  "detail_web_tls_zero_rtt_verdict_bad": "Je webserver ondersteunt 0-RTT, wat <em>niet</em> veilig is.",
  "detail_web_tls_zero_rtt_verdict_good": "Je webserver ondersteunt geen 0-RTT.",
  "detail_web_tls_zero_rtt_verdict_na": "Deze subtest is niet van toepassing aangezien je webserver TLS 1.3 niet ondersteunt. ",
  "detail_web_mail_ipv6_ns_aaaa_exp": "We testen of je domeinnaam tenminste twee nameservers met een IPv6-adres heeft. </p><p>Dit sluit aan bij de <a href=\"https://www.sidn.nl/downloads/7li2X9A-Q1-_qkgnZn1TAg/02066e69fc93d5b64b4aa16c469c38f6/Technische_eisen_voor_registratie_en_gebruik_van_nl_domeinamen.pdf\">\"Technische eisen voor registratie en gebruik van .nl-domeinnamen\"</a> d.d. 13 november 2017 van SIDN (beheerder van het .nl-domein) waarin staat dat iedere .nl-domeinnaam tenminste twee nameservers moeten hebben.</p><p>'IPv4-mapped IPv6 addresses' (<a href=\"https://www.rfc-editor.org/rfc/rfc4291\">RFC 4291</a>, beginnend met ::ffff:) zullen falen in deze test, aangezien zij <em>geen</em> IPv6-connectiviteit bieden.",
  "detail_web_mail_ipv6_ns_aaaa_label": "IPv6-adressen voor nameservers",
  "detail_web_mail_ipv6_ns_aaaa_tech_table": "Nameserver|IPv6-adres|IPv4-adres",
  "detail_web_mail_ipv6_ns_aaaa_tech_table_name_server": "Nameserver",
  "detail_web_mail_ipv6_ns_aaaa_tech_table_ipv6_address": "IPv6-adres",
  "detail_web_mail_ipv6_ns_aaaa_tech_table_ipv4_address": "IPv4-adres",
  "detail_web_mail_ipv6_ns_aaaa_verdict_bad": "Geen van de nameservers van je domeinnaam heeft een IPv6-adres.",
  "detail_web_mail_ipv6_ns_aaaa_verdict_good": "Twee of meer nameservers van je domeinnaam hebben een IPv6-adres.",
  "detail_web_mail_ipv6_ns_aaaa_verdict_other": "Slechts één nameserver van je domeinnaam heeft een IPv6-adres.",
  "detail_web_mail_ipv6_ns_reach_exp": "We testen of alle nameservers, die een AAAA-record met IPv6-adres hebben, bereikbaar zijn via IPv6.",
  "detail_web_mail_ipv6_ns_reach_label": "IPv6-bereikbaarheid van nameservers",
  "detail_web_mail_ipv6_ns_reach_tech_table": "Nameserver|Onbereikbaar IPv6-adres",
  "detail_web_mail_ipv6_ns_reach_tech_table_name_server": "Nameserver",
  "detail_web_mail_ipv6_ns_reach_tech_table_unreachable_ipv6_address": "Onbereikbaar IPv6-adres",
  "detail_web_mail_ipv6_ns_reach_verdict_bad": "<em>Niet</em> alle nameservers die een IPv6-adres hebben zijn bereikbaar via IPv6.",
  "detail_web_mail_ipv6_ns_reach_verdict_good": "Alle nameservers die een IPv6-adres hebben zijn bereikbaar via IPv6.",
  "detail_web_mail_rpki_ns_exists_exp": "We testen of er een RPKI Route Origin Authorisation (ROA) is gepubliceerd voor alle IP-adressen van de nameservers van je domein.</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen van je server moeten sturen.</p><p>Een route-aankondiging is echter te vervalsen. Een andere netwerkprovider kan namelijk in de positie zijn om het IP-adresblok van jouw IP-adres te koppelen aan zijn netwerk en op die manier mogelijk internetverkeer te ontvangen dat eigenlijk voor jouw netwerkprovider bedoeld is. De oorzaak kan per ongeluk of kwaadwillig zijn. In beide gevallen kan het ertoe leiden dat je server onbereikbaar is of dat internetverkeer naar je server wordt onderschept.</p><p>Resource Public Key Infrastructure (RPKI) verbetert de bescherming hiertegen aanzienlijk. Met RPKI kan de rechtmatige houder van een blok IP-adressen namelijk een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation; afgekort: ROA) publiceren. Een andere netwerkprovider die internetverkeer wil sturen naar een bepaalde IP-adres, kan de bijbehorende verklaring gebruiken om ongeldige (<code>Invalid</code>) routes te filteren. Daarmee voorkomt de netwerkprovider dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.",
  "detail_web_mail_rpki_ns_exists_label": "Aanwezigheid van Route Origin Authorisation",
  "detail_web_mail_rpki_ns_exists_tech_table": "Nameserver|IP-adres|RPKI Route Origin Authorization",
  "detail_web_mail_rpki_ns_exists_tech_table_name_server": "Nameserver",
  "detail_web_mail_rpki_ns_exists_tech_table_ip_address": "IP-adres",
  "detail_web_mail_rpki_ns_exists_tech_table_rpki_route_origin_authorization": "RPKI Route Origin Authorization",
  "detail_web_mail_rpki_ns_exists_verdict_bad": "Voor tenminste één van de IP-adressen van je nameservers is <em>geen</em> RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_web_mail_rpki_ns_exists_verdict_good": "Voor alle IP-adressen van je nameservers is een RPKI Route Origin Authorisation (ROA) gepubliceerd.",
  "detail_web_mail_rpki_ns_exists_verdict_no_addresses": "Je domein bevat <em>geen</em> nameservers. Daarom kon deze subtest niet worden uitgevoerd.",
  "detail_web_mail_rpki_ns_valid_exp": "We testen of de validatie-status van alle IP-adressen van de nameservers van je domein <code>Valid</code> is. Als er meerdere overlappende route-aankondigingen voor het IP-adres zijn, dan testen we of die allemaal <code>Valid</code> zijn.</p><p>Je hoster (of zijn netwerkprovider) kondigt via het Border Gateway Protocol (BGP) aan voor welke van zijn IP-adresblokken hij inkomend internetverkeer accepteert. Dat doet hij door (delen van) zijn IP-adresblokken (Route Prefix) aan het unieke nummer van zijn providernetwerk (Route Origin ASN) te koppelen, en door deze routeringsinformatie vervolgens te verspreiden. Andere netwerkproviders gebruiken deze route-aankondigingen om te bepalen via welke route ze het verkeer voor de IP-adressen moeten sturen.</p><p>Aanvullend kan je hoster (of zijn netwerkprovider) voor iedere route-aankondiging een digitaal ondertekende verklaring met route-autorisatie (Route Origin Authorisation, afgekort: ROA) publiceren met behulp van Resource Public Key Infrastructure (RPKI). </p><p>Een andere netwerkprovider die gevraagd wordt om internetverkeer te sturen naar het IP-adres van je server, kan de bijbehorende verklaring cryptografisch controleren. De gecontroleerde inhoud (Validated ROA Payload; afgekort: VRP) omvat welke providernetwerken (VRP ASN) voor ieder opgenomen IP-adresblok (VRP Prefix) geautoriseerd zijn om internetverkeer te ontvangen. </p><p>De netwerkprovider kan deze inhoud vervolgens gebruiken om  BGP-routes te filteren. Hij kan bijvoorbeeld eventuele <code>Invalid</code> routes weigeren om te voorkomen dat internetverkeer vanuit zijn netwerk naar ongeautoriseerde providernetwerken wordt gestuurd.</p><p>Het vergelijken van route-aankondigingen met route-autorisaties (RPKI Origin Validation; afgekort: ROV) kent de onderstaande drie mogelijk uitkomsten.</p><p>1․ <code>Valid</code>: De route-aankondiging van het desbetreffende IP-adres wordt gematcht door tenminste één gepubliceerde route-autorisatie. Een route-autorisatie is ook matchend voor meer specifieke route-aankondigingen (d.w.z. voor een deel van het IP-adresblok dat in de route-autorisatie staat), tenzij deze meer specifiek zijn dan de limiet die in de route-autorisatie is bepaald (via het <code>maxLength</code> attribuut). </p><p>2․ <code>Invalid</code>: De route-aankondiging van het desbetreffende IP-adres is wel afgedekt door een route-autorisatie, maar deze matcht <em>niet</em>. Er zijn twee mogelijke oorzaken: </p><ul><li>het IP-adresblok (Route Prefix) wordt aangekondigd vanaf een providernetwerk (Route Origin ASN) dat in de route-autorisatie <em>niet</em> is geautoriseerd (resultaat in onderstaande tabel: \"invalid (as)\");</li><li>het IP-adresblok (Route Prefix) dat wordt aangekondigd is <em>kleiner</em> dan wordt toegestaan in de route-autorisatie, d.w.z. overschrijding van <code>maxLength</code> waarde (resultaat in onderstaande tabel: \"invalid (length)\").</li></ul><p>3․ <code>NotFound</code>: Er is geen verklaring met route-autorisatie gevonden die de route-aankondiging van het desbetreffende IP-adres afdekt. De routering van internetverkeer naar jouw server is daardoor minder veilig. Neem hierover contact op met je hoster. Deze kan zijn netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.</p><p><strong>Wat te doen als het testresultaat de status Invalid toont?</strong></p><p>De status <code>Invalid</code> duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je hoster of zijn netwerkprovider (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je hoster. Bij een interne fout moet je hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen. ",
  "detail_web_mail_rpki_ns_valid_label": "Geldigheid van route-aankondiging",
  "detail_web_mail_rpki_ns_valid_tech_table": "Nameserver|BGP Route Prefix|BGP Route Origin ASN|RPKI Origin Validation status",
  "detail_web_mail_rpki_ns_valid_tech_table_name_server": "Nameserver",
  "detail_web_mail_rpki_ns_valid_tech_table_bgp_route_prefix": "BGP Route Prefix",
  "detail_web_mail_rpki_ns_valid_tech_table_bgp_route_origin_asn": "BGP Route Origin ASN",
  "detail_web_mail_rpki_ns_valid_tech_table_rpki_origin_validation_state": "RPKI Origin Validation status",
  "detail_web_mail_rpki_ns_valid_verdict_bad": "Ten minste één IP-adres van je nameservers heeft een <code>NotFound</code> validatie-status. Er is <em>geen</em> RPKI Route Origin Authorisation (ROA) gepubliceerd voor zijn route-aankondiging.",
  "detail_web_mail_rpki_ns_valid_verdict_good": "Alle IP-adressen van je nameservers hebben een <code>Valid</code> validatie-status. De route-aankondiging van deze IP-adressen wordt gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA).",
  "detail_web_mail_rpki_ns_valid_verdict_invalid": "Tenminste één IP-adres van je nameservers heeft een <code>Invalid</code> validatie-status. De route-aankondiging van de desbetreffende IP-adressen wordt <em>niet</em> gematcht door de gepubliceerde RPKI Route Origin Authorisation (ROA). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je nameserver-hoster (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je nameserver-hoster. Bij een interne fout moet je nameserver-hoster zijn netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.",
  "detail_web_mail_rpki_ns_valid_verdict_not_routed": "Deze subtest werd <em>niet</em> uitgevoerd, omdat er voor <em>geen</em> van de IP-adressen een route-aankondiging beschikbaar was.",
  "domain_pagetitle": "Websitetest:",
  "domain_title": "Websitetest: {{prettyaddr}}  ",
  "domain_tweetmessage": "De%20website%20{{report.domain}}%20scoort%20{{score}}%25%20in%20de%20websitetest%20van%20%40Internet_nl%3A",
  "faqs_appsecpriv_title": "Beveiligingsopties",
  "faqs_badges_title": "Gebruik van 100%-badges",
  "faqs_batch_and_dashboard_title": "Batch API en webgebaseerd dashboard",
  "faqs_dnssec_title": "Domeinnaamhandtekening (DNSSEC)",
  "faqs_halloffame_title": "Criteria voor 'Hall of Fame voor Hosters'",
  "faqs_https_title": "Beveiligde websiteverbinding (HTTPS)",
  "faqs_ipv6_title": "Modern adres (IPv6)",
  "faqs_mailauth_title": "Protectie tegen e-mailphishing (DMARC, DKIM en SPF)",
  "faqs_measurements_title": "Metingen met Internet.nl",
  "faqs_report_score_title": "Norm en score",
  "faqs_report_subtest_bad": "Slecht: gezakt voor VEREISTE subtest ⇒ nulscore",
  "faqs_report_subtest_error": "Testfout: uitvoeringsfout tijdens testen ⇒ nulscore",
  "faqs_report_subtest_good": "Goed: geslaagd voor VEREISTE, AANBEVOLEN of OPTIONELE subtest ⇒ eerste: volledige score / laatste twee: geen impact op score",
  "faqs_report_subtest_info": "Ter informatie: gezakt voor OPTIONELE subtest ⇒ geen impact op score",
  "faqs_report_subtest_not_tested": "Niet getest, want al gezakt voor gerelateerde bovenliggende subtest ⇒ nulscore",
  "faqs_report_subtest_title": "Iconen per subtest",
  "faqs_report_subtest_warning": "Waarschuwing: gezakt voor AANBEVOLEN subtest ⇒ geen impact op score",
  "faqs_report_test_bad": "Slecht: gezakt voor tenminste één VEREISTE subtest ⇒ geen volledige score voor testcategorie",
  "faqs_report_test_error": "Testfout: uitvoeringsfout voor tenminste één subtest ⇒ geen resultaat voor testcategorie",
  "faqs_report_test_good": "Goed: geslaagd voor alle subtesten ⇒ volledige score voor testcategorie ",
  "faqs_report_test_info": "Ter informatie: gezakt voor tenminste één OPTIONELE subtest ⇒ volledige score voor testcategorie",
  "faqs_report_test_title": "Iconen per testcategorie",
  "faqs_report_test_warning": "Waarschuwing: gezakt voor tenminste één AANBEVOLEN subtest ⇒ volledige score voor testcategorie ",
  "faqs_report_title": "Toelichting op testrapport",
  "faqs_rpki_title": "Autorisatie voor routering (RPKI)",
  "faqs_starttls_title": "Beveiligd e-mailtransport (STARTTLS en DANE)",
  "faqs_title": "Kennisbank",
  "halloffame_champions_menu": "Kampioenen!",
  "halloffame_champions_subtitle": "100% in website- <em>én</em> e-mailtest",
  "halloffame_champions_text": "De {{count}} onderstaande domeinnamen scoren 100% in zowel de websitetest als de e-mailtest. Leden van deze Hall of Fame mogen <a href=\"/faqs/badges/\">beide 100%-badges gebruiken</a>.",
  "halloffame_champions_title": "Hall of Fame - Kampioenen!",
  "halloffame_mail_badge": "Badge met tekst: 100%-score in e-mailtest",
  "halloffame_mail_menu": "E-mail",
  "halloffame_mail_subtitle": "100% in e-mailtest",
  "halloffame_mail_text": "De {{count}} onderstaande domeinnamen scoren 100% in de e-mailtest. Leden van deze Hall of Fame mogen de <a href=\"/faqs/badges/\">100%-badge voor mail gebruiken</a>.",
  "halloffame_mail_title": "Hall of Fame - E-mail",
  "halloffame_web_badge": "Badge met tekst: 100%-score in websitetest",
  "halloffame_web_menu": "Websites",
  "halloffame_web_subtitle": "100% in websitetest",
  "halloffame_web_text": "De {{count}} onderstaande domeinnamen scoren 100% in de websitetest. Leden van deze Hall of Fame mogen de <a href=\"/faqs/badges/\">100%-badge voor websites gebruiken</a>.",
  "halloffame_web_title": "Hall of Fame - Websites",
  "home_pagetitle": "Test voor moderne Internetstandaarden zoals IPv6, DNSSEC, HTTPS, DMARC, STARTTLS en DANE.",
  "home_stats_connection": "unieke verbindingen",
  "home_stats_connection_items": "",
  "home_stats_header": "Tests in cijfers",
  "home_stats_mail": "unieke mail-domeinen",
  "home_stats_mail_items": "",
  "home_stats_notpassed": "0-99%:",
  "home_stats_passed": "100%:",
  "home_stats_website": "unieke web-domeinen",
  "home_stats_website_items": "",
  "home_teaser": "Moderne Internetstandaarden zorgen voor meer betrouwbaarheid en verdere groei van het Internet.<br />Gebruik jij ze al?",
  "mail_pagetitle": "E-mailtest:",
  "mail_title": "E-mailtest: {{prettyaddr}}",
  "mail_tweetmessage": "De%20mailserver%20op%20{{report.domain}}%20scoort%20{{score}}%25%20in%20de%20e-mailtest%20van%20%40Internet_nl%3A",
  "page_gotocontents": "Ga naar tekst-inhoud",
  "page_gotofooter": "Ga naar de footer",
  "page_gotomainmenu": "Ga naar het hoofd-menu",
  "page_metadescription": "Test voor moderne Internetstandaarden IPv6, DNSSEC, HTTPS, HSTS, DMARC, DKIM, SPF, STARTTLS, DANE, RPKI en security.txt",
  "page_metakeywords": "IPv6, DNSSEC, HTTPS, HSTS, TLS, DMARC, DKIM, SPF, STARTTLS, DANE, RPKI, security.txt, CSP, Content Security Policy, security headers, test, testtool, testen, check, controle, internet, internetstandaarden, open standaarden, moderne standaarden, beveiliging, security, internetbeveiliging, mail, e-mailbeveiliging, website, websitebeveiliging, internetverbinding, beveiligde verbinding, e-mailauthenticatie, encryptie, versleuteling, ciphers, cipher suites, PKI, SSL certificaat, TLS certificaat, websitecertificaat, Platform Internetstandaarden",
  "page_sitedescription": "Is jouw internet up-to-date?",
  "page_sitetitle": "Internet.nl",
  "page404_title": "Pagina niet gevonden!",
  "probes_auto_redirect": "Als de test gereed is, word je automatisch doorgestuurd naar de resultaatpagina.",
  "probes_no_javascript": "Controleer of de testresultaten beschikbaar zijn. Zo niet, dan word je automatisch teruggeleid naar deze pagina.",
  "probes_no_javascript_connection": "JavaScript inactief. Activeer JavaScript om de test toch uit te kunnen voeren.",
  "probes_no_redirection": "Testfout. Probeer het later opnieuw, of test een andere domeinnaam.",
  "probes_test_finished": "Test klaar! Resultaten beschikbaar...",
  "probes_test_running": "Bezig...",
  "probes_tests_description": "De onderstaande onderdelen worden getest.",
  "probes_tests_duration": "Het testen duurt tussen de 5 en {{cache_ttl}} seconden.",
  "results_dated_presentation": "Oude resultaatpresentatie. Doe de test opnieuw.",
  "results_domain_appsecpriv_http_headers_label": "HTTP security headers",
  "results_domain_appsecpriv_other_options_label": "Andere beveiligingsopties",
  "results_domain_ipv6_web_server_label": "Webserver",
  "results_domain_rpki_web_server_label": "Webserver",
  "results_domain_tls_http_headers_label": "HTTP headers",
  "results_domain_tls_https_label": "HTTP",
  "results_domain_tls_tls_label": "TLS",
  "results_domain_mail_ipv6_name_servers_label": "Nameservers van domein",
  "results_domain_mail_rpki_name_servers_label": "Nameservers van domein",
  "results_domain_mail_tls_certificate_label": "Certificaat",
  "results_domain_mail_tls_dane_label": "DANE",
  "results_empty_argument_alt_text": "Geen",
  "results_explanation_label": "Testuitleg:",
  "results_further_testing_connection_label": "Aanvullende verbindingstesten",
  "results_further_testing_mail_label": "Aanvullende e-mailtesten",
  "results_further_testing_web_label": "Aanvullende websitetesten",
  "results_mail_auth_dkim_label": "DKIM",
  "results_mail_auth_dmarc_label": "DMARC",
  "results_mail_auth_spf_label": "SPF",
  "results_mail_dnssec_domain_label": "E-mailadresdomein",
  "results_mail_dnssec_mail_servers_label": "Mailserverdomein(en)",
  "results_mail_ipv6_mail_servers_label": "Mailserver(s)",
  "results_mail_rpki_mail_servers_label": "Mailserver(s)",
  "results_mail_rpki_mx_name_servers_label": "Nameservers van mailserver(s)",
  "results_mail_tls_starttls_label": "TLS",
  "results_no_icon_detail_close": "sluit",
  "results_no_icon_detail_open": "open",
  "results_no_icon_status_error": "Error",
  "results_no_icon_status_failed": "Gezakt",
  "results_no_icon_status_info": "Informatie",
  "results_no_icon_status_not_tested": "Niet-testbaar",
  "results_no_icon_status_passed": "Geslaagd",
  "results_no_icon_status_warning": "Suggestie",
  "results_panel_button_hide": "Verberg details",
  "results_panel_button_show": "Toon details",
  "results_perfect_score": "Gefeliciteerd, je domeinnaam wordt spoedig in de <strong>Hall of Fame</strong> opgenomen!",
  "results_permalink": "Permalink testresultaat {{permadate|date:'(Y-m-d H:i T)'}}",
  "results_rerun_test": "Herhaal de test",
  "results_retest_time": "Seconden tot hertest-mogelijkheid:",
  "results_score_description": "Het domein {{prettyaddr}} heeft een testscore van {{score}}%.",
  "results_tech_details_label": "Technische details:",
  "results_test_direct": "Test direct:",
  "results_test_email_label": "Test andere e-mail",
  "results_test_website_label": "Test andere website",
  "results_test_info": "Toelichting op testrapport",
  "results_verdict_label": "Uitslag:",
  "test_connipv6_failed_description": "Helaas! Je internetprovider heeft je <em>geen</em> modern internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gegeven, of <em>niet</em> alles correct ingesteld. Je kan daardoor andere computers met moderne adressen <em>niet</em> bereiken. Vraag je internetprovider om volledige IPv6-connectiviteit.",
  "test_connipv6_failed_summary": "Moderne adressen <em>niet</em> bereikbaar (IPv6)",
  "test_connipv6_info_description": "Helaas! Je internetprovider heeft je <em>geen</em> modern internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gegeven, of <em>niet</em> alles correct ingesteld. Je kan daardoor andere computers met moderne adressen <em>niet</em> bereiken. Vraag je internetprovider om volledige IPv6-connectiviteit.",
  "test_connipv6_info_summary": "Moderne adressen <em>niet</em> bereikbaar (IPv6)",
  "test_connipv6_label": "Moderne adressen bereikbaar (IPv6)",
  "test_connipv6_passed_description": "Goed gedaan! Je internetprovider heeft je een modern internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gegeven. Daardoor kan je andere computers met moderne adressen bereiken.",
  "test_connipv6_passed_summary": "Moderne adressen bereikbaar (IPv6)",
  "test_connipv6_title": "Moderne adressen bereikbaar?",
  "test_connipv6_warning_description": "Helaas! Je internetprovider heeft je <em>geen</em> modern internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gegeven, of <em>niet</em> alles correct ingesteld. Je kan daardoor andere computers met moderne adressen <em>niet</em> bereiken. Vraag je internetprovider om volledige IPv6-connectiviteit.",
  "test_connipv6_warning_summary": "Moderne adressen <em>niet</em> bereikbaar (IPv6)",
  "test_connresolver_failed_description": "Helaas! Domein-handtekeningen (<a href=\"/faqs/dnssec/\">DNSSEC</a>) worden voor jou nu <em>niet</em> gecontroleerd. Daardoor ben je <em>niet</em> beschermd tegen gemanipuleerde vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen. Vraag je internetprovider om DNSSEC-validatie en/of activeer het op je eigen systemen.",
  "test_connresolver_failed_summary": "Domein-handtekeningen <em>niet</em> gecontroleerd (DNSSEC)",
  "test_connresolver_info_description": "Helaas! Domein-handtekeningen (<a href=\"/faqs/dnssec/\">DNSSEC</a>) worden voor jou nu <em>niet</em> gecontroleerd. Daardoor ben je <em>niet</em> beschermd tegen gemanipuleerde vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen. Vraag je internetprovider om DNSSEC-validatie en/of activeer het op je eigen systemen.",
  "test_connresolver_info_summary": "Domein-handtekeningen <em>niet</em> gecontroleerd (DNSSEC)",
  "test_connresolver_label": "Controle van domein-handtekeningen (DNSSEC)",
  "test_connresolver_passed_description": "Goed gedaan! Domein-handtekeningen (<a href=\"/faqs/dnssec/\">DNSSEC</a>) worden voor jou gecontroleerd. Daardoor ben je beschermd tegen vervalste vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen.",
  "test_connresolver_passed_summary": "Domein-handtekeningen gecontroleerd (DNSSEC)",
  "test_connresolver_title": "Domein-handtekeningen gecontroleerd?",
  "test_connresolver_warning_description": "Helaas! Domein-handtekeningen (<a href=\"/faqs/dnssec/\">DNSSEC</a>) worden voor jou nu <em>niet</em> gecontroleerd. Daardoor ben je <em>niet</em> beschermd tegen gemanipuleerde vertaling van ondertekende domeinnamen naar kwaadaardige IP-adressen. Vraag je internetprovider om DNSSEC-validatie en/of activeer het op je eigen systemen.",
  "test_connresolver_warning_summary": "Domein-handtekeningen <em>niet</em> gecontroleerd (DNSSEC)",
  "test_error_summary": "<em>Fout</em> tijdens uitvoering van test!",
  "test_mailauth_failed_description": "Helaas! Je domein bevat <em>niet</em> alle echtheidswaarmerken tegen e-mailvervalsing (<a href=\"/faqs/mailauth/\">DMARC, DKIM en SPF</a>). Ontvangers kunnen daardoor <em>niet</em> betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails. Vraag je mailprovider om DMARC, DKIM en SPF te activeren.",
  "test_mailauth_failed_summary": "<em>Niet</em> alle echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)",
  "test_mailauth_info_description": "Helaas! Je domein bevat <em>niet</em> alle echtheidswaarmerken tegen e-mailvervalsing (<a href=\"/faqs/mailauth/\">DMARC, DKIM en SPF</a>). Ontvangers kunnen daardoor <em>niet</em> betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails. Vraag je mailprovider om DMARC, DKIM en SPF te activeren.",
  "test_mailauth_info_summary": "<em>Niet</em> alle echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)",
  "test_mailauth_label": "Echtheidswaarmerken tegen phishing (DMARC, DKIM en SPF)",
  "test_mailauth_passed_description": "Goed gedaan! Je domein bevat alle echtheidswaarmerken tegen e-mailvervalsing (<a href=\"/faqs/mailauth/\">DMARC, DKIM en SPF</a>). Ontvangers kunnen daardoor betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails.",
  "test_mailauth_passed_summary": "Echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)",
  "test_mailauth_title": "Echtheidswaarmerken tegen e-mailphishing?",
  "test_mailauth_warning_description": "Helaas! Je domein bevat <em>niet</em> alle echtheidswaarmerken tegen e-mailvervalsing (<a href=\"/faqs/mailauth/\">DMARC, DKIM en SPF</a>). Ontvangers kunnen daardoor <em>niet</em> betrouwbaar phishing- of spammails die jouw domeinnaam in hun afzenderadres misbruiken, scheiden van jouw echte e-mails. Vraag je mailprovider om DMARC, DKIM en SPF te activeren.",
  "test_mailauth_warning_summary": "<em>Niet</em> alle echtheidswaarmerken tegen e-mailphishing (DMARC, DKIM en SPF)",
  "test_maildnssec_failed_description": "Helaas! De domeinen van je e-mailadres en mailserver(s) zijn <em>niet</em> (allemaal) ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Verzenders die domeinhandtekeningen controleren, kunnen nu niet betrouwbaar het IP-adres van je ontvangende e-mailserver(s) opvragen. Een aanvaller kan het IP-adres daardoor ongemerkt manipuleren en aan jou gestuurde e-mails omleiden naar een eigen mailserver. Vraag je nameserver-beheerder en/of je mailprovider om DNSSEC te activeren.",
  "test_maildnssec_failed_summary": "<em>Niet</em> alle domeinnamen ondertekend (DNSSEC)",
  "test_maildnssec_info_description": "Helaas! De domeinen van je e-mailadres en mailserver(s) zijn <em>niet</em> (allemaal) ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Verzenders die domeinhandtekeningen controleren, kunnen nu niet betrouwbaar het IP-adres van je ontvangende e-mailserver(s) opvragen. Een aanvaller kan het IP-adres daardoor ongemerkt manipuleren en aan jou gestuurde e-mails omleiden naar een eigen mailserver. Vraag je nameserver-beheerder en/of je mailprovider om DNSSEC te activeren.",
  "test_maildnssec_info_summary": "<em>Niet</em> alle domeinnamen ondertekend (DNSSEC)",
  "test_maildnssec_label": "Ondertekende domeinnamen (DNSSEC)",
  "test_maildnssec_passed_description": "Goed gedaan! Je e-mailadresdomein en je mailserverdomein(en) zijn ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Verzenders die domeinhandtekeningen controleren, kunnen daardoor betrouwbaar het IP-adres van je ontvangende mailserver(s) opvragen.",
  "test_maildnssec_passed_summary": "Alle domeinnamen ondertekend (DNSSEC)",
  "test_maildnssec_title": "Domeinnamen ondertekend?",
  "test_maildnssec_warning_description": "Helaas! De domeinen van je e-mailadres en mailserver(s) zijn <em>niet</em> (allemaal) ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Verzenders die domeinhandtekeningen controleren, kunnen nu niet betrouwbaar het IP-adres van je ontvangende e-mailserver(s) opvragen. Een aanvaller kan het IP-adres daardoor ongemerkt manipuleren en aan jou gestuurde e-mails omleiden naar een eigen mailserver. Vraag je nameserver-beheerder en/of je mailprovider om DNSSEC te activeren.",
  "test_maildnssec_warning_summary": "<em>Niet</em> alle domeinnamen ondertekend (DNSSEC)",
  "test_mailipv6_failed_description": "Helaas! Je mailserver is <em>niet</em> bereikbaar voor verzenders met moderne adressen (<a href=\"/faqs/ipv6/\">IPv6</a>), of er is verbetering mogelijk. Daardoor maakt je mailserver nog geen onderdeel uit van het moderne internet. Vraag je e-mailprovider om IPv6 volledig aan te zetten.",
  "test_mailipv6_failed_summary": "<em>Niet</em> bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)",
  "test_mailipv6_info_description": "Helaas! Je mailserver is <em>niet</em> bereikbaar voor verzenders met moderne adressen (<a href=\"/faqs/ipv6/\">IPv6</a>), of er is verbetering mogelijk. Daardoor maakt je mailserver nog geen onderdeel uit van het moderne internet. Vraag je e-mailprovider om IPv6 volledig aan te zetten.",
  "test_mailipv6_info_summary": "<em>Niet</em> bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)",
  "test_mailipv6_label": "Modern adres (IPv6)",
  "test_mailipv6_passed_description": "Goed gedaan! Je mailserver is bereikbaar voor verzenders met moderne adressen (<a href=\"/faqs/ipv6/\">IPv6</a>). Daardoor is je mailserver volledig onderdeel van het moderne Internet.",
  "test_mailipv6_passed_summary": "Bereikbaar via modern internetadres (IPv6)",
  "test_mailipv6_title": "Bereikbaar via modern internetadres?",
  "test_mailipv6_warning_description": "Helaas! Je mailserver is <em>niet</em> bereikbaar voor verzenders met moderne adressen (<a href=\"/faqs/ipv6/\">IPv6</a>), of er is verbetering mogelijk. Daardoor maakt je mailserver nog geen onderdeel uit van het moderne internet. Vraag je e-mailprovider om IPv6 volledig aan te zetten.",
  "test_mailipv6_warning_summary": "<em>Niet</em> bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)",
  "test_mailrpki_error_description": "De test kan nog niet worden uitgevoerd. Probeer het later nog eens. Sorry voor het ongemak.",
  "test_mailrpki_error_summary": "Test niet klaar om uit te voeren (RPKI)",
  "test_mailrpki_failed_description": "Helaas! Ten minste één van de IP-adressen van je ontvangende mailserver(s) en bijbehorende nameservers heeft een route-aankondiging die <em>niet</em> wordt gematcht door de gepubliceerde route-autorisatie (<a href=\"/faqs/rpki/\">RPKI</a>). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je mailhoster of  je nameserver-hoster (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je mailhoster of nameserver-hoster. Bij een interne fout moeten zij hun netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.",
  "test_mailrpki_failed_summary": "<em>Ongeautoriseerde</em> route-aankondiging (RPKI)",
  "test_mailrpki_info_description": "Ter informatie: Je domein bevat <em>geen</em> nameservers en dus ook geen ontvangende mailserver(s). Er zijn geen routeerbare IP-adressen die kunnen worden getest (<a href=\"/faqs/rpki/\">RPKI</a>).",
  "test_mailrpki_info_summary": "<em>Geen</em> routeerbare IP-adressen gevonden (RPKI)",
  "test_mailrpki_label": "Route-autorisatie (RPKI)",
  "test_mailrpki_passed_description": "Goed gedaan! Alle IP-adressen van je ontvangende mailserver(s) en bijbehorende nameservers hebben een route-aankondiging die wordt gematcht door de gepubliceerde route-autorisatie (<a href=\"/faqs/rpki/\">RPKI</a>). Daardoor is het e-mailtransport tussen verzendende mailservers met ingeschakelde route-validatie en jouw ontvangende mailserver(s) beter beschermd tegen diverse onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers.",
  "test_mailrpki_passed_summary": "Geautoriseerde route-aankondiging (RPKI)",
  "test_mailrpki_title": "Route-autorisatie?",
  "test_mailrpki_warning_description": "Helaas! Ten minste één van de IP-adressen van je mailserver en bijbehorende nameservers heeft een route-aankondiging waarvoor <em>geen</em> route-autorisatie is gepubliceerd (<a href=\"/faqs/rpki/\">RPKI</a>). Daardoor is het e-mailtransport tussen verzendende mailservers met ingeschakelde route-validatie en jouw ontvangende mailserver(s) <em>niet</em> (volledig) beschermd tegen diverse onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers. Neem hierover contact op met je mailhoster of nameserver-hoster. Zij kunnen hun netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.",
  "test_mailrpki_warning_summary": "Route-autorisatie <em>niet</em> gepubliceerd (RPKI)",
  "test_mailtls_failed_description": "Helaas! Verzendende mailservers die beveiligd e-mailtransport (<a href=\"/faqs/starttls/\">STARTTLS en DANE</a>) ondersteunen, kunnen met jouw ontvangende mailserver(s) <em>geen</em> of een <em>onvoldoende</em> beveiligde verbinding opzetten. Passieve en/of actieve aanvallers kunnen daardoor e-mails onderweg naar jou lezen. Vraag je mailprovider om STARTTLS en DANE te activeren, en veilig in te stellen. ",
  "test_mailtls_failed_summary": "Mailserver-verbinding <em>niet</em> of onvoldoende beveiligd (STARTTLS en DANE)",
  "test_mailtls_info_description": "Helaas! Verzendende mailservers die beveiligd e-mailtransport (<a href=\"/faqs/starttls/\">STARTTLS en DANE</a>) ondersteunen, kunnen met jouw ontvangende mailserver(s) <em>geen</em> of een <em>onvoldoende</em> beveiligde verbinding opzetten. Passieve en/of actieve aanvallers kunnen daardoor e-mails onderweg naar jou lezen. Vraag je mailprovider om STARTTLS en DANE te activeren, en veilig in te stellen. ",
  "test_mailtls_info_summary": "Mailserver-verbinding <em>niet</em> of onvoldoende beveiligd (STARTTLS en DANE)",
  "test_mailtls_invalid_null_mx_description": "Waarschuwing: Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, óf je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is. Óf op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "test_mailtls_invalid_null_mx_summary": "Tegenstrijdig geconfigureerd niet-ontvangend maildomein (STARTTLS en DANE)",
  "test_mailtls_label": "Beveiligde mailserver-verbinding (STARTTLS en DANE)",
  "test_mailtls_no_mx_description": "Ter informatie: Het SPF-record op je domeinnaam geeft aan dat je domeinnaam kan worden gebruikt voor het verzenden van e-mail. Je domeinnaam heeft echter geen ontvangende mailserver (MX), wat de bezorgbaarheid van je verzonden e-mail kan belemmeren omdat het ontbreken van een MX door ontvangers kan worden gezien als een indicator voor spam. Als je daarom echt mail vanaf deze domeinnaam wilt verzenden, configureer dan een MX. Als je echter geen mail wilt versturen vanaf deze domeinnaam, configureer dan een SPF-record met alleen de term <code>-all</code> en daarnaast een \"Null MX\" record als je domeinnaam A/AAAA-records heeft. Vanwege je configuratie zijn de subtests in de categorie STARTTLS en DANE en de mailserver-specifieke subtests in de categorieën IPv6 en DNSSEC niet van toepassing.",
  "test_mailtls_no_mx_summary": "Goed geconfigureerd niet-ontvangend mail domein (STARTTLS en DANE)",
  "test_mailtls_no_null_mx_description": "Ter informatie: Er zijn geen ontvangende mailservers (MX) ingesteld op je domein dat A/AAAA-records heeft en dat een SPF-record heeft met alleen de term <code>-all</code>. We raden je aan een \"Null MX\" record in te stellen om expliciet aan te geven dat je domein geen e-mail accepteert. Vanwege je configuratie zijn de subtests in de categorie STARTTLS en DANE en de mailserver-specifieke subtests in de categorieën IPv6 en DNSSEC niet van toepassing.",
  "test_mailtls_no_null_mx_summary": "Niet expliciet geconfigureerd niet-ontvangend mail domein (STARTTLS en DANE)",
  "test_mailtls_null_mx_description": "Ter informatie: Je domeinnaam die A/AAAA-records heeft, geeft duidelijk aan dat het geen e-mail accepteert door een \"Null MX\" record te adverteren. Dat is prima als je geen e-mail wilt ontvangen. Je configuratie maakt de subtesten in de categorieën voor STARTTLS en DANE niet van toepassing. Dit geldt ook voor de mailserver-specifieke subtesten in de categorieën voor IPv6 en DNSSEC.",
  "test_mailtls_null_mx_summary": "Goed geconfigureerd niet-ontvangend mail domein (STARTTLS en DANE)",
  "test_mailtls_null_mx_with_other_mx_description": "Waarschuwing: Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, op je domeinnaam is een ontvangende mailserver ingesteld door een ander MX record, waardoor de \"Null MX\" tegenstrijdig is.",
  "test_mailtls_null_mx_with_other_mx_summary": "Tegenstrijdig geconfigureerd niet-ontvangend maildomein (STARTTLS en DANE)",
  "test_mailtls_null_mx_without_a_aaaa_description": "Waarschuwing: Je domeinnaam adverteert een \"Null MX\" record dat aangeeft dat deze geen e-mail accepteert. Echter, je domeinnaam heeft geen A/AAAA records, waardoor het \"Null MX\" record onnodig is.",
  "test_mailtls_null_mx_without_a_aaaa_summary": "Goed geconfigureerd niet-ontvangend mail domein, maar met overbodig record (STARTTLS en DANE)",
  "test_mailtls_passed_description": "Goed gedaan! Verzendende mailservers die beveiligd e-mailtransport (<a href=\"/faqs/starttls/\">STARTTLS en DANE</a>) ondersteunen, kunnen met jouw ontvangende mailserver(s) een beveiligde verbinding opzetten. STARTTLS voorkomt dat passieve aanvallers e-mails onderweg naar jou kunnen lezen. DANE beschermt tegen actieve aanvallers, die door manipulatie van het mailverkeer de STARTTLS-encryptie kunnen verwijderen.",
  "test_mailtls_passed_summary": "Mailserver-verbinding voldoende beveiligd (STARTTLS en DANE)",
  "test_mailtls_title": "Beveiligde mailserver-verbinding?",
  "test_mailtls_unreachable_description": "Testfout: tenminste één van jouw ontvangende mailservers was niet bereikbaar voor ons. Daardoor was het onmogelijk om de test voor STARTTLS en DANE (volledig) uit te voeren. Dit kan worden veroorzaakt door netwerkconnectiviteitsproblemen of door het niet accepteren van connecties door jouw mailserver(s).",
  "test_mailtls_unreachable_summary": "Onbereikbare ontvangende mailserver (STARTTLS en DANE)",
  "test_mailtls_untestable_description": "Testfout: tenminste één van jouw ontvangende mailservers was niet testbaar voor ons. Daardoor was het niet mogelijk om de test voor STARTTLS en DANE (volledig) uit te voeren. Dit kan worden veroorzaakt door onder meer SMTP errors en geactiveerde ratelimiting-maatregelen die verbindingen tegenhouden.",
  "test_mailtls_untestable_summary": "Niet-testbare mailserver (STARTTLS en DANE)",
  "test_mailtls_warning_description": "Helaas! Verzendende mailservers die beveiligd e-mailtransport (<a href=\"/faqs/starttls/\">STARTTLS en DANE</a>) ondersteunen, kunnen met jouw ontvangende mailserver(s) <em>geen</em> of een <em>onvoldoende</em> beveiligde verbinding opzetten. Passieve en/of actieve aanvallers kunnen daardoor e-mails onderweg naar jou lezen. Vraag je mailprovider om STARTTLS en DANE te activeren, en veilig in te stellen. ",
  "test_mailtls_warning_summary": "Mailserver-verbinding <em>niet</em> of onvoldoende beveiligd (STARTTLS en DANE)",
  "test_siteappsecpriv_failed_description": "Helaas! <em>Niet</em> alle vereiste beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website (<a href=\"/faqs/appsecpriv/\">Beveiligingsopties</a>). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Security headers zijn ook relevant voor domeinen met HTTP response codes zoals '301 Redirect' en '404 Not Found', omdat ze hun eigen browsercontext creëren (MIME type 'text/html') die kwetsbaar kan zijn voor bepaalde aanvallen. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties.",
  "test_siteappsecpriv_failed_summary": "Een of meer vereiste beveiligingsopties <em>niet</em> ingesteld (Beveiligingsopties) ",
  "test_siteappsecpriv_info_description": "Ter informatie: <em>Niet</em> alle optionele beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website (<a href=\"/faqs/appsecpriv/\">Beveiligingsopties</a>). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Security headers zijn ook relevant voor domeinen met HTTP response codes zoals '301 Redirect' en '404 Not Found', omdat ze hun eigen browsercontext creëren (MIME type 'text/html') die kwetsbaar kan zijn voor bepaalde aanvallen. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties.",
  "test_siteappsecpriv_info_summary": "Een of meer optionele beveiligingsopties <em>niet</em> ingesteld (Beveiligingsopties) ",
  "test_siteappsecpriv_label": "Beveiligingsopties",
  "test_siteappsecpriv_passed_description": "Goed gedaan! Alle beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website (<a href=\"/faqs/appsecpriv/\">Beveiligingsopties</a>). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Security headers zijn ook relevant voor domeinen met HTTP response codes zoals '301 Redirect' en '404 Not Found', omdat ze hun eigen browsercontext creëren (MIME type 'text/html') die kwetsbaar kan zijn voor bepaalde aanvallen. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties.",
  "test_siteappsecpriv_passed_summary": "Alle beveiligingsopties ingesteld (Beveiligingsopties)",
  "test_siteappsecpriv_title": "Beveiligingsopties ingesteld?",
  "test_siteappsecpriv_warning_description": "Waarschuwing: <em>Niet</em> alle aanbevolen beveiligingsopties, dat wil zeggen security headers en security.txt, zijn ingesteld voor je website (<a href=\"/faqs/appsecpriv/\">Beveiligingsopties</a>). Met security headers kan je browsermechanismen activeren om bezoekers te beschermen tegen aanvallen met bijvoorbeeld cross-site scripting (XSS) of framing. Security headers zijn ook relevant voor domeinen met HTTP response codes zoals '301 Redirect' en '404 Not Found', omdat ze hun eigen browsercontext creëren (MIME type 'text/html') die kwetsbaar kan zijn voor bepaalde aanvallen. Via een security.txt-bestand kan je onderzoekers die een kwetsbaarheid op je systemen hebben gevonden, voorzien van je contactgegevens en je Coordinated Vulnerability Disclosure policy. Merk op dat HTTPS een voorwaarde is voor alle geteste beveiligingsopties.",
  "test_siteappsecpriv_warning_summary": "Een of meer aanbevolen beveiligingsopties <em>niet</em> ingesteld (Beveiligingsopties) ",
  "test_sitednssec_failed_description": "Helaas! Je domeinnaam is <em>niet</em> ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, <em>niet</em> beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen. Vraag je nameserver-beheerder (vaak je registrar en/of hostingprovider) om DNSSEC te activeren.",
  "test_sitednssec_failed_summary": "Domeinnaam <em>niet</em> ondertekend (DNSSEC)",
  "test_sitednssec_info_description": "Helaas! Je domeinnaam is <em>niet</em> ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, <em>niet</em> beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen. Vraag je nameserver-beheerder (vaak je registrar en/of hostingprovider) om DNSSEC te activeren.",
  "test_sitednssec_info_summary": "Domeinnaam <em>niet</em> ondertekend (DNSSEC)",
  "test_sitednssec_label": "Ondertekende domeinnaam (DNSSEC)",
  "test_sitednssec_passed_description": "Goed gedaan! Je domeinnaam is ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen.",
  "test_sitednssec_passed_summary": "Domeinnaam ondertekend (DNSSEC)",
  "test_sitednssec_title": "Domeinnaam ondertekend?",
  "test_sitednssec_warning_description": "Helaas! Je domeinnaam is <em>niet</em> ondertekend met een geldige handtekening (<a href=\"/faqs/dnssec/\">DNSSEC</a>). Daardoor zijn bezoekers die controle van domein-handtekeningen geactiveerd hebben, <em>niet</em> beschermd tegen gemanipuleerde vertaling van jouw domeinnaam naar kwaadaardige internetadressen. Vraag je nameserver-beheerder (vaak je registrar en/of hostingprovider) om DNSSEC te activeren.",
  "test_sitednssec_warning_summary": "Domeinnaam <em>niet</em> ondertekend (DNSSEC)",
  "test_siteipv6_failed_description": "Helaas! Je website is <em>niet</em> bereikbaar voor bezoekers die een modern internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gebruiken, of er is verbetering mogelijk. Daardoor maakt je website nog geen onderdeel uit van het moderne internet. Vraag je hostingprovider om IPv6 volledig aan te zetten.",
  "test_siteipv6_failed_summary": "<em>Niet</em> bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)",
  "test_siteipv6_info_description": "Helaas! Je website is <em>niet</em> bereikbaar voor bezoekers die een modern internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gebruiken, of er is verbetering mogelijk. Daardoor maakt je website nog geen onderdeel uit van het moderne internet. Vraag je hostingprovider om IPv6 volledig aan te zetten.",
  "test_siteipv6_info_summary": "<em>Niet</em> bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)",
  "test_siteipv6_label": "Modern adres (IPv6)",
  "test_siteipv6_passed_description": "Goed gedaan! Je website is bereikbaar voor bezoekers die een moderne internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gebruiken, en daardoor volledig onderdeel van het moderne internet.",
  "test_siteipv6_passed_summary": "Bereikbaar via moderne internetadres (IPv6)",
  "test_siteipv6_title": "Bereikbaar via modern adres?",
  "test_siteipv6_warning_description": "Helaas! Je website is <em>niet</em> bereikbaar voor bezoekers die een modern internetadres (<a href=\"/faqs/ipv6/\">IPv6</a>) gebruiken, of er is verbetering mogelijk. Daardoor maakt je website nog geen onderdeel uit van het moderne internet. Vraag je hostingprovider om IPv6 volledig aan te zetten.",
  "test_siteipv6_warning_summary": "<em>Niet</em> bereikbaar via modern internetadres, of verbetering mogelijk (IPv6)",
  "test_siterpki_error_description": "De test kan nog niet worden uitgevoerd. Probeer het later nog eens. Sorry voor het ongemak.",
  "test_siterpki_error_summary": "Test niet klaar om uit te voeren (RPKI)",
  "test_siterpki_failed_description": "Helaas! Ten minste één van de IP-adressen van je ontvangende webserver en bijbehorende nameservers heeft een route-aankondiging die <em>niet</em> wordt gematcht door de gepubliceerde route-autorisatie (<a href=\"/faqs/rpki/\">RPKI</a>). Dit duidt op een onbedoelde of kwaadwillige route-configuratiefout, die wordt veroorzaakt door je webhoster of  je nameserver-hoster (interne fout) óf door een derde partij (externe fout). In beide gevallen verhoogt dit het risico dat je server onbereikbaar wordt of dat internetverkeer naar je server wordt onderschept. Neem zo spoedig mogelijk contact op met je webhoster of nameserver-hoster. Bij een interne fout moeten zij hun netwerkprovider die eigenaar is van de IP-adressen van je server, vragen om de route-configuratiefout te herstellen.",
  "test_siterpki_failed_summary": "<em>Ongeautoriseerde</em> route-aankondiging (RPKI)",
  "test_siterpki_info_description": "Ter informatie: Je domein bevat <em>geen</em> nameservers en dus ook geen IP-adressen van webservers. Er zijn geen routeerbare IP-adressen die kunnen worden getest (<a href=\"/faqs/rpki/\">RPKI</a>).",
  "test_siterpki_info_summary": "<em>Geen</em> routeerbare IP-adressen gevonden (RPKI)",
  "test_siterpki_label": "Route-autorisatie (RPKI)",
  "test_siterpki_passed_description": "Goed gedaan! Alle IP-adressen van je webserver en bijbehorende nameservers hebben een route-aankondiging die wordt gematcht door de gepubliceerde route-autorisatie (<a href=\"/faqs/rpki/\">RPKI</a>). Daardoor zijn bezoekers met ingeschakelde route-validatie beter beschermd tegen verschillende onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers.",
  "test_siterpki_passed_summary": "Geautoriseerde route-aankondiging (RPKI)",
  "test_siterpki_title": "Route-autorisatie?",
  "test_siterpki_warning_description": "Helaas! Ten minste één van de IP-adressen van je webserver en bijbehorende nameservers heeft een route-aankondiging waarvoor <em>geen</em> route-autorisatie is gepubliceerd (<a href=\"/faqs/rpki/\">RPKI</a>). Als gevolg daarvan zijn bezoekers met ingeschakelde routevalidatie <em>niet</em> (volledig) beschermd tegen verschillende onbedoelde of kwaadwillige route-configuratiefouten, die kunnen leiden tot de onbereikbaarheid van je servers of de onderschepping van internetverkeer naar je servers. Neem hierover contact op met je webhoster of nameserver-hoster. Zij kunnen hun netwerkprovider die eigenaar is van de IP-adressen van je server vragen om route-autorisaties te publiceren.",
  "test_siterpki_warning_summary": "Route-autorisatie <em>niet</em> gepubliceerd (RPKI)",
  "test_sitetls_failed_description": "Helaas! De verbinding met je website is <em>niet</em> of <em>onvoldoende</em> beveiligd (<a href=\"/faqs/https/\">HTTPS</a>). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor <em>niet</em> voldoende beschermd tegen afluisteren en manipulatie. Vraag je hostingprovider om HTTPS aan te zetten en veilig te configureren.",
  "test_sitetls_failed_summary": "Verbinding <em>niet</em> of onvoldoende beveiligd (HTTPS)",
  "test_sitetls_info_description": "Helaas! De verbinding met je website is <em>niet</em> of <em>onvoldoende</em> beveiligd (<a href=\"/faqs/https/\">HTTPS</a>). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor <em>niet</em> voldoende beschermd tegen afluisteren en manipulatie. Vraag je hostingprovider om HTTPS aan te zetten en veilig te configureren.",
  "test_sitetls_info_summary": "Verbinding <em>niet</em> of onvoldoende beveiligd (HTTPS)",
  "test_sitetls_label": "Beveiligde verbinding (HTTPS)",
  "test_sitetls_passed_description": "Goed gedaan! De verbinding met je website is voldoende beveiligd (<a href=\"/faqs/https/\">HTTPS</a>). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor beschermd tegen afluisteren en manipulatie.",
  "test_sitetls_passed_summary": "Verbinding voldoende beveiligd (HTTPS)",
  "test_sitetls_title": "Beveiligde verbinding?",
  "test_sitetls_unreachable_description": "Je webserver was niet bereikbaar voor ons. Daardoor was het onmogelijk om de test voor HTTPS (volledig) uit te voeren. Dit kan worden veroorzaakt door netwerkconnectiviteitsproblemen of door het niet accepteren van connecties door jouw webserver.",
  "test_sitetls_unreachable_summary": "Onbereikbare webserver (HTTPS)",
  "test_sitetls_warning_description": "Helaas! De verbinding met je website is <em>niet</em> of <em>onvoldoende</em> beveiligd (<a href=\"/faqs/https/\">HTTPS</a>). Gegevens die onderweg zijn tussen je website en haar bezoekers, zijn daardoor <em>niet</em> voldoende beschermd tegen afluisteren en manipulatie. Vraag je hostingprovider om HTTPS aan te zetten en veilig te configureren.",
  "test_sitetls_warning_summary": "Verbinding <em>niet</em> of onvoldoende beveiligd (HTTPS)",
  "widget_content_notes": "<h2>Opmerkingen</h2><ul><li>Logo: We raden aan om ons <a href=\"/static/logo_nl.svg\">logo</a> op je eigen webserver op te slaan en te gebruiken. Op die manier is er geen contact met onze webserver als je website wordt bezocht.</li><li>Content-Security-Policy (CSP): Indien je op je website gebruikmaakt van CSP, dan zou je <code>internet.nl</code> moeten toevoegen aan de regels voor <code>form-action</code> en eventueel ook voor <code>img-src</code> als je linkt naar het logo op onze webserver.</li></ul>",
  "widget_mail_html_block": "<strong>Test je e-mail</strong>",
  "widget_mail_intro": "<h1>E-mailtest widget</h1><p>Wil je dat bezoekers van jouw website direct een e-mailtest kunnen starten?<br />Neem dan de HTML- en CSS-code uit onderstaande tekstvakken op in de broncode van je website.</p>",
  "widget_site_html_block": "<strong>Test je website</strong>",
  "widget_site_intro": "<h1>Websitetest widget</h1><p>Wil je dat bezoekers van jouw website direct een websitetest kunnen starten?<br />Neem dan de HTML- en CSS-code uit onderstaande tekstvakken op in de broncode van je website.</p>"
}